Repository: NyaPuma/python-docs-pt
Catalog: faq/extending.po
Languages: pt_pt

source: Extending/Embedding FAQ
pt_pt: Perguntas frequentes sobre extensão/integração

source: Contents
pt_pt: Conteúdos

source: Can I create my own functions in C?
pt_pt: Posso criar as minhas próprias funções em C?

source: Yes, you can create built-in modules containing functions, variables, exceptions and even new types in C. This is explained in the document :ref:`extending-index`.
pt_pt: Sim, é possível criar módulos integrados que contêm funções, variáveis, exceções e até mesmo novos tipos em C. Isso é explicado no documento :ref:`extending-index`.

source: Most intermediate or advanced Python books will also cover this topic.
pt_pt: A maioria dos livros de Python de nível intermediário ou avançado também abordam este tópico.

source: Can I create my own functions in C++?
pt_pt: Posso criar as minhas próprias funções em C++?

source: Yes, using the C compatibility features found in C++. Place ``extern "C" { ... }`` around the Python include files and put ``extern "C"`` before each function that is going to be called by the Python interpreter. Global or static C++ objects with constructors are probably not a good idea.
pt_pt: Sim, se utilizar os recursos de compatibilidade C encontrados em C++. Coloque ``extern "C" { ... }`` em torno dos ficheiros de inclusão Python e coloque ``extern "C"`` antes de cada função que será chamada pelo interpretador Python. Objetos C++ globais ou estáticos com construtores provavelmente não são uma boa ideia.

source: Writing C is hard; are there any alternatives?
pt_pt: Escrever em C é difícil; há alternativas?

source: There are a number of alternatives to writing your own C extensions, depending on what you're trying to do. :ref:`Recommended third party tools <c-api-tools>` offer both simpler and more sophisticated approaches to creating C and C++ extensions for Python.
pt_pt: Existem várias alternativas para escrever as suas próprias extensões C, dependendo do que pretende fazer. :ref:`Ferramentas de terceiros recomendadas <c-api-tools>` oferecem abordagens mais simples e sofisticadas para criar extensões C e C++ para Python.

source: How can I execute arbitrary Python statements from C?
pt_pt: Como posso executar instruções Python arbitrárias a partir de C?

source: The highest-level function to do this is :c:func:`PyRun_SimpleString` which takes a single string argument to be executed in the context of the module ``__main__`` and returns ``0`` for success and ``-1`` when an exception occurred (including :exc:`SyntaxError`). If you want more control, use :c:func:`PyRun_String`; see the source for :c:func:`PyRun_SimpleString` in ``Python/pythonrun.c``.
pt_pt: A função de nível mais alto para fazer isso é :c:func:`PyRun_SimpleString`, que recebe um único argumento de string para ser executado no contexto do módulo ``__main__`` e retorna ``0`` em caso de sucesso e ``-1`` quando ocorre uma exceção (incluindo :exc:`SyntaxError`). Se desejar mais controlo, utilize :c:func:`PyRun_String`; consulte o código-fonte de :c:func:`PyRun_SimpleString` em ``Python/pythonrun.c``.

source: How can I evaluate an arbitrary Python expression from C?
pt_pt: Como posso avaliar uma expressão Python arbitrária a partir de C?

source: Call the function :c:func:`PyRun_String` from the previous question with the start symbol :c:data:`Py_eval_input`; it parses an expression, evaluates it and returns its value.
pt_pt: Chame a função :c:func:`PyRun_String` da pergunta anterior com o símbolo inicial :c:data:`Py_eval_input`; ela analisa uma expressão, avalia-a e retorna o seu valor.

source: How do I extract C values from a Python object?
pt_pt: Como extrair valores C de um objeto Python?

source: That depends on the object's type. If it's a tuple, :c:func:`PyTuple_Size` returns its length and :c:func:`PyTuple_GetItem` returns the item at a specified index. Lists have similar functions, :c:func:`PyList_Size` and :c:func:`PyList_GetItem`.
pt_pt: Isso depende do tipo do objeto. Se for um tuplo, :c:func:`PyTuple_Size` retorna o seu comprimento e :c:func:`PyTuple_GetItem` retorna o item em um índice especificado. As listas têm funções semelhantes, :c:func:`PyList_Size` e :c:func:`PyList_GetItem`.

source: For bytes, :c:func:`PyBytes_Size` returns its length and :c:func:`PyBytes_AsStringAndSize` provides a pointer to its value and its length. Note that Python bytes objects may contain null bytes so C's :c:func:`!strlen` should not be used.
pt_pt: Para bytes, :c:func:`PyBytes_Size` retorna o seu comprimento e :c:func:`PyBytes_AsStringAndSize` fornece um ponteiro para o seu valor e comprimento. Observe que os objetos bytes do Python podem conter bytes nulos, portanto, :c:func:`!strlen` do C não deve ser usado.

source: To test the type of an object, first make sure it isn't ``NULL``, and then use :c:func:`PyBytes_Check`, :c:func:`PyTuple_Check`, :c:func:`PyList_Check`, etc.
pt_pt: Para testar o tipo de um objeto, primeiro certifique-se de que ele não é ``NULL`` e, em seguida, use :c:func:`PyBytes_Check`, :c:func:`PyTuple_Check`, :c:func:`PyList_Check`, etc.

source: There is also a high-level API to Python objects which is provided by the so-called 'abstract' interface -- read ``Include/abstract.h`` for further details. It allows interfacing with any kind of Python sequence using calls like :c:func:`PySequence_Length`, :c:func:`PySequence_GetItem`, etc. as well as many other useful protocols such as numbers (:c:func:`PyNumber_Index` et al.) and mappings in the PyMapping APIs.
pt_pt: Existe também uma API de alto nível para objetos Python, fornecida pela chamada interface 'abstrata' — leia ``Include/abstract.h`` para obter mais detalhes. Ela permite a interface com qualquer tipo de sequência Python utilizando chamadas como :c:func:`PySequence_Length`, :c:func:`PySequence_GetItem`, etc., bem como muitos outros protocolos úteis, como números (:c:func:`PyNumber_Index` et al.) e mapeamentos nas APIs PyMapping.

source: How do I use Py_BuildValue() to create a tuple of arbitrary length?
pt_pt: Como posso usar Py_BuildValue() para criar um tuplo de comprimento arbitrário?

source: You can't. Use :c:func:`PyTuple_Pack` instead.
pt_pt: Não pode. Use :c:func:`PyTuple_Pack` em vez disso.

source: How do I call an object's method from C?
pt_pt: Como chamar o método de um objeto a partir de C?

source: The :c:func:`PyObject_CallMethod` function can be used to call an arbitrary method of an object. The parameters are the object, the name of the method to call, a format string like that used with :c:func:`Py_BuildValue`, and the argument values::
pt_pt: A função :c:func:`PyObject_CallMethod` pode ser utilizada para chamar um método arbitrário de um objeto. Os parâmetros são o objeto, o nome do método a ser chamado, uma string de formato como a utilizada com :c:func:`Py_BuildValue` e os valores dos argumentos::

source: This works for any object that has methods -- whether built-in or user-defined. You are responsible for eventually :c:func:`Py_DECREF`\ 'ing the return value.
pt_pt: Isto funciona para qualquer objeto que tenha métodos -- sejam eles integrados ou definidos pelo utilizador. Você é responsável por eventualmente :c:func:`Py_DECREF`\ 'ing o valor de retorno.

source: To call, e.g., a file object's "seek" method with arguments 10, 0 (assuming the file object pointer is "f")::
pt_pt: Para chamar, por exemplo, o método "seek" de um objeto de ficheiro com os argumentos 10, 0 (assumindo que o ponteiro do objeto de ficheiro é "f")::

source: Note that since :c:func:`PyObject_CallObject` *always* wants a tuple for the argument list, to call a function without arguments, pass "()" for the format, and to call a function with one argument, surround the argument in parentheses, e.g. "(i)".
pt_pt: Observe que, como :c:func:`PyObject_CallObject` *sempre* requer um tuplo para a lista de argumentos, para chamar uma função sem argumentos, passe "()" para o formato e, para chamar uma função com um argumento, coloque o argumento entre parênteses, por exemplo, "(i)".

source: How do I catch the output from PyErr_Print() (or anything that prints to stdout/stderr)?
pt_pt: Como posso capturar a saída de PyErr_Print() (ou qualquer coisa que imprima em stdout/stderr)?

source: In Python code, define an object that supports the ``write()`` method. Assign this object to :data:`sys.stdout` and :data:`sys.stderr`. Call print_error, or just allow the standard traceback mechanism to work. Then, the output will go wherever your ``write()`` method sends it.
pt_pt: No código Python, defina um objeto que suporte o método ``write()``. Atribua este objeto a :data:`sys.stdout` e :data:`sys.stderr`. Chame print_error ou simplesmente permita que o mecanismo de rastreamento padrão funcione. Então, a saída irá para onde quer que o seu método ``write()`` a envie.

source: The easiest way to do this is to use the :class:`io.StringIO` class:
pt_pt: A maneira mais fácil de fazer isso é usar a classe :class:`io.StringIO`:

source: A custom object to do the same would look like this:
pt_pt: Um objeto personalizado para fazer o mesmo ficaria assim:

source: How do I access a module written in Python from C?
pt_pt: Como posso aceder a um módulo escrito em Python a partir de C?

source: You can get a pointer to the module object as follows::
pt_pt: Pode obter um ponteiro para o objeto do módulo da seguinte forma::

source: If the module hasn't been imported yet (i.e. it is not yet present in :data:`sys.modules`), this initializes the module; otherwise it simply returns the value of ``sys.modules["<modulename>"]``. Note that it doesn't enter the module into any namespace -- it only ensures it has been initialized and is stored in :data:`sys.modules`.
pt_pt: Se o módulo ainda não tiver sido importado (ou seja, ainda não estiver presente em :data:`sys.modules`), isso inicializa o módulo; caso contrário, simplesmente retorna o valor de ``sys.modules["<modulename>"]``. Note que não insere o módulo em nenhum namespace -- apenas garante que ele foi inicializado e está armazenado em :data:`sys.modules`.

source: You can then access the module's attributes (i.e. any name defined in the module) as follows::
pt_pt: Você pode então aceder aos atributos do módulo (ou seja, qualquer nome definido no módulo) da seguinte forma::

source: Calling :c:func:`PyObject_SetAttrString` to assign to variables in the module also works.
pt_pt: Chamar :c:func:`PyObject_SetAttrString` para atribuir a variáveis no módulo também funciona.

source: How do I interface to C++ objects from Python?
pt_pt: Como faço para interagir com objetos C++ a partir do Python?

source: Depending on your requirements, there are many approaches. To do this manually, begin by reading :ref:`the "Extending and Embedding" document <extending-index>`. Realize that for the Python run-time system, there isn't a whole lot of difference between C and C++ -- so the strategy of building a new Python type around a C structure (pointer) type will also work for C++ objects.
pt_pt: Dependendo dos seus requisitos, existem várias abordagens. Para fazer isso manualmente, comece por ler :ref:`o documento "Extending and Embedding" <extending-index>`. Tenha em conta que, para o sistema de tempo de execução Python, não há muita diferença entre C e C++ -- portanto, a estratégia de construir um novo tipo Python em torno de um tipo de estrutura C (ponteiro) também funcionará para objetos C++.

source: For C++ libraries, see :ref:`c-wrapper-software`.
pt_pt: Para bibliotecas C++, consulte :ref:`c-wrapper-software`.

source: I added a module using the Setup file and the make fails; why?
pt_pt: Adicionei um módulo utilizando o ficheiro de configuração e o make falha; porquê?

source: Setup must end in a newline, if there is no newline there, the build process fails. (Fixing this requires some ugly shell script hackery, and this bug is so minor that it doesn't seem worth the effort.)
pt_pt: A configuração deve terminar numa nova linha; se não houver uma nova linha, o processo de compilação falhará. (Corrigir isso requer alguns truques feios de script de shell, e esse bug é tão insignificante que não parece valer a pena o esforço.)

source: How do I debug an extension?
pt_pt: Como posso depurar uma extensão?

source: When using GDB with dynamically loaded extensions, you can't set a breakpoint in your extension until your extension is loaded.
pt_pt: Ao utilizar o GDB com extensões carregadas dinamicamente, não é possível definir um ponto de interrupção na extensão até que ela seja carregada.

source: In your ``.gdbinit`` file (or interactively), add the command:
pt_pt: No seu ficheiro ``.gdbinit`` (ou interativamente), adicione o comando:

source: Then, when you run GDB:
pt_pt: Então, quando executar o GDB:

source: $ gdb /local/bin/python gdb) run myscript.py gdb) continue # repeat until your extension is loaded gdb) finish # so that your extension is loaded gdb) br myfunction.c:50 gdb) continue
pt_pt: $ gdb /local/bin/python gdb) run myscript.py gdb) continue # repita até que a sua extensão seja carregada gdb) finish # para que a sua extensão seja carregada gdb) br myfunction.c:50 gdb) continue

source: I want to compile a Python module on my Linux system, but some files are missing. Why?
pt_pt: Quero compilar um módulo Python no meu sistema Linux, mas alguns ficheiros estão em falta. Porquê?

source: Most packaged versions of Python omit some files required for compiling Python extensions.
pt_pt: A maioria das versões empacotadas do Python omitem alguns ficheiros necessários para compilar extensões do Python.

source: For Red Hat, install the python3-devel RPM to get the necessary files.
pt_pt: Para o Red Hat, instale o RPM python3-devel para obter os ficheiros necessários.

source: For Debian, run ``apt-get install python3-dev``.
pt_pt: Para Debian, execute ``apt-get install python3-dev``.

source: How do I tell "incomplete input" from "invalid input"?
pt_pt: Como distinguir entre "entrada incompleta" e "entrada inválida"?

source: Sometimes you want to emulate the Python interactive interpreter's behavior, where it gives you a continuation prompt when the input is incomplete (e.g. you typed the start of an "if" statement or you didn't close your parentheses or triple string quotes), but it gives you a syntax error message immediately when the input is invalid.
pt_pt: Às vezes, você deseja emular o comportamento do interpretador interativo do Python, que exibe um prompt de continuação quando a entrada está incompleta (por exemplo, você digitou o início de uma instrução "if" ou não fechou os parênteses ou as aspas triplas), mas exibe uma mensagem de erro de sintaxe imediatamente quando a entrada é inválida.

source: In Python you can use the :mod:`codeop` module, which approximates the parser's behavior sufficiently. IDLE uses this, for example.
pt_pt: Em Python, pode usar o módulo :mod:`codeop`, que aproxima suficientemente o comportamento do analisador. O IDLE usa-o, por exemplo.

source: The easiest way to do it in C is to call :c:func:`PyRun_InteractiveLoop` (perhaps in a separate thread) and let the Python interpreter handle the input for you. You can also set the :c:func:`PyOS_ReadlineFunctionPointer` to point at your custom input function. See ``Modules/readline.c`` and ``Parser/myreadline.c`` for more hints.
pt_pt: A maneira mais fácil de fazer isso em C é chamar :c:func:`PyRun_InteractiveLoop` (talvez num thread separado) e deixar o interpretador Python lidar com a entrada para você. Você também pode definir :c:func:`PyOS_ReadlineFunctionPointer` para apontar para a sua função de entrada personalizada. Consulte ``Modules/readline.c`` e ``Parser/myreadline.c`` para obter mais dicas.

source: How do I find undefined g++ symbols __builtin_new or __pure_virtual?
pt_pt: Como posso encontrar os símbolos g++ indefinidos __builtin_new ou __pure_virtual?

source: To dynamically load g++ extension modules, you must recompile Python, relink it using g++ (change LINKCC in the Python Modules Makefile), and link your extension module using g++ (e.g., ``g++ -shared -o mymodule.so mymodule.o``).
pt_pt: Para carregar dinamicamente os módulos de extensão g++, é necessário recompilar o Python, religá-lo utilizando g++ (altere LINKCC no Makefile dos módulos Python) e ligar o seu módulo de extensão utilizando g++ (por exemplo, ``g++ -shared -o mymodule.so mymodule.o``).

source: Can I create an object class with some methods implemented in C and others in Python (e.g. through inheritance)?
pt_pt: Posso criar uma classe de objeto com alguns métodos implementados em C e outros em Python (por exemplo, através de herança)?

source: Yes, you can inherit from built-in classes such as :class:`int`, :class:`list`, :class:`dict`, etc.
pt_pt: Sim, pode herdar de classes integradas, tais como :class:`int`, :class:`list`, :class:`dict`, etc.

source: The Boost Python Library (BPL, https://www.boost.org/libs/python/doc/index.html) provides a way of doing this from C++ (i.e. you can inherit from an extension class written in C++ using the BPL).
pt_pt: A Biblioteca Boost Python (BPL, https://www.boost.org/libs/python/doc/index.html) fornece uma maneira de fazer isso a partir do C++ (ou seja, você pode herdar de uma classe de extensão escrita em C++ utilizando a BPL).
