Repository: NyaPuma/python-docs-pt
Catalog: reference/introduction.po
Languages: pt_pt

source: Introduction
pt_pt: Introdução

source: This reference manual describes the Python programming language. It is not intended as a tutorial.
pt_pt: Este manual de referência descreve a linguagem de programação Python. Não se destina a ser um tutorial.

source: While I am trying to be as precise as possible, I chose to use English rather than formal specifications for everything except syntax and lexical analysis. This should make the document more understandable to the average reader, but will leave room for ambiguities. Consequently, if you were coming from Mars and tried to re-implement Python from this document alone, you might have to guess things and in fact you would probably end up implementing quite a different language. On the other hand, if you are using Python and wonder what the precise rules about a particular area of the language are, you should definitely be able to find them here. If you would like to see a more formal definition of the language, maybe you could volunteer your time --- or invent a cloning machine :-).
pt_pt: Embora tente ser o mais preciso possível, optei por usar o inglês em vez de especificações formais para tudo, exceto para a sintaxe e a análise lexical. Isto deve tornar o documento mais compreensível para o leitor comum, mas deixará espaço para ambiguidades. Consequentemente, se viesse de Marte e tentasse implementar o Python apenas a partir deste documento, teria de adivinhar algumas coisas e, de facto, provavelmente acabaria por implementar uma linguagem bastante diferente. Por outro lado, se está a usar Python e se pergunta quais são as regras precisas sobre uma área específica da linguagem, deverá certamente ser capaz de as encontrar aqui. Se desejar ver uma definição mais formal da linguagem, talvez possa oferecer o seu tempo --- ou inventar uma máquina de clonagem :-).

source: It is dangerous to add too many implementation details to a language reference document --- the implementation may change, and other implementations of the same language may work differently. On the other hand, CPython is the one Python implementation in widespread use (although alternate implementations continue to gain support), and its particular quirks are sometimes worth being mentioned, especially where the implementation imposes additional limitations. Therefore, you'll find short "implementation notes" sprinkled throughout the text.
pt_pt: É perigoso adicionar demasiados detalhes de implementação a um documento de referência da linguagem --- a implementação pode mudar e outras implementações da mesma linguagem podem funcionar de forma diferente. Por outro lado, o CPython é a implementação de Python mais amplamente utilizada (embora outras implementações continuem a ganhar apoio), e as suas peculiaridades às vezes merecem ser mencionadas, especialmente onde a implementação impõe limitações adicionais. Portanto, encontrará breves "notas de implementação" espalhadas por todo o texto.

source: Every Python implementation comes with a number of built-in and standard modules. These are documented in :ref:`library-index`. A few built-in modules are mentioned when they interact in a significant way with the language definition.
pt_pt: Cada implementação de Python vem com uma série de módulos integrados (*built-in*) e padrão. Estes estão documentados no :ref:`library-index`. Alguns módulos integrados são mencionados quando interagem de forma significativa com a definição da linguagem.

source: Alternate Implementations
pt_pt: Implementações Alternativas

source: Though there is one Python implementation which is by far the most popular, there are some alternate implementations which are of particular interest to different audiences.
pt_pt: Embora exista uma implementação de Python que é, de longe, a mais popular, existem algumas implementações alternativas que são de interesse particular para diferentes públicos.

source: Known implementations include:
pt_pt: Implementações conhecidas incluem:

source: This is the original and most-maintained implementation of Python, written in C. New language features generally appear here first.
pt_pt: Esta é a implementação original e a mais mantida do Python, escrita em C. As novas funcionalidades da linguagem geralmente aparecem aqui primeiro.

source: Python implemented in Java. This implementation can be used as a scripting language for Java applications, or can be used to create applications using the Java class libraries. It is also often used to create tests for Java libraries. More information can be found at `the Jython website <https://www.jython.org/>`_.
pt_pt: Python implementado em Java. Esta implementação pode ser usada como uma linguagem de script para aplicações Java, ou pode ser usada para criar aplicações usando as bibliotecas de classes Java. É também frequentemente usada para criar testes para bibliotecas Java. Pode encontrar mais informações no `site do Jython <https://www.jython.org/>`_.

source: Python for .NET
pt_pt: Python para .NET

source: This implementation actually uses the CPython implementation, but is a managed .NET application and makes .NET libraries available. It was created by Brian Lloyd. For more information, see the `Python for .NET home page <https://pythonnet.github.io/>`_.
pt_pt: Esta implementação utiliza na realidade a implementação CPython, mas é uma aplicação .NET gerida e disponibiliza as bibliotecas .NET. Foi criada por Brian Lloyd. Para mais informações, consulte a `página inicial do Python para .NET <https://pythonnet.github.io/>`_.

source: An alternate Python for .NET. Unlike Python.NET, this is a complete Python implementation that generates IL, and compiles Python code directly to .NET assemblies. It was created by Jim Hugunin, the original creator of Jython. For more information, see `the IronPython website <https://ironpython.net/>`_.
pt_pt: Um Python alternativo para .NET. Ao contrário do Python.NET, esta é uma implementação completa de Python que gera IL e compila o código Python diretamente para assemblies .NET. Foi criada por Jim Hugunin, o criador original do Jython. Para mais informações, consulte o `site do IronPython <https://ironpython.net/>`_.

source: An implementation of Python written completely in Python. It supports several advanced features not found in other implementations like stackless support and a Just in Time compiler. One of the goals of the project is to encourage experimentation with the language itself by making it easier to modify the interpreter (since it is written in Python). Additional information is available on `the PyPy project's home page <https://pypy.org/>`_.
pt_pt: Uma implementação de Python escrita inteiramente em Python. Suporta várias funcionalidades avançadas não encontradas noutras implementações, como suporte *stackless* e um compilador *Just in Time* (JIT). Um dos objetivos do projeto é incentivar a experimentação com a própria linguagem, tornando mais fácil modificar o intérprete (uma vez que está escrito em Python). Informações adicionais estão disponíveis na `página inicial do projeto PyPy <https://pypy.org/>`_.

source: Each of these implementations varies in some way from the language as documented in this manual, or introduces specific information beyond what's covered in the standard Python documentation. Please refer to the implementation-specific documentation to determine what else you need to know about the specific implementation you're using.
pt_pt: Cada uma destas implementações varia de alguma forma da linguagem documentada neste manual, ou introduz informações específicas além do que é coberto pela documentação padrão do Python. Por favor, consulte a documentação específica da implementação para determinar o que mais precisa de saber sobre a implementação específica que está a utilizar.

source: Notation
pt_pt: Notação

source: The descriptions of lexical analysis and syntax use a grammar notation that is a mixture of `EBNF <https://en.wikipedia.org/wiki/Extended_Backus%E2%80%93Naur_form>`_ and `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_. For example:
pt_pt: As descrições de análise lexical e sintaxe utilizam uma notação gramatical que é uma mistura de `EBNF <https://en.wikipedia.org/wiki/Extended_Backus%E2%80%93Naur_form>`_ e `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_. Por exemplo:

source: In this example, the first line says that a ``name`` is a ``letter`` followed by a sequence of zero or more ``letter``\ s, ``digit``\ s, and underscores. A ``letter`` in turn is any of the single characters ``'a'`` through ``'z'`` and ``A`` through ``Z``; a ``digit`` is a single character from ``0`` to ``9``.
pt_pt: Neste exemplo, a primeira linha diz que um ``name`` é uma ``letter`` seguida de uma sequência de zero ou mais ``letter``\ s, ``digit``\ s e underscores. Uma ``letter`` por sua vez é qualquer um dos caracteres individuais de ``'a'`` a ``'z'`` e de ``A`` a ``Z``; um ``digit`` é um único caractere de ``0`` a ``9``.

source: Each rule begins with a name (which identifies the rule that's being defined) followed by a colon, ``:``. The definition to the right of the colon uses the following syntax elements:
pt_pt: Cada regra começa com um nome (que identifica a regra que está a ser definida) seguido de dois pontos, ``:``. A definição à direita dos dois pontos utiliza os seguintes elementos de sintaxe:

source: ``name``: A name refers to another rule. Where possible, it is a link to the rule's definition.
pt_pt: ``name``: Um nome refere-se a outra regra. Sempre que possível, é uma ligação para a definição da regra.

source: ``TOKEN``: An uppercase name refers to a :term:`token`. For the purposes of grammar definitions, tokens are the same as rules.
pt_pt: ``TOKEN``: Um nome em maiúsculas refere-se a um :term:`token`. Para fins de definições gramaticais, os tokens são o mesmo que regras.

source: ``"text"``, ``'text'``: Text in single or double quotes must match literally (without the quotes). The type of quote is chosen according to the meaning of ``text``:
pt_pt: ``"texto"``, ``'texto'``: O texto em aspas simples ou duplas deve corresponder literalmente (sem as aspas). O tipo de aspa é escolhido de acordo com o significado do ``texto``:

source: ``'if'``: A name in single quotes denotes a :ref:`keyword <keywords>`.
pt_pt: ``'if'``: Um nome em aspas simples denota uma :ref:`palavra-chave <keywords>`.

source: ``"case"``: A name in double quotes denotes a :ref:`soft-keyword <soft-keywords>`.
pt_pt: ``"case"``: Um nome em aspas duplas denota uma :ref:`soft-keyword <soft-keywords>`.

source: ``'@'``: A non-letter symbol in single quotes denotes an :py:data:`~token.OP` token, that is, a :ref:`delimiter <delimiters>` or :ref:`operator <operators>`.
pt_pt: ``'@'``: Um símbolo que não seja letra em aspas simples denota um token :py:data:`~token.OP`, ou seja, um :ref:`delimitador <delimiters>` ou :ref:`operador <operators>`.

source: ``e1 e2``: Items separated only by whitespace denote a sequence. Here, ``e1`` must be followed by ``e2``.
pt_pt: ``e1 e2``: Itens separados apenas por espaços em branco denotam uma sequência. Aqui, ``e1`` deve ser seguido por ``e2``.

source: ``e1 | e2``: A vertical bar is used to separate alternatives. It denotes PEG's "ordered choice": if ``e1`` matches, ``e2`` is not considered. In traditional PEG grammars, this is written as a slash, ``/``, rather than a vertical bar. See :pep:`617` for more background and details.
pt_pt: ``e1 | e2``: Uma barra vertical é usada para separar alternativas. Denota a "escolha ordenada" do PEG: se ``e1`` corresponder, ``e2`` não é considerado. Nas gramáticas PEG tradicionais, isto é escrito com uma barra, ``/``, em vez de uma barra vertical. Consulte o :pep:`617` para mais contexto e detalhes.

source: ``e*``: A star means zero or more repetitions of the preceding item.
pt_pt: ``e*``: Um asterisco significa zero ou mais repetições do item anterior.

source: ``e+``: Likewise, a plus means one or more repetitions.
pt_pt: ``e+``: Da mesma forma, um sinal de mais significa uma ou mais repetições.

source: ``[e]``: A phrase enclosed in square brackets means zero or one occurrences. In other words, the enclosed phrase is optional.
pt_pt: ``[e]``: Uma frase entre parênteses retos significa zero ou uma ocorrência. Por outras palavras, a frase incluída é opcional.

source: ``e?``: A question mark has exactly the same meaning as square brackets: the preceding item is optional.
pt_pt: ``e?``: Um ponto de interrogação tem exatamente o mesmo significado que os parênteses retos: o item anterior é opcional.

source: ``(e)``: Parentheses are used for grouping.
pt_pt: ``(e)``: Parênteses são usados para agrupamento.

source: The following notation is only used in :ref:`lexical definitions <notation-lexical-vs-syntactic>`.
pt_pt: A seguinte notação é usada apenas em :ref:`definições lexicais <notation-lexical-vs-syntactic>`.

source: ``"a"..."z"``: Two literal characters separated by three dots mean a choice of any single character in the given (inclusive) range of ASCII characters.
pt_pt: ``"a"..."z"``: Dois caracteres literais separados por três pontos significam a escolha de qualquer caractere único no intervalo dado (inclusive) de caracteres ASCII.

source: ``<...>``: A phrase between angular brackets gives an informal description of the matched symbol (for example, ``<any ASCII character except "\">``), or an abbreviation that is defined in nearby text (for example, ``<Lu>``).
pt_pt: ``<...>``: Uma frase entre parênteses angulares fornece uma descrição informal do símbolo correspondido (por exemplo, ``<qualquer caractere ASCII exceto "\">``), ou uma abreviatura que é definida no texto próximo (por exemplo, ``<Lu>``).

source: Some definitions also use *lookaheads*, which indicate that an element must (or must not) match at a given position, but without consuming any input:
pt_pt: Algumas definições também usam *lookaheads*, que indicam que um elemento deve (ou não deve) corresponder numa determinada posição, mas sem consumir qualquer entrada:

source: ``&e``: a positive lookahead (that is, ``e`` is required to match)
pt_pt: ``&e``: um lookahead positivo (ou seja, é obrigatório que ``e`` corresponda)

source: ``!e``: a negative lookahead (that is, ``e`` is required *not* to match)
pt_pt: ``!e``: um lookahead negativo (ou seja, é obrigatório que ``e`` *não* corresponda)

source: The unary operators (``*``, ``+``, ``?``) bind as tightly as possible; the vertical bar (``|``) binds most loosely.
pt_pt: Os operadores unários (``*``, ``+``, ``?``) ligam-se com a maior prioridade possível; a barra vertical (``|``) liga-se com a menor prioridade.

source: White space is only meaningful to separate tokens.
pt_pt: O espaço em branco apenas tem significado para separar tokens.

source: Rules are normally contained on a single line, but rules that are too long may be wrapped:
pt_pt: As regras estão normalmente contidas numa única linha, mas as regras que são demasiado longas podem ser divididas:

source: Alternatively, rules may be formatted with the first line ending at the colon, and each alternative beginning with a vertical bar on a new line. For example:
pt_pt: Alternativamente, as regras podem ser formatadas com a primeira linha a terminar nos dois pontos, e cada alternativa a começar com uma barra vertical numa nova linha. Por exemplo:

source: This does *not* mean that there is an empty first alternative.
pt_pt: Isto *não* significa que exista uma primeira alternativa vazia.

source: Lexical and Syntactic definitions
pt_pt: Definições Lexicais e Sintáticas

source: There is some difference between *lexical* and *syntactic* analysis: the :term:`lexical analyzer` operates on the individual characters of the input source, while the *parser* (syntactic analyzer) operates on the stream of :term:`tokens <token>` generated by the lexical analysis. However, in some cases the exact boundary between the two phases is a CPython implementation detail.
pt_pt: Existe alguma diferença entre a análise *lexical* e a *sintática*: o :term:`analisador lexical` opera sobre os caracteres individuais da fonte de entrada, enquanto o *parser* (analisador sintático) opera sobre o fluxo de :term:`tokens <token>` gerados pela análise lexical. No entanto, em alguns casos, a fronteira exata entre as duas fases é um detalhe de implementação do CPython.

source: The practical difference between the two is that in *lexical* definitions, all whitespace is significant. The lexical analyzer :ref:`discards <whitespace>` all whitespace that is not converted to tokens like :data:`token.INDENT` or :data:`~token.NEWLINE`. *Syntactic* definitions then use these tokens, rather than source characters.
pt_pt: A diferença prática entre as duas é que, nas definições *lexicais*, todo o espaço em branco é significativo. O analisador lexical :ref:`descarta <whitespace>` todo o espaço em branco que não é convertido em tokens como :data:`token.INDENT` ou :data:`~token.NEWLINE`. As definições *sintáticas* usam então estes tokens, em vez dos caracteres da fonte.

source: This documentation uses the same BNF grammar for both styles of definitions. All uses of BNF in the next chapter (:ref:`lexical`) are lexical definitions; uses in subsequent chapters are syntactic definitions.
pt_pt: Esta documentação utiliza a mesma gramática BNF para ambos os estilos de definição. Todos os usos de BNF no próximo capítulo (:ref:`lexical`) são definições lexicais; os usos nos capítulos subsequentes são definições sintáticas.

source: grammar
pt_pt: gramática

source: syntax
pt_pt: sintaxe

source: notation
pt_pt: notação

source: lexical definitions
pt_pt: definições lexicais
