Repository: NyaPuma/python-docs-pt
Catalog: reference/simple_stmts.po
Languages: pt_pt

source: The future statement is intended to ease migration to future versions of Python that introduce incompatible changes to the language. It allows use of the new features on a per-module basis before the release in which the feature becomes standard.
pt_pt: A instrução *future* destina-se a facilitar a migração para versões futuras do Python que introduzem alterações incompatíveis na linguagem. Permite a utilização das novas funcionalidades por módulo antes da versão em que a funcionalidade se torna padrão.

source: A future statement must appear near the top of the module. The only lines that can appear before a future statement are:
pt_pt: Uma instrução *future* deve aparecer perto do topo do módulo. As únicas linhas que podem aparecer antes de uma instrução *future* são:

source: the module docstring (if any),
pt_pt: a *docstring* do módulo (se existir),

source: comments,
pt_pt: comentários,

source: blank lines, and
pt_pt: linhas em branco, e

source: other future statements.
pt_pt: outras instruções *future*.

source: The only feature that requires using the future statement is ``annotations`` (see :pep:`563`).
pt_pt: A única funcionalidade que requer o uso da instrução *future* é ``annotations`` (consulte :pep:`563`).

source: All historical features enabled by the future statement are still recognized by Python 3. The list includes ``absolute_import``, ``division``, ``generators``, ``generator_stop``, ``unicode_literals``, ``print_function``, ``nested_scopes`` and ``with_statement``. They are all redundant because they are always enabled, and only kept for backwards compatibility.
pt_pt: Todas as funcionalidades históricas ativadas pela instrução *future* ainda são reconhecidas pelo Python 3. A lista inclui ``absolute_import``, ``division``, ``generators``, ``generator_stop``, ``unicode_literals``, ``print_function``, ``nested_scopes`` e ``with_statement``. Todas são redundantes porque estão sempre ativadas e são mantidas apenas para compatibilidade retroativa.

source: A future statement is recognized and treated specially at compile time: Changes to the semantics of core constructs are often implemented by generating different code. It may even be the case that a new feature introduces new incompatible syntax (such as a new reserved word), in which case the compiler may need to parse the module differently. Such decisions cannot be pushed off until runtime.
pt_pt: Uma instrução *future* é reconhecida e tratada de forma especial em tempo de compilação: Alterações à semântica de construções principais são frequentemente implementadas gerando código diferente. Pode até acontecer que uma nova funcionalidade introduza uma nova sintaxe incompatível (como uma nova palavra reservada), caso em que o compilador pode precisar de analisar o módulo de forma diferente. Tais decisões não podem ser adiadas até ao tempo de execução.

source: For any given release, the compiler knows which feature names have been defined, and raises a compile-time error if a future statement contains a feature not known to it.
pt_pt: Para qualquer versão específica, o compilador sabe quais os nomes de funcionalidades que foram definidos e levanta um erro em tempo de compilação se uma instrução *future* contiver uma funcionalidade desconhecida.

source: The direct runtime semantics are the same as for any import statement: there is a standard module :mod:`__future__`, described later, and it will be imported in the usual way at the time the future statement is executed.
pt_pt: A semântica direta em tempo de execução é a mesma que para qualquer instrução de importação: existe um módulo padrão :mod:`__future__`, descrito mais adiante, e será importado da forma habitual no momento em que a instrução *future* é executada.

source: The interesting runtime semantics depend on the specific feature enabled by the future statement.
pt_pt: A semântica interessante em tempo de execução depende da funcionalidade específica ativada pela instrução *future*.

source: Note that there is nothing special about the statement::
pt_pt: Note que não há nada de especial na instrução::

source: import __future__ [as name]
pt_pt: import __future__ [como nome]

source: That is not a future statement; it's an ordinary import statement with no special semantics or syntax restrictions.
pt_pt: Isso não é uma instrução *future*; é uma instrução de importação comum, sem semântica ou restrições sintáticas especiais.

source: Code compiled by calls to the built-in functions :func:`exec` and :func:`compile` that occur in a module :mod:`!M` containing a future statement will, by default, use the new syntax or semantics associated with the future statement. This can be controlled by optional arguments to :func:`compile` --- see the documentation of that function for details.
pt_pt: O código compilado por chamadas às funções integradas :func:`exec` e :func:`compile` que ocorrem num módulo :mod:`!M` contendo uma instrução *future* usará, por predefinição, a nova sintaxe ou semântica associada à instrução *future*. Isto pode ser controlado por argumentos opcionais para :func:`compile` — consulte a documentação dessa função para mais detalhes.

source: A future statement typed at an interactive interpreter prompt will take effect for the rest of the interpreter session. If an interpreter is started with the :option:`-i` option, is passed a script name to execute, and the script includes a future statement, it will be in effect in the interactive session started after the script is executed.
pt_pt: Uma instrução *future* digitada num prompt interativo do interpretador entrará em vigor pelo resto da sessão do interpretador. Se um interpretador for iniciado com a opção :option:`-i`, receber um nome de *script* para executar e o *script* incluir uma instrução *future*, esta estará em vigor na sessão interativa iniciada após a execução do *script*.

source: :pep:`236` - Back to the __future__
pt_pt: :pep:`236` - De volta ao __future__

source: The original proposal for the __future__ mechanism.
pt_pt: A proposta original para o mecanismo __future__.

source: The :keyword:`!global` statement
pt_pt: A instrução :keyword:`!global`

source: The :keyword:`global` statement causes the listed identifiers to be interpreted as globals. It would be impossible to assign to a global variable without :keyword:`!global`, although free variables may refer to globals without being declared global.
pt_pt: A instrução :keyword:`global` faz com que os identificadores listados sejam interpretados como globais. Seria impossível atribuir a uma variável global sem :keyword:`!global`, embora variáveis livres possam referir-se a globais sem serem declaradas como globais.

source: The :keyword:`!global` statement applies to the entire current scope (module, function body or class definition). A :exc:`SyntaxError` is raised if a variable is used or assigned to prior to its global declaration in the scope.
pt_pt: A instrução :keyword:`!global` aplica-se a todo o âmbito atual (módulo, corpo de função ou definição de classe). Uma exceção :exc:`SyntaxError` é levantada se uma variável for usada ou atribuída antes da sua declaração global no âmbito.

source: At the module level, all variables are global, so a :keyword:`!global` statement has no effect. However, variables must still not be used or assigned to prior to their :keyword:`!global` declaration. This requirement is relaxed in the interactive prompt (:term:`REPL`).
pt_pt: Ao nível do módulo, todas as variáveis são globais, por isso uma instrução :keyword:`!global` não tem efeito. No entanto, as variáveis ainda não devem ser usadas ou atribuídas antes da sua declaração :keyword:`!global`. Este requisito é relaxado no prompt interativo (:term:`REPL`).

source: **Programmer's note:** :keyword:`global` is a directive to the parser. It applies only to code parsed at the same time as the :keyword:`!global` statement. In particular, a :keyword:`!global` statement contained in a string or code object supplied to the built-in :func:`exec` function does not affect the code block *containing* the function call, and code contained in such a string is unaffected by :keyword:`!global` statements in the code containing the function call. The same applies to the :func:`eval` and :func:`compile` functions.
pt_pt: **Nota para programadores:** :keyword:`global` é uma diretiva para o *parser*. Aplica-se apenas ao código analisado ao mesmo tempo que a instrução :keyword:`!global`. Em particular, uma instrução :keyword:`!global` contida numa *string* ou objeto de código fornecido à função integrada :func:`exec` não afeta o bloco de código que *contém* a chamada da função, e o código contido numa tal *string* não é afetado por instruções :keyword:`!global` no código que contém a chamada da função. O mesmo se aplica às funções :func:`eval` e :func:`compile`.

source: The :keyword:`!nonlocal` statement
pt_pt: A instrução :keyword:`!nonlocal`

source: When the definition of a function or class is nested (enclosed) within the definitions of other functions, its nonlocal scopes are the local scopes of the enclosing functions. The :keyword:`nonlocal` statement causes the listed identifiers to refer to names previously bound in nonlocal scopes. It allows encapsulated code to rebind such nonlocal identifiers. If a name is bound in more than one nonlocal scope, the nearest binding is used. If a name is not bound in any nonlocal scope, or if there is no nonlocal scope, a :exc:`SyntaxError` is raised.
pt_pt: Quando a definição de uma função ou classe está aninhada (encerrada) dentro das definições de outras funções, os seus âmbitos não locais são os âmbitos locais das funções envolventes. A instrução :keyword:`nonlocal` faz com que os identificadores listados se refiram a nomes previamente ligados em âmbitos não locais. Permite que o código encapsulado religue tais identificadores não locais. Se um nome estiver ligado em mais do que um âmbito não local, é usada a ligação mais próxima. Se um nome não estiver ligado em nenhum âmbito não local, ou se não existir nenhum âmbito não local, é levantada uma exceção :exc:`SyntaxError`.

source: The :keyword:`nonlocal` statement applies to the entire scope of a function or class body. A :exc:`SyntaxError` is raised if a variable is used or assigned to prior to its nonlocal declaration in the scope.
pt_pt: A instrução :keyword:`nonlocal` aplica-se a todo o âmbito de um corpo de função ou classe. Uma exceção :exc:`SyntaxError` é levantada se uma variável for usada ou atribuída antes da sua declaração *nonlocal* no âmbito.

source: :pep:`3104` - Access to Names in Outer Scopes
pt_pt: :pep:`3104` - Acesso a Nomes em Âmbitos Externos

source: The specification for the :keyword:`nonlocal` statement.
pt_pt: A especificação para a instrução :keyword:`nonlocal`.

source: **Programmer's note:** :keyword:`nonlocal` is a directive to the parser and applies only to code parsed along with it. See the note for the :keyword:`global` statement.
pt_pt: **Nota para programadores:** :keyword:`nonlocal` é uma diretiva para o *parser* e aplica-se apenas ao código analisado juntamente com ela. Consulte a nota para a instrução :keyword:`global`.

source: The :keyword:`!type` statement
pt_pt: A instrução :keyword:`!type`

source: The :keyword:`!type` statement declares a type alias, which is an instance of :class:`typing.TypeAliasType`.
pt_pt: A instrução :keyword:`!type` declara um alias de tipo, que é uma instância de :class:`typing.TypeAliasType`.

source: For example, the following statement creates a type alias::
pt_pt: Por exemplo, a seguinte instrução cria um *alias* de tipo::

source: This code is roughly equivalent to::
pt_pt: Este código é aproximadamente equivalente a::

source: ``annotation-def`` indicates an :ref:`annotation scope <annotation-scopes>`, which behaves mostly like a function, but with several small differences.
pt_pt: ``annotation-def`` indica um :ref:`âmbitos de anotação <annotation-scopes>`, que se comporta maioritariamente como uma função, mas com algumas pequenas diferenças.

source: The value of the type alias is evaluated in the annotation scope. It is not evaluated when the type alias is created, but only when the value is accessed through the type alias's :attr:`!__value__` attribute (see :ref:`lazy-evaluation`). This allows the type alias to refer to names that are not yet defined.
pt_pt: O valor do *alias* de tipo é avaliado no âmbito de anotação. Não é avaliado quando o *alias* de tipo é criado, mas apenas quando o valor é acedido através do atributo :attr:`!__value__` do *alias* de tipo (consulte :ref:`lazy-evaluation`). Isto permite que o *alias* de tipo se refira a nomes que ainda não estão definidos.

source: Type aliases may be made generic by adding a :ref:`type parameter list <type-params>` after the name. See :ref:`generic-type-aliases` for more.
pt_pt: Os *aliases* de tipo podem ser tornados genéricos adicionando uma :ref:`lista de parâmetros de tipo <type-params>` após o nome. Consulte :ref:`generic-type-aliases` para mais informações.

source: :keyword:`!type` is a :ref:`soft keyword <soft-keywords>`.
pt_pt: :keyword:`!type` é uma :ref:`palavra-chave flexível <soft-keywords>`.

source: :pep:`695` - Type Parameter Syntax
pt_pt: :pep:`695` - Sintaxe de Parâmetros de Tipo

source: Introduced the :keyword:`!type` statement and syntax for generic classes and functions.
pt_pt: Introduziu a instrução :keyword:`!type` e a sintaxe para classes e funções genéricas.

source: simple
pt_pt: simples

source: statement
pt_pt: instrução

source: expression
pt_pt: expressão

source: list
pt_pt: lista

source: built-in function
pt_pt: função integrada

source: object
pt_pt: objeto

source: conversion
pt_pt: conversão

source: output
pt_pt: saída

source: standard
pt_pt: padrão

source: writing
pt_pt: escrita

source: values
pt_pt: valores

source: procedure
pt_pt: procedimento

source: call
pt_pt: chamada

source: = (equals)
pt_pt: = (igual)

source: assignment statement
pt_pt: instrução de atribuição

source: assignment
pt_pt: atribuição

source: binding
pt_pt: ligação

source: name
pt_pt: nome

source: rebinding
pt_pt: religação

source: mutable
pt_pt: mutável

source: attribute
pt_pt: atributo

source: target
pt_pt: alvo

source: , (comma)
pt_pt: , (vírgula)

source: in target list
pt_pt: na lista de alvos

source: * (asterisk)
pt_pt: * (asterisco)

source: in assignment target list
pt_pt: na lista de alvos de atribuição

source: [] (square brackets)
pt_pt: [] (parênteses retos)

source: () (parentheses)
pt_pt: () (parênteses)

source: destructor
pt_pt: destrutor

source: subscription
pt_pt: subscrição

source: sequence
pt_pt: sequência

source: mapping
pt_pt: mapeamento

source: dictionary
pt_pt: dicionário

source: slicing
pt_pt: fatiamento

source: augmented
pt_pt: aumentada

source: assignment, augmented
pt_pt: atribuição aumentada

source: augmented assignment
pt_pt: atribuição aumentada

source: annotated
pt_pt: anotada

source: assignment, annotated
pt_pt: atribuição anotada

source: : (colon)
pt_pt: : (dois pontos)

source: annotated variable
pt_pt: variável anotada

source: debugging
pt_pt: depuração

source: assertions
pt_pt: afirmações

source: expression list
pt_pt: lista de expressões

source: exception
pt_pt: exceção

source: null
pt_pt: nula

source: operation
pt_pt: operação

source: deletion
pt_pt: eliminação

source: unbinding
pt_pt: desligação

source: function
pt_pt: função

source: definition
pt_pt: definição

source: class
pt_pt: classe

source: keyword
pt_pt: palavra-chave

source: generator
pt_pt: gerador

source: iterator
pt_pt: iterador

source: raising
pt_pt: levantamento

source: __traceback__ (exception attribute)
pt_pt: __traceback__ (atributo de exceção)

source: chaining
pt_pt: encadeamento

source: __cause__ (exception attribute)
pt_pt: __cause__ (atributo de exceção)

source: __context__ (exception attribute)
pt_pt: __context__ (atributo de exceção)

source: loop
pt_pt: ciclo

source: loop control
pt_pt: controlo de ciclo

source: module
pt_pt: módulo

source: importing
pt_pt: importação

source: import statement
pt_pt: instrução de importação

source: __all__ (optional module attribute)
pt_pt: __all__ (atributo opcional de módulo)

source: relative
pt_pt: relativa

source: future statement
pt_pt: instrução *future*

source: identifier list
pt_pt: lista de identificadores

source: type
pt_pt: tipo
