Repository: NyaPuma/python-docs-pt
Catalog: reference/simple_stmts.po
Languages: pt_pt

source: Deletion of a name removes the binding of that name from the local or global namespace, depending on whether the name occurs in a :keyword:`global` statement in the same code block. Trying to delete an unbound name raises a :exc:`NameError` exception.
pt_pt: A eliminação de um nome remove a ligação desse nome do *namespace* local ou global, dependendo se o nome ocorre numa instrução :keyword:`global` no mesmo bloco de código. Tentar eliminar um nome não ligado levanta uma exceção :exc:`NameError`.

source: Previously it was illegal to delete a name from the local namespace if it occurs as a free variable in a nested block.
pt_pt: Anteriormente, era ilegal eliminar um nome do *namespace* local se ele ocorresse como uma variável livre num bloco aninhado.

source: The :keyword:`!return` statement
pt_pt: A instrução :keyword:`!return`

source: :keyword:`return` may only occur syntactically nested in a function definition, not within a nested class definition.
pt_pt: :keyword:`return` só pode ocorrer sintaticamente aninhado numa definição de função, não dentro de uma definição de classe aninhada.

source: If an expression list is present, it is evaluated, else ``None`` is substituted.
pt_pt: Se uma lista de expressões estiver presente, é avaliada; caso contrário, ``None`` é substituído.

source: :keyword:`return` leaves the current function call with the expression list (or ``None``) as return value.
pt_pt: :keyword:`return` sai da chamada de função atual com a lista de expressões (ou ``None``) como valor de retorno.

source: When :keyword:`return` passes control out of a :keyword:`try` statement with a :keyword:`finally` clause, that :keyword:`!finally` clause is executed before really leaving the function.
pt_pt: Quando :keyword:`return` passa o controlo para fora de uma instrução :keyword:`try` com uma cláusula :keyword:`finally`, essa cláusula :keyword:`!finally` é executada antes de realmente sair da função.

source: In a generator function, the :keyword:`return` statement indicates that the generator is done and will cause :exc:`StopIteration` to be raised. The returned value (if any) is used as an argument to construct :exc:`StopIteration` and becomes the :attr:`StopIteration.value` attribute.
pt_pt: Numa função geradora, a instrução :keyword:`return` indica que o gerador terminou e fará com que :exc:`StopIteration` seja levantada. O valor retornado (se houver) é usado como argumento para construir :exc:`StopIteration` e torna-se o atributo :attr:`StopIteration.value`.

source: In an asynchronous generator function, an empty :keyword:`return` statement indicates that the asynchronous generator is done and will cause :exc:`StopAsyncIteration` to be raised. A non-empty :keyword:`!return` statement is a syntax error in an asynchronous generator function.
pt_pt: Numa função geradora assíncrona, uma instrução :keyword:`return` vazia indica que o gerador assíncrono terminou e fará com que :exc:`StopAsyncIteration` seja levantada. Uma instrução :keyword:`!return` não vazia é um erro de sintaxe numa função geradora assíncrona.

source: The :keyword:`!yield` statement
pt_pt: A instrução :keyword:`!yield`

source: A :keyword:`yield` statement is semantically equivalent to a :ref:`yield expression <yieldexpr>`. The ``yield`` statement can be used to omit the parentheses that would otherwise be required in the equivalent yield expression statement. For example, the yield statements ::
pt_pt: Uma instrução :keyword:`yield` é semanticamente equivalente a uma :ref:`expressão yield <yieldexpr>`. A instrução ``yield`` pode ser usada para omitir os parênteses que seriam necessários na instrução de expressão yield equivalente. Por exemplo, as instruções yield ::

source: are equivalent to the yield expression statements ::
pt_pt: são equivalentes às instruções de expressão yield ::

source: Yield expressions and statements are only used when defining a :term:`generator` function, and are only used in the body of the generator function. Using :keyword:`yield` in a function definition is sufficient to cause that definition to create a generator function instead of a normal function.
pt_pt: As expressões e instruções yield são usadas apenas ao definir uma função :term:`geradora` e são usadas apenas no corpo da função geradora. Usar :keyword:`yield` numa definição de função é suficiente para fazer com que essa definição crie uma função geradora em vez de uma função normal.

source: For full details of :keyword:`yield` semantics, refer to the :ref:`yieldexpr` section.
pt_pt: Para detalhes completos sobre a semântica de :keyword:`yield`, consulte a secção :ref:`yieldexpr`.

source: The :keyword:`!raise` statement
pt_pt: A instrução :keyword:`!raise`

source: If no expressions are present, :keyword:`raise` re-raises the exception that is currently being handled, which is also known as the *active exception*. If there isn't currently an active exception, a :exc:`RuntimeError` exception is raised indicating that this is an error.
pt_pt: Se não houver expressões presentes, :keyword:`raise` relança a exceção que está atualmente a ser tratada, também conhecida como a *exceção ativa*. Se não houver atualmente uma exceção ativa, é levantada uma exceção :exc:`RuntimeError` indicando que isto é um erro.

source: Otherwise, :keyword:`raise` evaluates the first expression as the exception object. It must be either a subclass or an instance of :class:`BaseException`. If it is a class, the exception instance will be obtained when needed by instantiating the class with no arguments.
pt_pt: Caso contrário, :keyword:`raise` avalia a primeira expressão como o objeto de exceção. Deve ser uma subclasse ou uma instância de :class:`BaseException`. Se for uma classe, a instância de exceção será obtida quando necessária, instanciando a classe sem argumentos.

source: The :dfn:`type` of the exception is the exception instance's class, the :dfn:`value` is the instance itself.
pt_pt: O :dfn:`tipo` da exceção é a classe da instância de exceção, o :dfn:`valor` é a instância em si.

source: A traceback object is normally created automatically when an exception is raised and attached to it as the :attr:`~BaseException.__traceback__` attribute. You can create an exception and set your own traceback in one step using the :meth:`~BaseException.with_traceback` exception method (which returns the same exception instance, with its traceback set to its argument), like so::
pt_pt: Um objeto de rastreio é normalmente criado automaticamente quando uma exceção é levantada e anexado a ela como o atributo :attr:`~BaseException.__traceback__`. Pode criar uma exceção e definir o seu próprio rastreio num único passo usando o método de exceção :meth:`~BaseException.with_traceback` (que retorna a mesma instância de exceção, com o seu rastreio definido para o seu argumento), como segue::

source: raise Exception("foo occurred").with_traceback(tracebackobj)
pt_pt: raise Exception("foo ocorreu").with_traceback(tracebackobj)

source: The ``from`` clause is used for exception chaining: if given, the second *expression* must be another exception class or instance. If the second expression is an exception instance, it will be attached to the raised exception as the :attr:`~BaseException.__cause__` attribute (which is writable). If the expression is an exception class, the class will be instantiated and the resulting exception instance will be attached to the raised exception as the :attr:`!__cause__` attribute. If the raised exception is not handled, both exceptions will be printed:
pt_pt: A cláusula ``from`` é usada para encadeamento de exceções: se fornecida, a segunda *expressão* deve ser outra classe ou instância de exceção. Se a segunda expressão for uma instância de exceção, será anexada à exceção levantada como o atributo :attr:`~BaseException.__cause__` (que é gravável). Se a expressão for uma classe de exceção, a classe será instanciada e a instância de exceção resultante será anexada à exceção levantada como o atributo :attr:`!__cause__`. Se a exceção levantada não for tratada, ambas as exceções serão impressas:

source: >>> try: ... print(1 / 0) ... except Exception as exc: ... raise RuntimeError("Something bad happened") from exc ... Traceback (most recent call last): File "<stdin>", line 2, in <module> print(1 / 0) ~~^~~ ZeroDivisionError: division by zero The above exception was the direct cause of the following exception: Traceback (most recent call last): File "<stdin>", line 4, in <module> raise RuntimeError("Something bad happened") from exc RuntimeError: Something bad happened
pt_pt: >>> try: ... print(1 / 0) ... except Exception as exc: ... raise RuntimeError("Algo correu mal") from exc ... Traceback (most recent call last): File "<stdin>", line 2, in <module> print(1 / 0) ~~^~~ ZeroDivisionError: divisão por zero The above exception was the direct cause of the following exception: Traceback (most recent call last): File "<stdin>", line 4, in <module> raise RuntimeError("Algo correu mal") from exc RuntimeError: Algo correu mal

source: A similar mechanism works implicitly if a new exception is raised when an exception is already being handled. An exception may be handled when an :keyword:`except` or :keyword:`finally` clause, or a :keyword:`with` statement, is used. The previous exception is then attached as the new exception's :attr:`~BaseException.__context__` attribute:
pt_pt: Um mecanismo semelhante funciona implicitamente se uma nova exceção for levantada quando uma exceção já está a ser tratada. Uma exceção pode ser tratada quando uma cláusula :keyword:`except` ou :keyword:`finally`, ou uma instrução :keyword:`with`, é usada. A exceção anterior é então anexada como o atributo :attr:`~BaseException.__context__` da nova exceção:

source: >>> try: ... print(1 / 0) ... except: ... raise RuntimeError("Something bad happened") ... Traceback (most recent call last): File "<stdin>", line 2, in <module> print(1 / 0) ~~^~~ ZeroDivisionError: division by zero During handling of the above exception, another exception occurred: Traceback (most recent call last): File "<stdin>", line 4, in <module> raise RuntimeError("Something bad happened") RuntimeError: Something bad happened
pt_pt: >>> try: ... print(1 / 0) ... except: ... raise RuntimeError("Algo correu mal") ... Traceback (most recent call last): File "<stdin>", line 2, in <module> print(1 / 0) ~~^~~ ZeroDivisionError: divisão por zero During handling of the above exception, another exception occurred: Traceback (most recent call last): File "<stdin>", line 4, in <module> raise RuntimeError("Algo correu mal") RuntimeError: Algo correu mal

source: Exception chaining can be explicitly suppressed by specifying :const:`None` in the ``from`` clause:
pt_pt: O encadeamento de exceções pode ser explicitamente suprimido especificando :const:`None` na cláusula ``from``:

source: >>> try: ... print(1 / 0) ... except: ... raise RuntimeError("Something bad happened") from None ... Traceback (most recent call last): File "<stdin>", line 4, in <module> RuntimeError: Something bad happened
pt_pt: >>> try: ... print(1 / 0) ... except: ... raise RuntimeError("Algo correu mal") from None ... Traceback (most recent call last): File "<stdin>", line 4, in <module> RuntimeError: Algo correu mal

source: Additional information on exceptions can be found in section :ref:`exceptions`, and information about handling exceptions is in section :ref:`try`.
pt_pt: Informações adicionais sobre exceções podem ser encontradas na secção :ref:`exceptions`, e informações sobre o tratamento de exceções estão na secção :ref:`try`.

source: :const:`None` is now permitted as ``Y`` in ``raise X from Y``.
pt_pt: :const:`None` é agora permitido como ``Y`` em ``raise X from Y``.

source: Added the :attr:`~BaseException.__suppress_context__` attribute to suppress automatic display of the exception context.
pt_pt: Adicionado o atributo :attr:`~BaseException.__suppress_context__` para suprimir a exibição automática do contexto da exceção.

source: If the traceback of the active exception is modified in an :keyword:`except` clause, a subsequent ``raise`` statement re-raises the exception with the modified traceback. Previously, the exception was re-raised with the traceback it had when it was caught.
pt_pt: Se o rastreio da exceção ativa for modificado numa cláusula :keyword:`except`, uma instrução ``raise`` subsequente relança a exceção com o rastreio modificado. Anteriormente, a exceção era relançada com o rastreio que tinha quando foi capturada.

source: The :keyword:`!break` statement
pt_pt: A instrução :keyword:`!break`

source: :keyword:`break` may only occur syntactically nested in a :keyword:`for` or :keyword:`while` loop, but not nested in a function or class definition within that loop.
pt_pt: :keyword:`break` só pode ocorrer sintaticamente aninhado num ciclo :keyword:`for` ou :keyword:`while`, mas não aninhado numa definição de função ou classe dentro desse ciclo.

source: It terminates the nearest enclosing loop, skipping the optional :keyword:`!else` clause if the loop has one.
pt_pt: Termina o ciclo envolvente mais próximo, ignorando a cláusula :keyword:`!else` opcional, se o ciclo tiver uma.

source: If a :keyword:`for` loop is terminated by :keyword:`break`, the loop control target keeps its current value.
pt_pt: Se um ciclo :keyword:`for` for terminado por :keyword:`break`, o alvo de controlo do ciclo mantém o seu valor atual.

source: When :keyword:`break` passes control out of a :keyword:`try` statement with a :keyword:`finally` clause, that :keyword:`!finally` clause is executed before really leaving the loop.
pt_pt: Quando :keyword:`break` passa o controlo para fora de uma instrução :keyword:`try` com uma cláusula :keyword:`finally`, essa cláusula :keyword:`!finally` é executada antes de realmente sair do ciclo.

source: The :keyword:`!continue` statement
pt_pt: A instrução :keyword:`!continue`

source: :keyword:`continue` may only occur syntactically nested in a :keyword:`for` or :keyword:`while` loop, but not nested in a function or class definition within that loop. It continues with the next cycle of the nearest enclosing loop.
pt_pt: :keyword:`continue` só pode ocorrer sintaticamente aninhado num ciclo :keyword:`for` ou :keyword:`while`, mas não aninhado numa definição de função ou classe dentro desse ciclo. Continua com o próximo ciclo do ciclo envolvente mais próximo.

source: When :keyword:`continue` passes control out of a :keyword:`try` statement with a :keyword:`finally` clause, that :keyword:`!finally` clause is executed before really starting the next loop cycle.
pt_pt: Quando :keyword:`continue` passa o controlo para fora de uma instrução :keyword:`try` com uma cláusula :keyword:`finally`, essa cláusula :keyword:`!finally` é executada antes de realmente iniciar o próximo ciclo do ciclo.

source: The :keyword:`!import` statement
pt_pt: A instrução :keyword:`!import`

source: The basic import statement (no :keyword:`from` clause) is executed in two steps:
pt_pt: A instrução de importação básica (sem cláusula :keyword:`from`) é executada em dois passos:

source: find a module, loading and initializing it if necessary
pt_pt: encontrar um módulo, carregando e inicializando-o se necessário

source: define a name or names in the local namespace for the scope where the :keyword:`import` statement occurs.
pt_pt: definir um nome ou nomes no *namespace* local para o âmbito onde a instrução :keyword:`import` ocorre.

source: When the statement contains multiple clauses (separated by commas) the two steps are carried out separately for each clause, just as though the clauses had been separated out into individual import statements.
pt_pt: Quando a instrução contém múltiplas cláusulas (separadas por vírgulas), os dois passos são executados separadamente para cada cláusula, como se as cláusulas tivessem sido separadas em instruções de importação individuais.

source: The details of the first step, finding and loading modules, are described in greater detail in the section on the :ref:`import system <importsystem>`, which also describes the various types of packages and modules that can be imported, as well as all the hooks that can be used to customize the import system. Note that failures in this step may indicate either that the module could not be located, *or* that an error occurred while initializing the module, which includes execution of the module's code.
pt_pt: Os detalhes do primeiro passo, encontrar e carregar módulos, são descritos com maior detalhe na secção sobre o :ref:`sistema de importação <importsystem>`, que também descreve os vários tipos de pacotes e módulos que podem ser importados, bem como todos os *hooks* que podem ser usados para personalizar o sistema de importação. Note que falhas neste passo podem indicar que o módulo não foi localizado, *ou* que ocorreu um erro durante a inicialização do módulo, o que inclui a execução do código do módulo.

source: If the requested module is retrieved successfully, it will be made available in the local namespace in one of three ways:
pt_pt: Se o módulo solicitado for recuperado com sucesso, será disponibilizado no *namespace* local de uma das três formas:

source: If the module name is followed by :keyword:`!as`, then the name following :keyword:`!as` is bound directly to the imported module.
pt_pt: Se o nome do módulo for seguido por :keyword:`!as`, então o nome que segue :keyword:`!as` é ligado diretamente ao módulo importado.

source: If no other name is specified, and the module being imported is a top level module, the module's name is bound in the local namespace as a reference to the imported module
pt_pt: Se nenhum outro nome for especificado e o módulo a ser importado for um módulo de nível superior, o nome do módulo é ligado no *namespace* local como uma referência ao módulo importado.

source: If the module being imported is *not* a top level module, then the name of the top level package that contains the module is bound in the local namespace as a reference to the top level package. The imported module must be accessed using its full qualified name rather than directly
pt_pt: Se o módulo a ser importado *não* for um módulo de nível superior, então o nome do pacote de nível superior que contém o módulo é ligado no *namespace* local como uma referência ao pacote de nível superior. O módulo importado deve ser acedido usando o seu nome qualificado completo em vez de diretamente.

source: The :keyword:`from` form uses a slightly more complex process:
pt_pt: A forma :keyword:`from` usa um processo ligeiramente mais complexo:

source: find the module specified in the :keyword:`from` clause, loading and initializing it if necessary;
pt_pt: encontrar o módulo especificado na cláusula :keyword:`from`, carregando e inicializando-o se necessário;

source: for each of the identifiers specified in the :keyword:`import` clauses:
pt_pt: para cada um dos identificadores especificados nas cláusulas :keyword:`import`:

source: check if the imported module has an attribute by that name
pt_pt: verificar se o módulo importado tem um atributo com esse nome

source: if not, attempt to import a submodule with that name and then check the imported module again for that attribute
pt_pt: se não, tentar importar um submódulo com esse nome e depois verificar novamente o módulo importado quanto a esse atributo

source: if the attribute is not found, :exc:`ImportError` is raised.
pt_pt: se o atributo não for encontrado, é levantada uma exceção :exc:`ImportError`.

source: otherwise, a reference to that value is stored in the local namespace, using the name in the :keyword:`!as` clause if it is present, otherwise using the attribute name
pt_pt: caso contrário, uma referência a esse valor é armazenada no *namespace* local, usando o nome na cláusula :keyword:`!as` se estiver presente, caso contrário usando o nome do atributo

source: Examples::
pt_pt: Exemplos::

source: If the list of identifiers is replaced by a star (``'*'``), all public names defined in the module are bound in the local namespace for the scope where the :keyword:`import` statement occurs.
pt_pt: Se a lista de identificadores for substituída por um asterisco (``'*'``), todos os nomes públicos definidos no módulo são ligados no *namespace* local para o âmbito onde a instrução :keyword:`import` ocorre.

source: The wild card form of import --- ``from module import *`` --- is only allowed at the module level. Attempting to use it in class or function definitions will raise a :exc:`SyntaxError`.
pt_pt: A forma de importação com curinga --- ``from module import *`` --- só é permitida ao nível do módulo. Tentar usá-la em definições de classe ou função levantará uma exceção :exc:`SyntaxError`.

source: When specifying what module to import you do not have to specify the absolute name of the module. When a module or package is contained within another package it is possible to make a relative import within the same top package without having to mention the package name. By using leading dots in the specified module or package after :keyword:`from` you can specify how high to traverse up the current package hierarchy without specifying exact names. One leading dot means the current package where the module making the import exists. Two dots means up one package level. Three dots is up two levels, etc. So if you execute ``from . import mod`` from a module in the ``pkg`` package then you will end up importing ``pkg.mod``. If you execute ``from ..subpkg2 import mod`` from within ``pkg.subpkg1`` you will import ``pkg.subpkg2.mod``. The specification for relative imports is contained in the :ref:`relativeimports` section.
pt_pt: Ao especificar qual módulo importar, não é necessário especificar o nome absoluto do módulo. Quando um módulo ou pacote está contido dentro de outro pacote, é possível fazer uma importação relativa dentro do mesmo pacote de nível superior sem ter de mencionar o nome do pacote. Usando pontos iniciais no módulo ou pacote especificado após :keyword:`from`, pode especificar até que nível subir na hierarquia do pacote atual sem especificar nomes exatos. Um ponto inicial significa o pacote atual onde o módulo que faz a importação existe. Dois pontos significam subir um nível de pacote. Três pontos significam subir dois níveis, etc. Assim, se executar ``from . import mod`` a partir de um módulo no pacote ``pkg``, acabará por importar ``pkg.mod``. Se executar ``from ..subpkg2 import mod`` a partir de ``pkg.subpkg1``, importará ``pkg.subpkg2.mod``. A especificação para importações relativas está contida na secção :ref:`relativeimports`.

source: :func:`importlib.import_module` is provided to support applications that determine dynamically the modules to be loaded.
pt_pt: :func:`importlib.import_module` é fornecido para apoiar aplicações que determinam dinamicamente os módulos a serem carregados.

source: Raises an :ref:`auditing event <auditing>` ``import`` with arguments ``module``, ``filename``, ``sys.path``, ``sys.meta_path``, ``sys.path_hooks``.
pt_pt: Levanta um :ref:`evento de auditoria <auditing>` ``import`` com os argumentos ``module``, ``filename``, ``sys.path``, ``sys.meta_path``, ``sys.path_hooks``.

source: Future statements
pt_pt: Instruções *future*

source: A :dfn:`future statement` is a directive to the compiler that a particular module should be compiled using syntax or semantics that will be available in a specified future release of Python where the feature becomes standard.
pt_pt: Uma :dfn:`instrução *future*` é uma diretiva para o compilador de que um módulo específico deve ser compilado usando sintaxe ou semântica que estarão disponíveis numa versão futura especificada do Python, onde a funcionalidade se torna padrão.
