Repository: NyaPuma/python-docs-pt
Catalog: reference/simple_stmts.po
Languages: pt_pt

source: Simple statements
pt_pt: Instruções simples

source: A simple statement is comprised within a single logical line. Several simple statements may occur on a single line separated by semicolons. The syntax for simple statements is:
pt_pt: Uma instrução simples está contida numa única linha lógica. Várias instruções simples podem ocorrer numa única linha, separadas por ponto e vírgula. A sintaxe para instruções simples é:

source: Expression statements
pt_pt: Instruções de expressão

source: Expression statements are used (mostly interactively) to compute and write a value, or (usually) to call a procedure (a function that returns no meaningful result; in Python, procedures return the value ``None``). Other uses of expression statements are allowed and occasionally useful. The syntax for an expression statement is:
pt_pt: As instruções de expressão são usadas (principalmente de forma interativa) para calcular e escrever um valor, ou (geralmente) para chamar um procedimento (uma função que não retorna um resultado significativo; em Python, os procedimentos retornam o valor ``None``). Outros usos de instruções de expressão são permitidos e ocasionalmente úteis. A sintaxe para uma instrução de expressão é:

source: An expression statement evaluates the expression list (which may be a single expression).
pt_pt: Uma instrução de expressão avalia a lista de expressões (que pode ser uma única expressão).

source: In interactive mode, if the value is not ``None``, it is converted to a string using the built-in :func:`repr` function and the resulting string is written to standard output on a line by itself (except if the result is ``None``, so that procedure calls do not cause any output.)
pt_pt: Em modo interativo, se o valor não for ``None``, é convertido para uma *string* usando a função integrada :func:`repr` e a *string* resultante é escrita na saída padrão, numa linha própria (exceto se o resultado for ``None``, de modo que chamadas de procedimento não causem qualquer saída).

source: Assignment statements
pt_pt: Instruções de atribuição

source: Assignment statements are used to (re)bind names to values and to modify attributes or items of mutable objects:
pt_pt: As instruções de atribuição são usadas para (re)ligar nomes a valores e para modificar atributos ou itens de objetos mutáveis:

source: An assignment statement evaluates the expression list (remember that this can be a single expression or a comma-separated list, the latter yielding a tuple) and assigns the single resulting object to each of the target lists, from left to right.
pt_pt: Uma instrução de atribuição avalia a lista de expressões (lembre-se que isto pode ser uma única expressão ou uma lista separada por vírgulas, sendo que esta última produz um *tuple*) e atribui o objeto resultante único a cada uma das listas de destino, da esquerda para a direita.

source: Assignment of an object to a target list, optionally enclosed in parentheses or square brackets, is recursively defined as follows.
pt_pt: A atribuição de um objeto a uma lista de destinos, opcionalmente encerrada entre parênteses ou colchetes, é definida recursivamente da seguinte forma.

source: If the target list is a single target with no trailing comma, optionally in parentheses, the object is assigned to that target.
pt_pt: Se a lista de destinos for um único destino sem vírgula final, opcionalmente entre parênteses, o objeto é atribuído a esse destino.

source: Else:
pt_pt: Caso contrário:

source: If the target list contains one target prefixed with an asterisk, called a "starred" target: The object must be an iterable with at least as many items as there are targets in the target list, minus one. The first items of the iterable are assigned, from left to right, to the targets before the starred target. The final items of the iterable are assigned to the targets after the starred target. A list of the remaining items in the iterable is then assigned to the starred target (the list can be empty).
pt_pt: Se a lista de destinos contiver um destino prefixado com um asterisco, chamado de destino "estrela": O objeto deve ser um iterável com pelo menos tantos itens quantos os destinos na lista de destinos, menos um. Os primeiros itens do iterável são atribuídos, da esquerda para a direita, aos destinos antes do destino "estrela". Os itens finais do iterável são atribuídos aos destinos após o destino "estrela". Uma lista dos itens restantes no iterável é então atribuída ao destino "estrela" (a lista pode estar vazia).

source: Else: The object must be an iterable with the same number of items as there are targets in the target list, and the items are assigned, from left to right, to the corresponding targets.
pt_pt: Caso contrário: O objeto deve ser um iterável com o mesmo número de itens que os destinos na lista de destinos, e os itens são atribuídos, da esquerda para a direita, aos destinos correspondentes.

source: Assignment of an object to a single target is recursively defined as follows.
pt_pt: A atribuição de um objeto a um único destino é definida recursivamente da seguinte forma.

source: If the target is an identifier (name):
pt_pt: Se o destino for um identificador (nome):

source: If the name does not occur in a :keyword:`global` or :keyword:`nonlocal` statement in the current code block: the name is bound to the object in the current local namespace.
pt_pt: Se o nome não ocorrer numa instrução :keyword:`global` ou :keyword:`nonlocal` no bloco de código atual: o nome é ligado ao objeto no *namespace* local atual.

source: Otherwise: the name is bound to the object in the global namespace or the outer namespace determined by :keyword:`nonlocal`, respectively.
pt_pt: Caso contrário: o nome é ligado ao objeto no *namespace* global ou no *namespace* externo determinado por :keyword:`nonlocal`, respetivamente.

source: The name is rebound if it was already bound. This may cause the reference count for the object previously bound to the name to reach zero, causing the object to be deallocated and its destructor (if it has one) to be called.
pt_pt: O nome é religado se já estiver ligado. Isto pode fazer com que a contagem de referências para o objeto anteriormente ligado ao nome atinja zero, causando a desalocação do objeto e a chamada do seu destrutor (se tiver um).

source: If the target is an attribute reference: The primary expression in the reference is evaluated. It should yield an object with assignable attributes; if this is not the case, :exc:`TypeError` is raised. That object is then asked to assign the assigned object to the given attribute; if it cannot perform the assignment, it raises an exception (usually but not necessarily :exc:`AttributeError`).
pt_pt: Se o destino for uma referência de atributo: A expressão primária na referência é avaliada. Deve produzir um objeto com atributos atribuíveis; se não for o caso, é levantada uma exceção :exc:`TypeError`. Esse objeto é então solicitado a atribuir o objeto atribuído ao atributo dado; se não puder realizar a atribuição, levanta uma exceção (geralmente, mas não necessariamente, :exc:`AttributeError`).

source: Note: If the object is a class instance and the attribute reference occurs on both sides of the assignment operator, the right-hand side expression, ``a.x`` can access either an instance attribute or (if no instance attribute exists) a class attribute. The left-hand side target ``a.x`` is always set as an instance attribute, creating it if necessary. Thus, the two occurrences of ``a.x`` do not necessarily refer to the same attribute: if the right-hand side expression refers to a class attribute, the left-hand side creates a new instance attribute as the target of the assignment::
pt_pt: Nota: Se o objeto for uma instância de classe e a referência de atributo ocorrer em ambos os lados do operador de atribuição, a expressão do lado direito, ``a.x``, pode aceder a um atributo de instância ou (se não existir nenhum atributo de instância) a um atributo de classe. O destino do lado esquerdo, ``a.x``, é sempre definido como um atributo de instância, criando-o se necessário. Assim, as duas ocorrências de ``a.x`` não se referem necessariamente ao mesmo atributo: se a expressão do lado direito se referir a um atributo de classe, o lado esquerdo cria um novo atributo de instância como destino da atribuição::

source: class Cls: x = 3 # class variable inst = Cls() inst.x = inst.x + 1 # writes inst.x as 4 leaving Cls.x as 3
pt_pt: class Cls: x = 3 # variável de classe inst = Cls() inst.x = inst.x + 1 # escreve inst.x como 4, deixando Cls.x como 3

source: This description does not necessarily apply to descriptor attributes, such as properties created with :func:`property`.
pt_pt: Esta descrição não se aplica necessariamente a atributos descritores, como propriedades criadas com :func:`property`.

source: If the primary is a mutable sequence object (such as a list), the subscript must yield an integer. If it is negative, the sequence's length is added to it. The resulting value must be a nonnegative integer less than the sequence's length, and the sequence is asked to assign the assigned object to its item with that index. If the index is out of range, :exc:`IndexError` is raised (assignment to a subscripted sequence cannot add new items to a list).
pt_pt: Se o primário for um objeto de sequência mutável (como uma lista), o índice deve produzir um inteiro. Se for negativo, o comprimento da sequência é adicionado a ele. O valor resultante deve ser um inteiro não negativo menor que o comprimento da sequência, e a sequência é solicitada a atribuir o objeto atribuído ao seu item com esse índice. Se o índice estiver fora do intervalo, é levantada uma exceção :exc:`IndexError` (a atribuição a uma sequência indexada não pode adicionar novos itens a uma lista).

source: If the primary is a mapping object (such as a dictionary), the subscript must have a type compatible with the mapping's key type, and the mapping is then asked to create a key/value pair which maps the subscript to the assigned object. This can either replace an existing key/value pair with the same key value, or insert a new key/value pair (if no key with the same value existed).
pt_pt: Se o primário for um objeto de mapeamento (como um dicionário), o índice deve ter um tipo compatível com o tipo de chave do mapeamento, e o mapeamento é então solicitado a criar um par chave/valor que mapeia o índice para o objeto atribuído. Isto pode substituir um par chave/valor existente com o mesmo valor de chave ou inserir um novo par chave/valor (se não existir nenhuma chave com o mesmo valor).

source: Although the definition of assignment implies that overlaps between the left-hand side and the right-hand side are 'simultaneous' (for example ``a, b = b, a`` swaps two variables), overlaps *within* the collection of assigned-to variables occur left-to-right, sometimes resulting in confusion. For instance, the following program prints ``[0, 2]``::
pt_pt: Embora a definição de atribuição implique que as sobreposições entre o lado esquerdo e o lado direito são 'simultâneas' (por exemplo, ``a, b = b, a`` troca duas variáveis), as sobreposições *dentro* da coleção de variáveis atribuídas ocorrem da esquerda para a direita, o que por vezes pode causar confusão. Por exemplo, o seguinte programa imprime ``[0, 2]``::

source: x = [0, 1] i = 0 i, x[i] = 1, 2 # i is updated, then x[i] is updated print(x)
pt_pt: x = [0, 1] i = 0 i, x[i] = 1, 2 # i é atualizado, depois x[i] é atualizado print(x)

source: :pep:`3132` - Extended Iterable Unpacking
pt_pt: :pep:`3132` - Desempacotamento Iterável Estendido

source: The specification for the ``*target`` feature.
pt_pt: A especificação para a funcionalidade ``*target``.

source: Augmented assignment statements
pt_pt: Instruções de atribuição aumentada

source: Augmented assignment is the combination, in a single statement, of a binary operation and an assignment statement:
pt_pt: A atribuição aumentada é a combinação, numa única instrução, de uma operação binária e uma instrução de atribuição:

source: (See section :ref:`primaries` for the syntax definitions of the last three symbols.)
pt_pt: (Consulte a secção :ref:`primaries` para as definições de sintaxe dos últimos três símbolos.)

source: An augmented assignment evaluates the target (which, unlike normal assignment statements, cannot be an unpacking) and the expression list, performs the binary operation specific to the type of assignment on the two operands, and assigns the result to the original target. The target is only evaluated once.
pt_pt: Uma atribuição aumentada avalia o destino (que, ao contrário das instruções de atribuição normais, não pode ser um desempacotamento) e a lista de expressões, executa a operação binária específica para o tipo de atribuição nos dois operandos e atribui o resultado ao destino original. O destino é avaliado apenas uma vez.

source: An augmented assignment statement like ``x += 1`` can be rewritten as ``x = x + 1`` to achieve a similar, but not exactly equal effect. In the augmented version, ``x`` is only evaluated once. Also, when possible, the actual operation is performed *in-place*, meaning that rather than creating a new object and assigning that to the target, the old object is modified instead.
pt_pt: Uma instrução de atribuição aumentada como ``x += 1`` pode ser reescrita como ``x = x + 1`` para alcançar um efeito semelhante, mas não exatamente igual. Na versão aumentada, ``x`` é avaliado apenas uma vez. Além disso, sempre que possível, a operação é realizada *in-place*, o que significa que, em vez de criar um novo objeto e atribuí-lo ao destino, o objeto antigo é modificado.

source: Unlike normal assignments, augmented assignments evaluate the left-hand side *before* evaluating the right-hand side. For example, ``a[i] += f(x)`` first looks-up ``a[i]``, then it evaluates ``f(x)`` and performs the addition, and lastly, it writes the result back to ``a[i]``.
pt_pt: Ao contrário das atribuições normais, as atribuições aumentadas avaliam o lado esquerdo *antes* de avaliar o lado direito. Por exemplo, ``a[i] += f(x)`` primeiro procura ``a[i]``, depois avalia ``f(x)`` e executa a adição, e finalmente escreve o resultado de volta em ``a[i]``.

source: With the exception of assigning to tuples and multiple targets in a single statement, the assignment done by augmented assignment statements is handled the same way as normal assignments. Similarly, with the exception of the possible *in-place* behavior, the binary operation performed by augmented assignment is the same as the normal binary operations.
pt_pt: Com exceção da atribuição a *tuples* e a múltiplos destinos numa única instrução, a atribuição feita por instruções de atribuição aumentada é tratada da mesma forma que as atribuições normais. Da mesma forma, com exceção do possível comportamento *in-place*, a operação binária realizada pela atribuição aumentada é a mesma que as operações binárias normais.

source: For targets which are attribute references, the same :ref:`caveat about class and instance attributes <attr-target-note>` applies as for regular assignments.
pt_pt: Para destinos que são referências de atributos, aplica-se a mesma :ref:`ressalva sobre atributos de classe e instância <attr-target-note>` que se aplica a atribuições regulares.

source: Annotated assignment statements
pt_pt: Instruções de atribuição anotada

source: :term:`Annotation <variable annotation>` assignment is the combination, in a single statement, of a variable or attribute annotation and an optional assignment statement:
pt_pt: A :term:`anotação <variable annotation>` de atribuição é a combinação, numa única instrução, de uma anotação de variável ou atributo e uma instrução de atribuição opcional:

source: The difference from normal :ref:`assignment` is that only a single target is allowed.
pt_pt: A diferença em relação à :ref:`assignment` normal é que apenas um único destino é permitido.

source: The assignment target is considered "simple" if it consists of a single name that is not enclosed in parentheses. For simple assignment targets, if in class or module scope, the annotations are gathered in a lazily evaluated :ref:`annotation scope <annotation-scopes>`. The annotations can be evaluated using the :attr:`~object.__annotations__` attribute of a class or module, or using the facilities in the :mod:`annotationlib` module.
pt_pt: O destino da atribuição é considerado "simples" se consistir num único nome que não esteja encerrado entre parênteses. Para destinos de atribuição simples, se estiverem no âmbito de uma classe ou módulo, as anotações são recolhidas num :ref:`âmbitos de anotação <annotation-scopes>` avaliado de forma preguiçosa. As anotações podem ser avaliadas usando o atributo :attr:`~object.__annotations__` de uma classe ou módulo, ou usando as funcionalidades do módulo :mod:`annotationlib`.

source: If the assignment target is not simple (an attribute, subscript node, or parenthesized name), the annotation is never evaluated.
pt_pt: Se o destino da atribuição não for simples (um atributo, nó de *subscription* ou nome entre parênteses), a anotação nunca é avaliada.

source: If a name is annotated in a function scope, then this name is local for that scope. Annotations are never evaluated and stored in function scopes.
pt_pt: Se um nome for anotado no âmbito de uma função, então esse nome é local para esse âmbito. As anotações nunca são avaliadas nem armazenadas em âmbitos de função.

source: If the right hand side is present, an annotated assignment performs the actual assignment as if there was no annotation present. If the right hand side is not present for an expression target, then the interpreter evaluates the target except for the last :meth:`~object.__setitem__` or :meth:`~object.__setattr__` call.
pt_pt: Se o lado direito estiver presente, uma atribuição anotada realiza a atribuição real como se não houvesse anotação presente. Se o lado direito não estiver presente para um destino de expressão, então o interpretador avalia o destino, exceto para a última chamada a :meth:`~object.__setitem__` ou :meth:`~object.__setattr__`.

source: :pep:`526` - Syntax for Variable Annotations
pt_pt: :pep:`526` - Sintaxe para Anotações de Variáveis

source: The proposal that added syntax for annotating the types of variables (including class variables and instance variables), instead of expressing them through comments.
pt_pt: A proposta que adicionou sintaxe para anotar os tipos de variáveis (incluindo variáveis de classe e de instância), em vez de os expressar através de comentários.

source: :pep:`484` - Type hints
pt_pt: :pep:`484` - Dicas de tipo

source: The proposal that added the :mod:`typing` module to provide a standard syntax for type annotations that can be used in static analysis tools and IDEs.
pt_pt: A proposta que adicionou o módulo :mod:`typing` para fornecer uma sintaxe padrão para anotações de tipo que podem ser usadas em ferramentas de análise estática e IDEs.

source: Now annotated assignments allow the same expressions in the right hand side as regular assignments. Previously, some expressions (like un-parenthesized tuple expressions) caused a syntax error.
pt_pt: Agora, as atribuições anotadas permitem as mesmas expressões no lado direito que as atribuições regulares. Anteriormente, algumas expressões (como expressões de *tuples* não parentizadas) causavam um erro de sintaxe.

source: Annotations are now lazily evaluated in a separate :ref:`annotation scope <annotation-scopes>`. If the assignment target is not simple, annotations are never evaluated.
pt_pt: As anotações são agora avaliadas de forma preguiçosa num :ref:`âmbitos de anotação <annotation-scopes>` separado. Se o destino da atribuição não for simples, as anotações nunca são avaliadas.

source: The :keyword:`!assert` statement
pt_pt: A instrução :keyword:`!assert`

source: Assert statements are a convenient way to insert debugging assertions into a program:
pt_pt: As instruções assert são uma forma conveniente de inserir afirmações de depuração num programa:

source: The simple form, ``assert expression``, is equivalent to ::
pt_pt: A forma simples, ``assert expression``, é equivalente a ::

source: if __debug__: if not expression: raise AssertionError
pt_pt: if __debug__: if not expressão: raise AssertionError

source: The extended form, ``assert expression1, expression2``, is equivalent to ::
pt_pt: A forma estendida, ``assert expression1, expression2``, é equivalente a ::

source: if __debug__: if not expression1: raise AssertionError(expression2)
pt_pt: if __debug__: if not expressão1: raise AssertionError(expressão2)

source: These equivalences assume that :const:`__debug__` and :exc:`AssertionError` refer to the built-in variables with those names. In the current implementation, the built-in variable ``__debug__`` is ``True`` under normal circumstances, ``False`` when optimization is requested (command line option :option:`-O`). The current code generator emits no code for an :keyword:`assert` statement when optimization is requested at compile time. Note that it is unnecessary to include the source code for the expression that failed in the error message; it will be displayed as part of the stack trace.
pt_pt: Estas equivalências assumem que :const:`__debug__` e :exc:`AssertionError` se referem às variáveis integradas com esses nomes. Na implementação atual, a variável integrada ``__debug__`` é ``True`` em circunstâncias normais e ``False`` quando a otimização é solicitada (opção de linha de comandos :option:`-O`). O gerador de código atual não emite código para uma instrução :keyword:`assert` quando a otimização é solicitada em tempo de compilação. Note que não é necessário incluir o código-fonte da expressão que falhou na mensagem de erro; ele será exibido como parte do rastreio da pilha.

source: Assignments to :const:`__debug__` are illegal. The value for the built-in variable is determined when the interpreter starts.
pt_pt: Atribuições a :const:`__debug__` são ilegais. O valor da variável integrada é determinado quando o interpretador é iniciado.

source: The :keyword:`!pass` statement
pt_pt: A instrução :keyword:`!pass`

source: :keyword:`pass` is a null operation --- when it is executed, nothing happens. It is useful as a placeholder when a statement is required syntactically, but no code needs to be executed, for example::
pt_pt: :keyword:`pass` é uma operação nula --- quando executada, nada acontece. É útil como um espaço reservado quando uma instrução é necessária sintaticamente, mas nenhum código precisa ser executado, por exemplo::

source: def f(arg): pass # a function that does nothing (yet) class C: pass # a class with no methods (yet)
pt_pt: def f(arg): pass # uma função que não faz nada (ainda) class C: pass # uma classe sem métodos (ainda)

source: The :keyword:`!del` statement
pt_pt: A instrução :keyword:`!del`

source: Deletion is recursively defined very similar to the way assignment is defined. Rather than spelling it out in full details, here are some hints.
pt_pt: A eliminação é definida recursivamente de forma muito semelhante à forma como a atribuição é definida. Em vez de detalhar completamente, aqui estão algumas dicas.

source: Deletion of a target list recursively deletes each target, from left to right.
pt_pt: A eliminação de uma lista de destinos elimina recursivamente cada destino, da esquerda para a direita.
