Repository: NyaPuma/python-docs-pt
Catalog: library/asyncio-dev.po
Languages: pt_pt

source: Developing with asyncio
pt_pt: Desenvolver com asyncio

source: Asynchronous programming is different from classic "sequential" programming.
pt_pt: A programação assíncrona é diferente da programação "sequencial" clássica.

source: This page lists common mistakes and traps and explains how to avoid them.
pt_pt: Esta página lista erros e armadilhas comuns e explica como evitá-los.

source: Debug Mode
pt_pt: Modo de Depuração

source: By default asyncio runs in production mode. In order to ease the development asyncio has a *debug mode*.
pt_pt: Por predefinição, o asyncio corre em modo de produção. Para facilitar o desenvolvimento, o asyncio possui um *modo de depuração* (debug mode).

source: There are several ways to enable asyncio debug mode:
pt_pt: Existem várias formas de ativar o modo de depuração do asyncio:

source: Setting the :envvar:`PYTHONASYNCIODEBUG` environment variable to ``1``.
pt_pt: Definir a variável de ambiente :envvar:`PYTHONASYNCIODEBUG` para ``1``.

source: Using the :ref:`Python Development Mode <devmode>`.
pt_pt: Usar o :ref:`Modo de Desenvolvimento do Python <devmode>`.

source: Passing ``debug=True`` to :func:`asyncio.run`.
pt_pt: Passar ``debug=True`` para :func:`asyncio.run`.

source: Calling :meth:`loop.set_debug`.
pt_pt: Chamar :meth:`loop.set_debug`.

source: In addition to enabling the debug mode, consider also:
pt_pt: Além de ativar o modo de depuração, considere também:

source: setting the log level of the :ref:`asyncio logger <asyncio-logger>` to :py:const:`logging.DEBUG`, for example the following snippet of code can be run at startup of the application::
pt_pt: definir o nível de log do :ref:`asyncio logger <asyncio-logger>` para :py:const:`logging.DEBUG`; por exemplo, o seguinte snippet de código pode ser executado no arranque da aplicação::

source: configuring the :mod:`warnings` module to display :exc:`ResourceWarning` warnings. One way of doing that is by using the :option:`-W` ``default`` command line option.
pt_pt: configurar o módulo :mod:`warnings` para exibir avisos :exc:`ResourceWarning`. Uma forma de o fazer é utilizando a opção de linha de comandos :option:`-W` ``default``.

source: When the debug mode is enabled:
pt_pt: Quando o modo de depuração está ativado:

source: Many non-threadsafe asyncio APIs (such as :meth:`loop.call_soon` and :meth:`loop.call_at` methods) raise an exception if they are called from a wrong thread.
pt_pt: Muitas APIs do asyncio que não são seguras para threads (como os métodos :meth:`loop.call_soon` e :meth:`loop.call_at`) lançam uma exceção se forem chamadas a partir da thread errada.

source: The execution time of the I/O selector is logged if it takes too long to perform an I/O operation.
pt_pt: O tempo de execução do seletor de I/O é registado se demorar demasiado tempo a realizar uma operação de I/O.

source: Callbacks taking longer than 100 milliseconds are logged. The :attr:`loop.slow_callback_duration` attribute can be used to set the minimum execution duration in seconds that is considered "slow".
pt_pt: Callbacks que demorem mais de 100 milissegundos são registados. O atributo :attr:`loop.slow_callback_duration` pode ser usado para definir a duração mínima de execução em segundos que é considerada "lenta".

source: Concurrency and Multithreading
pt_pt: Concorrência e Multithreading

source: An event loop runs in a thread (typically the main thread) and executes all callbacks and Tasks in its thread. While a Task is running in the event loop, no other Tasks can run in the same thread. When a Task executes an ``await`` expression, the running Task gets suspended, and the event loop executes the next Task.
pt_pt: Um loop de eventos (event loop) corre numa thread (tipicamente a thread principal) e executa todos os callbacks e Tarefas (Tasks) na sua thread. Enquanto uma Task está a correr no event loop, nenhuma outra Task pode correr na mesma thread. Quando uma Task executa uma expressão ``await``, a Task em execução é suspensa e o event loop executa a próxima Task.

source: To schedule a :term:`callback` from another OS thread, the :meth:`loop.call_soon_threadsafe` method should be used. Example::
pt_pt: Para agendar um :term:`callback` a partir de outra thread do SO, deve ser usado o método :meth:`loop.call_soon_threadsafe`. Exemplo::

source: Almost all asyncio objects are not thread safe, which is typically not a problem unless there is code that works with them from outside of a Task or a callback. If there's a need for such code to call a low-level asyncio API, the :meth:`loop.call_soon_threadsafe` method should be used, e.g.::
pt_pt: Quase todos os objetos asyncio não são seguros para threads, o que normalmente não é um problema, a menos que haja código que trabalhe com eles fora de uma Task ou de um callback. Se houver necessidade de tal código chamar uma API de baixo nível do asyncio, deve ser usado o método :meth:`loop.call_soon_threadsafe`, por ex.::

source: To schedule a coroutine object from a different OS thread, the :func:`run_coroutine_threadsafe` function should be used. It returns a :class:`concurrent.futures.Future` to access the result::
pt_pt: Para agendar um objeto corrotina a partir de uma thread do SO diferente, deve ser usada a função :func:`run_coroutine_threadsafe`. Esta retorna um :class:`concurrent.futures.Future` para aceder ao resultado::

source: async def coro_func(): return await asyncio.sleep(1, 42) # Later in another OS thread: future = asyncio.run_coroutine_threadsafe(coro_func(), loop) # Wait for the result: result = future.result()
pt_pt: async def coro_func(): return await asyncio.sleep(1, 42) # Mais tarde, noutro tópico do SO: future = asyncio.run_coroutine_threadsafe(coro_func(), loop) # Aguarde o resultado: result = future.result()

source: To handle signals the event loop must be run in the main thread.
pt_pt: Para lidar com sinais, o event loop deve ser executado na thread principal.

source: The :meth:`loop.run_in_executor` method can be used with a :class:`concurrent.futures.ThreadPoolExecutor` or :class:`~concurrent.futures.InterpreterPoolExecutor` to execute blocking code in a different OS thread without blocking the OS thread that the event loop runs in.
pt_pt: O método :meth:`loop.run_in_executor` pode ser usado com um :class:`concurrent.futures.ThreadPoolExecutor` ou :class:`~concurrent.futures.InterpreterPoolExecutor` para executar código bloqueante numa thread do SO diferente sem bloquear a thread onde o event loop corre.

source: There is currently no way to schedule coroutines or callbacks directly from a different process (such as one started with :mod:`multiprocessing`). The :ref:`asyncio-event-loop-methods` section lists APIs that can read from pipes and watch file descriptors without blocking the event loop. In addition, asyncio's :ref:`Subprocess <asyncio-subprocess>` APIs provide a way to start a process and communicate with it from the event loop. Lastly, the aforementioned :meth:`loop.run_in_executor` method can also be used with a :class:`concurrent.futures.ProcessPoolExecutor` to execute code in a different process.
pt_pt: Atualmente não existe forma de agendar corrotinas ou callbacks diretamente de um processo diferente (como um iniciado com :mod:`multiprocessing`). A secção :ref:`asyncio-event-loop-methods` lista APIs que podem ler de pipes e monitorizar descritores de ficheiros sem bloquear o event loop. Além disso, as APIs de :ref:`Subprocess <asyncio-subprocess>` do asyncio fornecem uma forma de iniciar um processo e comunicar com ele a partir do event loop. Finalmente, o já mencionado método :meth:`loop.run_in_executor` também pode ser usado com um :class:`concurrent.futures.ProcessPoolExecutor` para executar código num processo diferente.

source: Running Blocking Code
pt_pt: Executar Código Bloqueante

source: Blocking (CPU-bound) code should not be called directly. For example, if a function performs a CPU-intensive calculation for 1 second, all concurrent asyncio Tasks and IO operations would be delayed by 1 second.
pt_pt: Código bloqueante (CPU-bound) não deve ser chamado diretamente. Por exemplo, se uma função realizar um cálculo intensivo de CPU durante 1 segundo, todas as Tasks e operações de IO assíncronas concorrentes seriam atrasadas em 1 segundo.

source: An executor can be used to run a task in a different thread, including in a different interpreter, or even in a different process to avoid blocking the OS thread with the event loop. See the :meth:`loop.run_in_executor` method for more details.
pt_pt: Um executor pode ser usado para correr uma tarefa numa thread diferente, incluindo num intérprete diferente, ou até num processo diferente para evitar bloquear a thread do SO com o event loop. Consulte o método :meth:`loop.run_in_executor` para mais detalhes.

source: Logging
pt_pt: Registo (Logging)

source: asyncio uses the :mod:`logging` module and all logging is performed via the ``"asyncio"`` logger.
pt_pt: O asyncio utiliza o módulo :mod:`logging` e todo o registo é efetuado através do logger ``"asyncio"``.

source: The default log level is :py:const:`logging.INFO`, which can be easily adjusted::
pt_pt: O nível de log predefinido é :py:const:`logging.INFO`, que pode ser facilmente ajustado::

source: Network logging can block the event loop. It is recommended to use a separate thread for handling logs or use non-blocking IO. For example, see :ref:`blocking-handlers`.
pt_pt: O registo de logs via rede pode bloquear o event loop. Recomenda-se o uso de uma thread separada para lidar com logs ou o uso de IO não bloqueante. Por exemplo, veja :ref:`blocking-handlers`.

source: Detect never-awaited coroutines
pt_pt: Detetar corrotinas nunca aguardadas (never-awaited)

source: When a coroutine function is called, but not awaited (e.g. ``coro()`` instead of ``await coro()``) or the coroutine is not scheduled with :meth:`asyncio.create_task`, asyncio will emit a :exc:`RuntimeWarning`::
pt_pt: Quando uma função corrotina é chamada, mas não aguardada (ex: ``coro()`` em vez de ``await coro()``) ou a corrotina não é agendada com :meth:`asyncio.create_task`, o asyncio emitirá um :exc:`RuntimeWarning`::

source: import asyncio async def test(): print("never scheduled") async def main(): test() asyncio.run(main())
pt_pt: import asyncio async def test(): print("nunca agendada") async def main(): test() asyncio.run(main())

source: Output::
pt_pt: Saída::

source: Output in debug mode::
pt_pt: Saída em modo de depuração::

source: The usual fix is to either await the coroutine or call the :meth:`asyncio.create_task` function::
pt_pt: A correção habitual é aguardar pela corrotina ou chamar a função :meth:`asyncio.create_task`::

source: Detect never-retrieved exceptions
pt_pt: Detetar exceções nunca recuperadas

source: If a :meth:`Future.set_exception` is called but the Future object is never awaited on, the exception would never be propagated to the user code. In this case, asyncio would emit a log message when the Future object is garbage collected.
pt_pt: Se um :meth:`Future.set_exception` for chamado mas o objeto Future nunca for aguardado, a exceção nunca seria propagada para o código do utilizador. Neste caso, o asyncio emitiria uma mensagem de log quando o objeto Future fosse recolhido pelo garbage collector.

source: Example of an unhandled exception::
pt_pt: Exemplo de uma exceção não tratada::

source: import asyncio async def bug(): raise Exception("not consumed") async def main(): asyncio.create_task(bug()) asyncio.run(main())
pt_pt: import asyncio async def bug(): raise Exception("não consumida") async def main(): asyncio.create_task(bug()) asyncio.run(main())

source: Task exception was never retrieved future: <Task finished coro=<bug() done, defined at test.py:3> exception=Exception('not consumed')> Traceback (most recent call last): File "test.py", line 4, in bug raise Exception("not consumed") Exception: not consumed
pt_pt: Task exception was never retrieved future: <Task finished coro=<bug() done, defined at test.py:3> exception=Exception('não consumida')> Traceback (most recent call last): File "test.py", line 4, in bug raise Exception("não consumida") Exception: não consumida

source: :ref:`Enable the debug mode <asyncio-debug-mode>` to get the traceback where the task was created::
pt_pt: :ref:`Ative o modo de depuração <asyncio-debug-mode>` para obter o traceback de onde a tarefa foi criada::

source: Task exception was never retrieved future: <Task finished coro=<bug() done, defined at test.py:3> exception=Exception('not consumed') created at asyncio/tasks.py:321> source_traceback: Object created at (most recent call last): File "../t.py", line 9, in <module> asyncio.run(main(), debug=True) < .. > Traceback (most recent call last): File "../t.py", line 4, in bug raise Exception("not consumed") Exception: not consumed
pt_pt: Task exception was never retrieved future: <Task finished coro=<bug() done, defined at test.py:3> exception=Exception('não consumida') created at asyncio/tasks.py:321> source_traceback: Object created at (most recent call last): File "../t.py", line 9, in <module> asyncio.run(main(), debug=True) < .. > Traceback (most recent call last): File "../t.py", line 4, in bug raise Exception("não consumida") Exception: não consumida
