Repository: NyaPuma/python-docs-pt
Catalog: library/asyncio.po
Languages: pt_pt

source: High-level APIs
pt_pt: APIs de alto nível

source: Low-level APIs
pt_pt: APIs de baixo nível

source: Guides and Tutorials
pt_pt: Guias e Tutoriais

source: :mod:`!asyncio` --- Asynchronous I/O
pt_pt: :mod:`!asyncio` --- I/O assíncrono

source: asyncio is a library to write **concurrent** code using the **async/await** syntax.
pt_pt: asyncio é uma biblioteca para escrever código **concorrente** usando a sintaxe **async/await**.

source: asyncio is used as a foundation for multiple Python asynchronous frameworks that provide high-performance network and web-servers, database connection libraries, distributed task queues, etc.
pt_pt: O asyncio é usado como base para várias estruturas assíncronas Python que fornecem servidores de rede e web de alto desempenho, bibliotecas de conexão de base de dados, filas de tarefas distribuídas, etc.

source: asyncio is often a perfect fit for IO-bound and high-level **structured** network code.
pt_pt: O asyncio é frequentemente a escolha perfeita para código de rede **estruturado** de alto nível e vinculado o I/O.

source: Explanation of the fundamentals of asyncio.
pt_pt: Explicação dos fundamentos do asyncio.

source: asyncio provides a set of **high-level** APIs to:
pt_pt: O asyncio fornece um conjunto de APIs de alto nível para:

source: :ref:`run Python coroutines <coroutine>` concurrently and have full control over their execution;
pt_pt: :ref:`executar corrotinas Python <coroutine>` simultaneamente e ter controlo total sobre a sua execução;

source: perform :ref:`network IO and IPC <asyncio-streams>`;
pt_pt: executar :ref:`IO de rede e IPC <asyncio-streams>`;

source: control :ref:`subprocesses <asyncio-subprocess>`;
pt_pt: controlar :ref:`subprocessos <asyncio-subprocess>`;

source: distribute tasks via :ref:`queues <asyncio-queues>`;
pt_pt: distribuir tarefas através de :ref:`filas <asyncio-queues>`;

source: :ref:`synchronize <asyncio-sync>` concurrent code;
pt_pt: :ref:`sincronizar <asyncio-sync>` código concorrente;

source: Additionally, there are **low-level** APIs for *library and framework developers* to:
pt_pt: Além disso, existem APIs de **baixo nível** para *desenvolvedores de bibliotecas e frameworks* para:

source: create and manage :ref:`event loops <asyncio-event-loop>`, which provide asynchronous APIs for :ref:`networking <loop_create_server>`, running :ref:`subprocesses <loop_subprocess_exec>`, handling :ref:`OS signals <loop_add_signal_handler>`, etc;
pt_pt: criar e gerir :ref:`event loops <asyncio-event-loop>`, que fornecem APIs assíncronas para :ref:`networking <loop_create_server>`, executar :ref:`subprocessos <loop_subprocess_exec>`, lidar com :ref:`sinais do sistema operativo <loop_add_signal_handler>`, etc.;

source: implement efficient protocols using :ref:`transports <asyncio-transports-protocols>`;
pt_pt: implementar protocolos eficientes utilizando :ref:`transports <asyncio-transports-protocols>`;

source: :ref:`bridge <asyncio-futures>` callback-based libraries and code with async/await syntax.
pt_pt: :ref:`bridge <asyncio-futures>` bibliotecas baseadas em callback e código com sintaxe async/await.

source: Availability
pt_pt: Disponibilidade

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
pt_pt: Este módulo não funciona ou não está disponível em WebAssembly. Consulte :ref:`wasm-availability` para mais informações.

source: You can experiment with an ``asyncio`` concurrent context in the :term:`REPL`:
pt_pt: Você pode experimentar um contexto concorrente ``asyncio`` no :term:`REPL`:

source: This REPL provides limited compatibility with :envvar:`PYTHON_BASIC_REPL`. It is recommended that the default REPL is used for full functionality and the latest features.
pt_pt: Este REPL oferece compatibilidade limitada com :envvar:`PYTHON_BASIC_REPL`. Recomenda-se usar o REPL padrão para obter funcionalidade completa e os recursos mais recentes.

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_stdin`` with no arguments.
pt_pt: Levanta um :ref:`evento de auditoria <auditing>` ``cpython.run_stdin`` sem argumentos.

source: (also 3.11.10, 3.10.15, 3.9.20, and 3.8.20) Emits audit events.
pt_pt: (também 3.11.10, 3.10.15, 3.9.20, e 3.8.20) Emite eventos de auditoria.

source: Uses PyREPL if possible, in which case :envvar:`PYTHONSTARTUP` is also executed. Emits audit events.
pt_pt: Usa PyREPL se possível, caso em que :envvar:`PYTHONSTARTUP` também é executado. Emite eventos de auditoria.

source: Reference
pt_pt: Referência

source: The source code for asyncio can be found in :source:`Lib/asyncio/`.
pt_pt: O código-fonte do asyncio pode ser encontrado em :source:`Lib/asyncio/`.
