Repository: NyaPuma/python-docs-pt
Catalog: library/asyncio-extending.po
Languages: pt_pt

source: Extending
pt_pt: Estender

source: The main direction for :mod:`asyncio` extending is writing custom *event loop* classes. Asyncio has helpers that could be used to simplify this task.
pt_pt: A principal direção para a extensão do :mod:`asyncio` é escrever classes personalizadas de *loop de eventos*. O Asyncio possui auxiliares que podem ser usados para simplificar essa tarefa.

source: Third-parties should reuse existing asyncio code with caution, a new Python version is free to break backward compatibility in *internal* part of API.
pt_pt: Terceiros devem reutilizar o código asyncio existente com cautela, uma nova versão do Python é livre para quebrar a compatibilidade retroativa na parte *interna* da API.

source: Writing a Custom Event Loop
pt_pt: Escrever um loop de eventos personalizado

source: :class:`asyncio.AbstractEventLoop` declares very many methods. Implementing all them from scratch is a tedious job.
pt_pt: :class:`asyncio.AbstractEventLoop` declara muitos métodos. Implementar todos eles do zero é uma tarefa tediosa.

source: A loop can get many common methods implementation for free by inheriting from :class:`asyncio.BaseEventLoop`.
pt_pt: Um loop pode obter muitas implementações de métodos comuns gratuitamente, herdando de :class:`asyncio.BaseEventLoop`.

source: In turn, the successor should implement a bunch of *private* methods declared but not implemented in :class:`asyncio.BaseEventLoop`.
pt_pt: Por sua vez, o sucessor deve implementar um conjunto de métodos *privados* declarados, mas não implementados em :class:`asyncio.BaseEventLoop`.

source: For example, ``loop.create_connection()`` checks arguments, resolves DNS addresses, and calls ``loop._make_socket_transport()`` that should be implemented by inherited class. The ``_make_socket_transport()`` method is not documented and is considered as an *internal* API.
pt_pt: Por exemplo, ``loop.create_connection()`` verifica argumentos, resolve endereços DNS e chama ``loop._make_socket_transport()``, que deve ser implementado pela classe herdada. O método ``_make_socket_transport()`` não está documentado e é considerado uma API *interna*.

source: Future and Task private constructors
pt_pt: Construtores privados Future e Task

source: :class:`asyncio.Future` and :class:`asyncio.Task` should be never created directly, please use corresponding :meth:`loop.create_future` and :meth:`loop.create_task`, or :func:`asyncio.create_task` factories instead.
pt_pt: :class:`asyncio.Future` e :class:`asyncio.Task` nunca devem ser criados diretamente. Use as fábricas correspondentes :meth:`loop.create_future` e :meth:`loop.create_task` ou :func:`asyncio.create_task`.

source: However, third-party *event loops* may *reuse* built-in future and task implementations for the sake of getting a complex and highly optimized code for free.
pt_pt: No entanto, *event loops* de terceiros podem *reutilizar* implementações internas futuras e de tarefas com o objetivo de obter um código complexo e altamente otimizado gratuitamente.

source: For this purpose the following, *private* constructors are listed:
pt_pt: Para este efeito, estão listados os seguintes construtores *privados*:

source: Create a built-in future instance.
pt_pt: Criar uma instância futura incorporada

source: *loop* is an optional event loop instance.
pt_pt: *loop* é uma instância opcional do ciclo de eventos.

source: Create a built-in task instance.
pt_pt: Criar uma instância de tarefa incorporada.

source: *loop* is an optional event loop instance. The rest of arguments are described in :meth:`loop.create_task` description.
pt_pt: *loop* é uma instância opcional do loop de eventos. Os restantes argumentos são descritos na descrição de :meth:`loop.create_task`.

source: *context* argument is added.
pt_pt: O argumento *context* é adicionado.

source: Task lifetime support
pt_pt: Suporte ao longo da vida útil da tarefa

source: A third party task implementation should call the following functions to keep a task visible by :func:`asyncio.all_tasks` and :func:`asyncio.current_task`:
pt_pt: A implementação de uma tarefa de terceiros deve chamar as seguintes funções para manter uma tarefa visível por :func:`asyncio.all_tasks` e :func:`asyncio.current_task`:

source: Register a new *task* as managed by *asyncio*.
pt_pt: Registre uma nova *tarefa* que seja gerida por *asyncio*.

source: Call the function from a task constructor.
pt_pt: Chame a função a partir de um construtor de tarefas.

source: Unregister a *task* from *asyncio* internal structures.
pt_pt: Cancele o registo de uma *tarefa* das estruturas internas do *asyncio*.

source: The function should be called when a task is about to finish.
pt_pt: A função deve ser chamada quando uma tarefa estiver prestes a terminar.

source: Switch the current task to the *task* argument.
pt_pt: Mude a tarefa atual para o argumento *tarefa*.

source: Call the function just before executing a portion of embedded *coroutine* (:meth:`coroutine.send` or :meth:`coroutine.throw`).
pt_pt: Chame a função imediatamente antes de executar uma parte da *corrotina* incorporada (:meth:`coroutine.send` ou :meth:`coroutine.throw`).

source: Switch the current task back from *task* to ``None``.
pt_pt: Mude a tarefa atual de *tarefa* para ``None``.

source: Call the function just after :meth:`coroutine.send` or :meth:`coroutine.throw` execution.
pt_pt: Chame a função logo após a execução de :meth:`coroutine.send` ou :meth:`coroutine.throw`.
