Repository: NyaPuma/python-docs-pt
Catalog: library/base64.po
Languages: pt_pt

source: :mod:`!base64` --- Base16, Base32, Base64, Base85 Data Encodings
pt_pt: :mod:`!base64` --- Codificações de Dados Base16, Base32, Base64, Base85

source: **Source code:** :source:`Lib/base64.py`
pt_pt: **Código-fonte:** :source:`Lib/base64.py`

source: This module provides functions for encoding binary data to printable ASCII characters and decoding such encodings back to binary data. This includes the :ref:`encodings specified in <base64-rfc-4648>` :rfc:`4648` (Base64, Base32 and Base16) and the non-standard :ref:`Base85 encodings <base64-base-85>`.
pt_pt: Este módulo fornece funções para codificar dados binários em caracteres ASCII imprimíveis e descodificar essas codificações de volta para dados binários. Isto inclui as :ref:`codificações especificadas na <base64-rfc-4648>` :rfc:`4648` (Base64, Base32 e Base16) e as :ref:`codificações Base85 <base64-base-85>` não normalizadas.

source: There are two interfaces provided by this module. The modern interface supports encoding :term:`bytes-like objects <bytes-like object>` to ASCII :class:`bytes`, and decoding :term:`bytes-like objects <bytes-like object>` or strings containing ASCII to :class:`bytes`. Both base-64 alphabets defined in :rfc:`4648` (normal, and URL- and filesystem-safe) are supported.
pt_pt: Existem duas interfaces fornecidas por este módulo. A interface moderna suporta a codificação de :term:`objetos do tipo bytes <bytes-like object>` para :class:`bytes` ASCII, e a descodificação de :term:`objetos do tipo bytes <bytes-like object>` ou strings contendo ASCII para :class:`bytes`. Ambos os alfabetos base-64 definidos no :rfc:`4648` (normal, e seguro para URLs e sistemas de ficheiros) são suportados.

source: The :ref:`legacy interface <base64-legacy>` does not support decoding from strings, but it does provide functions for encoding and decoding to and from :term:`file objects <file object>`. It only supports the Base64 standard alphabet, and it adds newlines every 76 characters as per :rfc:`2045`. Note that if you are looking for :rfc:`2045` support you probably want to be looking at the :mod:`email` package instead.
pt_pt: A :ref:`interface legada <base64-legacy>` não suporta a descodificação a partir de strings, mas fornece funções para codificar e descodificar de e para :term:`objetos de ficheiro <file object>`. Suporta apenas o alfabeto padrão Base64 e adiciona quebras de linha a cada 76 caracteres, conforme o :rfc:`2045`. Note que se procura suporte para o :rfc:`2045`, provavelmente deverá consultar o pacote :mod:`email` em vez deste.

source: ASCII-only Unicode strings are now accepted by the decoding functions of the modern interface.
pt_pt: As funções de descodificação da interface moderna aceitam agora strings Unicode apenas de ASCII.

source: Any :term:`bytes-like objects <bytes-like object>` are now accepted by all encoding and decoding functions in this module. Ascii85/Base85 support added.
pt_pt: Quaisquer :term:`objetos do tipo bytes <bytes-like object>` são agora aceites por todas as funções de codificação e descodificação neste módulo. Foi adicionado suporte para Ascii85/Base85.

source: RFC 4648 Encodings
pt_pt: Codificações RFC 4648

source: The :rfc:`4648` encodings are suitable for encoding binary data so that it can be safely sent by email, used as parts of URLs, or included as part of an HTTP POST request.
pt_pt: As codificações :rfc:`4648` são adequadas para codificar dados binários para que possam ser enviados com segurança por e-mail, utilizados como partes de URLs ou incluídos como parte de um pedido HTTP POST.

source: Encode the :term:`bytes-like object` *s* using Base64 and return the encoded :class:`bytes`.
pt_pt: Codifica o :term:`objeto do tipo bytes <bytes-like object>` *s* utilizando Base64 e devolve os :class:`bytes` codificados.

source: Optional *altchars* must be a :term:`bytes-like object` of length 2 which specifies an alternative alphabet for the ``+`` and ``/`` characters. This allows an application to e.g. generate URL or filesystem safe Base64 strings. The default is ``None``, for which the standard Base64 alphabet is used.
pt_pt: O argumento opcional *altchars* deve ser um :term:`objeto do tipo bytes <bytes-like object>` de comprimento 2 que especifica um alfabeto alternativo para os caracteres ``+`` e ``/``. Isto permite que uma aplicação, por exemplo, gere strings Base64 seguras para URL ou sistemas de ficheiros. O padrão é ``None``, para o qual é utilizado o alfabeto Base64 padrão.

source: May assert or raise a :exc:`ValueError` if the length of *altchars* is not 2. Raises a :exc:`TypeError` if *altchars* is not a :term:`bytes-like object`.
pt_pt: Pode emitir um assert ou levantar um :exc:`ValueError` se o comprimento de *altchars* não for 2. Levanta um :exc:`TypeError` se *altchars* não for um :term:`objeto do tipo bytes <bytes-like object>`.

source: Decode the Base64 encoded :term:`bytes-like object` or ASCII string *s* and return the decoded :class:`bytes`.
pt_pt: Descodifica o :term:`objeto do tipo bytes <bytes-like object>` ou string ASCII *s* codificado em Base64 e devolve os :class:`bytes` descodificados.

source: Optional *altchars* must be a :term:`bytes-like object` or ASCII string of length 2 which specifies the alternative alphabet used instead of the ``+`` and ``/`` characters.
pt_pt: O argumento opcional *altchars* deve ser um :term:`objeto do tipo bytes <bytes-like object>` ou string ASCII de comprimento 2 que especifica o alfabeto alternativo utilizado em vez dos caracteres ``+`` e ``/``.

source: A :exc:`binascii.Error` exception is raised if *s* is incorrectly padded.
pt_pt: É levantada uma exceção :exc:`binascii.Error` se *s* tiver um preenchimento (padding) incorreto.

source: If *validate* is ``False`` (the default), characters that are neither in the normal base-64 alphabet nor the alternative alphabet are discarded prior to the padding check. If *validate* is ``True``, these non-alphabet characters in the input result in a :exc:`binascii.Error`.
pt_pt: Se *validate* for ``False`` (o padrão), caracteres que não estejam no alfabeto base-64 normal nem no alfabeto alternativo são descartados antes da verificação do preenchimento. Se *validate* for ``True``, estes caracteres estranhos ao alfabeto na entrada resultam num :exc:`binascii.Error`.

source: For more information about the strict base64 check, see :func:`binascii.a2b_base64`
pt_pt: Para mais informações sobre a verificação estrita de base64, consulte :func:`binascii.a2b_base64`

source: May assert or raise a :exc:`ValueError` if the length of *altchars* is not 2.
pt_pt: Pode afirmar ou levantar um :exc:`ValueError` se o comprimento de *altchars* não for 2.

source: Encode :term:`bytes-like object` *s* using the standard Base64 alphabet and return the encoded :class:`bytes`.
pt_pt: Codifica o :term:`objeto do tipo bytes <bytes-like object>` *s* utilizando o alfabeto Base64 padrão e devolve os :class:`bytes` codificados.

source: Decode :term:`bytes-like object` or ASCII string *s* using the standard Base64 alphabet and return the decoded :class:`bytes`.
pt_pt: Descodifica o :term:`objeto do tipo bytes <bytes-like object>` ou string ASCII *s* utilizando o alfabeto Base64 padrão e devolve os :class:`bytes` descodificados.

source: Encode :term:`bytes-like object` *s* using the URL- and filesystem-safe alphabet, which substitutes ``-`` instead of ``+`` and ``_`` instead of ``/`` in the standard Base64 alphabet, and return the encoded :class:`bytes`. The result can still contain ``=``.
pt_pt: Codifica o :term:`objeto do tipo bytes <bytes-like object>` *s* utilizando o alfabeto seguro para URLs e sistemas de ficheiros, que substitui ``+`` por ``-`` e ``/`` por ``_`` face ao alfabeto Base64 padrão, e devolve os :class:`bytes` codificados. O resultado pode ainda conter ``=``.

source: Decode :term:`bytes-like object` or ASCII string *s* using the URL- and filesystem-safe alphabet, which substitutes ``-`` instead of ``+`` and ``_`` instead of ``/`` in the standard Base64 alphabet, and return the decoded :class:`bytes`.
pt_pt: Descodifica o :term:`objeto do tipo bytes <bytes-like object>` ou string ASCII *s* utilizando o alfabeto seguro para URLs e sistemas de ficheiros, que substitui ``+`` por ``-`` e ``/`` por ``_`` face ao alfabeto Base64 padrão, e devolve os :class:`bytes` descodificados.

source: Encode the :term:`bytes-like object` *s* using Base32 and return the encoded :class:`bytes`.
pt_pt: Codifica o :term:`objeto do tipo bytes <bytes-like object>` *s* utilizando Base32 e devolve os :class:`bytes` codificados.

source: Decode the Base32 encoded :term:`bytes-like object` or ASCII string *s* and return the decoded :class:`bytes`.
pt_pt: Descodifica o :term:`objeto do tipo bytes <bytes-like object>` ou string ASCII *s* codificado em Base32 e devolve os :class:`bytes` descodificados.

source: Optional *casefold* is a flag specifying whether a lowercase alphabet is acceptable as input. For security purposes, the default is ``False``.
pt_pt: O argumento opcional *casefold* é uma flag que especifica se um alfabeto em letras minúsculas é aceitável como entrada. Por motivos de segurança, o padrão é ``False``.

source: :rfc:`4648` allows for optional mapping of the digit 0 (zero) to the letter O (oh), and for optional mapping of the digit 1 (one) to either the letter I (eye) or letter L (el). The optional argument *map01* when not ``None``, specifies which letter the digit 1 should be mapped to (when *map01* is not ``None``, the digit 0 is always mapped to the letter O). For security purposes the default is ``None``, so that 0 and 1 are not allowed in the input.
pt_pt: O :rfc:`4648` permite o mapeamento opcional do dígito 0 (zero) para a letra O (ó), e o mapeamento opcional do dígito 1 (um) para a letra I ou para a letra L (ele). O argumento opcional *map01*, quando não é ``None``, especifica para que letra o dígito 1 deve ser mapeado (quando *map01* não é ``None``, o dígito 0 é sempre mapeado para a letra O). Por motivos de segurança, o padrão é ``None``, para que 0 e 1 não sejam permitidos na entrada.

source: A :exc:`binascii.Error` is raised if *s* is incorrectly padded or if there are non-alphabet characters present in the input.
pt_pt: É levantado um :exc:`binascii.Error` se *s* tiver um preenchimento incorreto ou se existirem caracteres estranhos ao alfabeto na entrada.

source: Similar to :func:`b32encode` but uses the Extended Hex Alphabet, as defined in :rfc:`4648`.
pt_pt: Semelhante a :func:`b32encode` mas utiliza o Alfabeto Hexadecimal Estendido, conforme definido no :rfc:`4648`.

source: Similar to :func:`b32decode` but uses the Extended Hex Alphabet, as defined in :rfc:`4648`.
pt_pt: Semelhante a :func:`b32decode` mas utiliza o Alfabeto Hexadecimal Estendido, conforme definido no :rfc:`4648`.

source: This version does not allow the digit 0 (zero) to the letter O (oh) and digit 1 (one) to either the letter I (eye) or letter L (el) mappings, all these characters are included in the Extended Hex Alphabet and are not interchangeable.
pt_pt: Esta versão não permite os mapeamentos do dígito 0 para a letra O nem do dígito 1 para as letras I ou L; todos estes caracteres estão incluídos no Alfabeto Hexadecimal Estendido e não são permutáveis.

source: Encode the :term:`bytes-like object` *s* using Base16 and return the encoded :class:`bytes`.
pt_pt: Codifica o :term:`objeto do tipo bytes <bytes-like object>` *s* utilizando Base16 e devolve os :class:`bytes` codificados.

source: Decode the Base16 encoded :term:`bytes-like object` or ASCII string *s* and return the decoded :class:`bytes`.
pt_pt: Descodifica o :term:`objeto do tipo bytes <bytes-like object>` ou string ASCII *s* codificado em Base16 e devolve os :class:`bytes` descodificados.

source: Base85 Encodings
pt_pt: Codificações Base85

source: Base85 encoding is not formally specified but rather a de facto standard, thus different systems perform the encoding differently.
pt_pt: A codificação Base85 não está formalmente especificada, sendo antes um padrão de facto; assim, diferentes sistemas realizam a codificação de formas distintas.

source: The :func:`a85encode` and :func:`b85encode` functions in this module are two implementations of the de facto standard. You should call the function with the Base85 implementation used by the software you intend to work with.
pt_pt: As funções :func:`a85encode` e :func:`b85encode` neste módulo são duas implementações deste padrão de facto. Deverá chamar a função com a implementação Base85 utilizada pelo software com o qual pretende trabalhar.

source: The two functions present in this module differ in how they handle the following:
pt_pt: As duas funções presentes neste módulo diferem na forma como lidam com o seguinte:

source: Whether to include enclosing ``<~`` and ``~>`` markers
pt_pt: Se devem incluir os marcadores delimitadores ``<~`` e ``~>``

source: Whether to include newline characters
pt_pt: Se devem incluir caracteres de quebra de linha

source: The set of ASCII characters used for encoding
pt_pt: O conjunto de caracteres ASCII utilizado para a codificação

source: Handling of null bytes
pt_pt: Tratamento de bytes nulos

source: Refer to the documentation of the individual functions for more information.
pt_pt: Consulte a documentação das funções individuais para mais informação.

source: Encode the :term:`bytes-like object` *b* using Ascii85 and return the encoded :class:`bytes`.
pt_pt: Codifica o :term:`objeto do tipo bytes <bytes-like object>` *b* utilizando Ascii85 e devolve os :class:`bytes` codificados.

source: *foldspaces* is an optional flag that uses the special short sequence 'y' instead of 4 consecutive spaces (ASCII 0x20) as supported by 'btoa'. This feature is not supported by the "standard" Ascii85 encoding.
pt_pt: *foldspaces* é uma flag opcional que utiliza a sequência curta especial 'y' em vez de 4 espaços consecutivos (ASCII 0x20), conforme suportado por 'btoa'. Esta funcionalidade não é suportada pela codificação Ascii85 "padrão".

source: *wrapcol* controls whether the output should have newline (``b'\n'``) characters added to it. If this is non-zero, each output line will be at most this many characters long, excluding the trailing newline.
pt_pt: *wrapcol* controla se a saída deve ter caracteres de quebra de linha (``b'\n'``) adicionados. Se for diferente de zero, cada linha de saída terá, no máximo, este número de caracteres, excluindo a quebra de linha final.

source: *pad* controls whether the input is padded to a multiple of 4 before encoding. Note that the ``btoa`` implementation always pads.
pt_pt: *pad* controla se a entrada é preenchida até um múltiplo de 4 antes da codificação. Note que a implementação ``btoa`` preenche sempre.

source: *adobe* controls whether the encoded byte sequence is framed with ``<~`` and ``~>``, which is used by the Adobe implementation.
pt_pt: *adobe* controla se a sequência de bytes codificada é emoldurada com ``<~`` e ``~>``, formato utilizado pela implementação da Adobe.

source: Decode the Ascii85 encoded :term:`bytes-like object` or ASCII string *b* and return the decoded :class:`bytes`.
pt_pt: Descodifica o :term:`objeto do tipo bytes <bytes-like object>` ou string ASCII *b* codificado em Ascii85 e devolve os :class:`bytes` descodificados.

source: *foldspaces* is a flag that specifies whether the 'y' short sequence should be accepted as shorthand for 4 consecutive spaces (ASCII 0x20). This feature is not supported by the "standard" Ascii85 encoding.
pt_pt: *foldspaces* é uma flag que especifica se a sequência curta 'y' deve ser aceite como abreviatura de 4 espaços consecutivos (ASCII 0x20). Esta funcionalidade não é suportada pela codificação Ascii85 "padrão".

source: *adobe* controls whether the input sequence is in Adobe Ascii85 format (i.e. is framed with <~ and ~>).
pt_pt: *adobe* controla se a sequência de entrada está no formato Adobe Ascii85 (ou seja, emoldurada com <~ e ~>).

source: *ignorechars* should be a byte string containing characters to ignore from the input. This should only contain whitespace characters, and by default contains all whitespace characters in ASCII.
pt_pt: *ignorechars* deve ser uma string de bytes contendo caracteres a ignorar na entrada. Esta deve conter apenas caracteres de espaço em branco e, por padrão, contém todos os caracteres de espaço em branco em ASCII.

source: Encode the :term:`bytes-like object` *b* using base85 (as used in e.g. git-style binary diffs) and return the encoded :class:`bytes`.
pt_pt: Codifica o :term:`objeto do tipo bytes <bytes-like object>` *b* utilizando base85 (como utilizado, por exemplo, em diffs binários ao estilo do git) e devolve os :class:`bytes` codificados.

source: If *pad* is true, the input is padded with ``b'\0'`` so its length is a multiple of 4 bytes before encoding.
pt_pt: Se *pad* for verdadeiro, a entrada é preenchida com ``b'\0'`` para que o seu comprimento seja um múltiplo de 4 bytes antes da codificação.

source: Decode the base85-encoded :term:`bytes-like object` or ASCII string *b* and return the decoded :class:`bytes`. Padding is implicitly removed, if necessary.
pt_pt: Descodifica o :term:`objeto do tipo bytes <bytes-like object>` ou string ASCII *b* codificado em base85 e devolve os :class:`bytes` descodificados. O preenchimento é removido implicitamente, se necessário.

source: Encode the :term:`bytes-like object` *s* using Z85 (as used in ZeroMQ) and return the encoded :class:`bytes`. See `Z85 specification <https://rfc.zeromq.org/spec/32/>`_ for more information.
pt_pt: Codifica o :term:`objeto do tipo bytes <bytes-like object>` *s* utilizando Z85 (como utilizado no ZeroMQ) e devolve os :class:`bytes` codificados. Consulte a `especificação Z85 <https://rfc.zeromq.org/spec/32/>`_ para mais informação.

source: Decode the Z85-encoded :term:`bytes-like object` or ASCII string *s* and return the decoded :class:`bytes`. See `Z85 specification <https://rfc.zeromq.org/spec/32/>`_ for more information.
pt_pt: Descodifica o :term:`objeto do tipo bytes <bytes-like object>` ou string ASCII *s* codificado em Z85 e devolve os :class:`bytes` descodificados. Consulte a `especificação Z85 <https://rfc.zeromq.org/spec/32/>`_ para mais informação.

source: Legacy Interface
pt_pt: Interface Legada

source: Decode the contents of the binary *input* file and write the resulting binary data to the *output* file. *input* and *output* must be :term:`file objects <file object>`. *input* will be read until ``input.readline()`` returns an empty bytes object.
pt_pt: Descodifica o conteúdo do ficheiro binário *input* e escreve os dados binários resultantes no ficheiro *output*. *input* e *output* devem ser :term:`objetos de ficheiro <file object>`. O *input* será lido até que ``input.readline()`` devolva um objeto de bytes vazio.

source: Decode the :term:`bytes-like object` *s*, which must contain one or more lines of base64 encoded data, and return the decoded :class:`bytes`.
pt_pt: Descodifica o :term:`objeto do tipo bytes <bytes-like object>` *s*, que deve conter uma ou mais linhas de dados codificados em base64, e devolve os :class:`bytes` descodificados.

source: Encode the contents of the binary *input* file and write the resulting base64 encoded data to the *output* file. *input* and *output* must be :term:`file objects <file object>`. *input* will be read until ``input.read()`` returns an empty bytes object. :func:`encode` inserts a newline character (``b'\n'``) after every 76 bytes of the output, as well as ensuring that the output always ends with a newline, as per :rfc:`2045` (MIME).
pt_pt: Codifica o conteúdo do ficheiro binário *input* e escreve os dados resultantes codificados em base64 no ficheiro *output*. *input* e *output* devem ser :term:`objetos de ficheiro <file object>`. O *input* será lido até que ``input.read()`` devolva um objeto de bytes vazio. :func:`encode` insere um caractere de quebra de linha (``b'\n'``) a cada 76 bytes de saída, garantindo também que a saída termina sempre com uma quebra de linha, conforme o :rfc:`2045` (MIME).

source: Encode the :term:`bytes-like object` *s*, which can contain arbitrary binary data, and return :class:`bytes` containing the base64-encoded data, with newlines (``b'\n'``) inserted after every 76 bytes of output, and ensuring that there is a trailing newline, as per :rfc:`2045` (MIME).
pt_pt: Codifica o :term:`objeto do tipo bytes <bytes-like object>` *s*, que pode conter dados binários arbitrários, e devolve os :class:`bytes` contendo os dados codificados em base64, com quebras de linha (``b'\n'``) inseridas a cada 76 bytes de saída, garantindo que existe uma quebra de linha final, conforme o :rfc:`2045` (MIME).

source: An example usage of the module:
pt_pt: Um exemplo de utilização do módulo:

source: Security Considerations
pt_pt: Considerações de Segurança

source: A new security considerations section was added to :rfc:`4648` (section 12); it's recommended to review the security section for any code deployed to production.
pt_pt: Uma nova secção de considerações de segurança foi adicionada ao :rfc:`4648` (secção 12); recomenda-se a revisão da secção de segurança para qualquer código implementado em produção.

source: Module :mod:`binascii`
pt_pt: Módulo :mod:`binascii`

source: Support module containing ASCII-to-binary and binary-to-ASCII conversions.
pt_pt: Módulo de suporte contendo conversões de ASCII para binário e de binário para ASCII.

source: :rfc:`1521` - MIME (Multipurpose Internet Mail Extensions) Part One: Mechanisms for Specifying and Describing the Format of Internet Message Bodies
pt_pt: :rfc:`1521` - MIME (Multipurpose Internet Mail Extensions) Parte Um: Mecanismos para Especificar e Descrever o Formato de Corpos de Mensagens de Internet

source: Section 5.2, "Base64 Content-Transfer-Encoding," provides the definition of the base64 encoding.
pt_pt: Secção 5.2, "Base64 Content-Transfer-Encoding," fornece a definição da codificação base64.

source: encoding
pt_pt: codificação

source: base64 encoding
pt_pt: codificação base64
