Repository: NyaPuma/python-docs-pt
Catalog: library/binascii.po
Languages: pt_pt

source: :mod:`!binascii` --- Convert between binary and ASCII
pt_pt: :mod:`!binascii` --- Conversão entre binário e ASCII

source: The :mod:`!binascii` module contains a number of methods to convert between binary and various ASCII-encoded binary representations. Normally, you will not use these functions directly but use wrapper modules like :mod:`base64` instead. The :mod:`!binascii` module contains low-level functions written in C for greater speed that are used by the higher-level modules.
pt_pt: O módulo :mod:`!binascii` contém uma série de métodos para converter entre binário e várias representações binárias codificadas em ASCII. Normalmente, não utilizará estas funções diretamente, mas sim módulos de interface (wrappers) como o :mod:`base64`. O módulo :mod:`!binascii` contém funções de baixo nível escritas em C para maior velocidade, que são utilizadas pelos módulos de nível superior.

source: ``a2b_*`` functions accept Unicode strings containing only ASCII characters. Other functions only accept :term:`bytes-like objects <bytes-like object>` (such as :class:`bytes`, :class:`bytearray` and other objects that support the buffer protocol).
pt_pt: As funções ``a2b_*`` aceitam strings Unicode contendo apenas caracteres ASCII. As outras funções aceitam apenas :term:`objetos do tipo bytes <bytes-like object>` (tais como :class:`bytes`, :class:`bytearray` e outros objetos que suportem o protocolo de buffer).

source: ASCII-only unicode strings are now accepted by the ``a2b_*`` functions.
pt_pt: As strings Unicode apenas ASCII são agora aceites pelas funções ``a2b_*``.

source: The :mod:`!binascii` module defines the following functions:
pt_pt: O módulo :mod:`!binascii` define as seguintes funções:

source: Convert a single line of uuencoded data back to binary and return the binary data. Lines normally contain 45 (binary) bytes, except for the last line. Line data may be followed by whitespace.
pt_pt: Converte uma única linha de dados codificados em uuencode de volta para binário e retorna os dados binários. As linhas contêm normalmente 45 bytes (binários), exceto a última linha. Os dados da linha podem ser seguidos por espaços em branco.

source: Convert binary data to a line of ASCII characters, the return value is the converted line, including a newline char. The length of *data* should be at most 45. If *backtick* is true, zeros are represented by ``'`'`` instead of spaces.
pt_pt: Converte dados binários para uma linha de caracteres ASCII; o valor de retorno é a linha convertida, incluindo um caractere de nova linha. O comprimento de *data* deve ser no máximo 45. Se *backtick* for verdadeiro, os zeros são representados por ``'`'`` em vez de espaços.

source: Added the *backtick* parameter.
pt_pt: Adicionado o parâmetro *backtick*.

source: Convert a block of base64 data back to binary and return the binary data. More than one line may be passed at a time.
pt_pt: Converte um bloco de dados base64 de volta para binário e retorna os dados binários. Pode ser passada mais do que uma linha de cada vez.

source: If *strict_mode* is true, only valid base64 data will be converted. Invalid base64 data will raise :exc:`binascii.Error`.
pt_pt: Se *strict_mode* for verdadeiro, apenas dados base64 válidos serão convertidos. Dados base64 inválidos lançarão :exc:`binascii.Error`.

source: Valid base64:
pt_pt: Base64 válido:

source: Conforms to :rfc:`3548`.
pt_pt: Está em conformidade com a :rfc:`3548`.

source: Contains only characters from the base64 alphabet.
pt_pt: Contém apenas caracteres do alfabeto base64.

source: Contains no excess data after padding (including excess padding, newlines, etc.).
pt_pt: Não contém dados em excesso após o preenchimento (incluindo preenchimento em excesso, novas linhas, etc.).

source: Does not start with a padding.
pt_pt: Não começa com um preenchimento (padding).

source: Added the *strict_mode* parameter.
pt_pt: Adicionado o parâmetro *strict_mode*.

source: Convert binary data to a line of ASCII characters in base64 coding. The return value is the converted line, including a newline char if *newline* is true. The output of this function conforms to :rfc:`3548`.
pt_pt: Converte dados binários para uma linha de caracteres ASCII em codificação base64. O valor de retorno é a linha convertida, incluindo um caractere de nova linha se *newline* for verdadeiro. A saída desta função está em conformidade com a :rfc:`3548`.

source: Added the *newline* parameter.
pt_pt: Adicionado o parâmetro *nova linha*.

source: Convert a block of quoted-printable data back to binary and return the binary data. More than one line may be passed at a time. If the optional argument *header* is present and true, underscores will be decoded as spaces.
pt_pt: Converte um bloco de dados em formato quoted-printable de volta para binário e retorna os dados binários. Pode ser passada mais do que uma linha de cada vez. Se o argumento opcional *header* estiver presente e for verdadeiro, os sublinhados serão descodificados como espaços.

source: Convert binary data to a line(s) of ASCII characters in quoted-printable encoding. The return value is the converted line(s). If the optional argument *quotetabs* is present and true, all tabs and spaces will be encoded. If the optional argument *istext* is present and true, newlines are not encoded but trailing whitespace will be encoded. If the optional argument *header* is present and true, spaces will be encoded as underscores per :rfc:`1522`. If the optional argument *header* is present and false, newline characters will be encoded as well; otherwise linefeed conversion might corrupt the binary data stream.
pt_pt: Converte dados binários em uma ou mais linhas de caracteres ASCII na codificação quoted-printable. O valor de retorno é a linha ou linhas convertidas. Se o argumento opcional *quotetabs* estiver presente e for verdadeiro, todas as tabulações e espaços serão codificados. Se o argumento opcional *istext* estiver presente e for verdadeiro, as novas linhas não serão codificadas, mas os espaços em branco à direita serão codificados. Se o argumento opcional *header* estiver presente e for verdadeiro, os espaços serão codificados como sublinhados, de acordo com :rfc:`1522`. Se o argumento opcional *header* estiver presente e for falso, os caracteres de nova linha também serão codificados; caso contrário, a conversão de avanço de linha poderá corromper o fluxo de dados binários.

source: Compute a 16-bit CRC value of *data*, starting with *value* as the initial CRC, and return the result. This uses the CRC-CCITT polynomial *x*:sup:`16` + *x*:sup:`12` + *x*:sup:`5` + 1, often represented as 0x1021. This CRC is used in the binhex4 format.
pt_pt: Calcula um valor CRC de 16 bits de *data*, começando com *value* como o CRC inicial, e retorna o resultado. Isto utiliza o polinómio CRC-CCITT *x*:sup:`16` + *x*:sup:`12` + *x*:sup:`5` + 1, frequentemente representado como 0x1021. Este CRC é utilizado no formato binhex4.

source: Compute CRC-32, the unsigned 32-bit checksum of *data*, starting with an initial CRC of *value*. The default initial CRC is zero. The algorithm is consistent with the ZIP file checksum. Since the algorithm is designed for use as a checksum algorithm, it is not suitable for use as a general hash algorithm. Use as follows::
pt_pt: Calcula o CRC-32, a soma de verificação (checksum) de 32 bits não assinada de *data*, começando com um CRC inicial de *value*. O CRC inicial padrão é zero. O algoritmo é consistente com a soma de verificação de ficheiros ZIP. Uma vez que o algoritmo foi desenhado para ser usado como soma de verificação, não é adequado para uso como um algoritmo de hash geral. Utilize da seguinte forma::

source: print(binascii.crc32(b"hello world")) # Or, in two pieces: crc = binascii.crc32(b"hello") crc = binascii.crc32(b" world", crc) print('crc32 = {:#010x}'.format(crc))
pt_pt: print(binascii.crc32(b"hello world")) # Ou, em duas partes: crc = binascii.crc32(b"hello") crc = binascii.crc32(b" world", crc) print('crc32 = {:#010x}'.format(crc))

source: The result is always unsigned.
pt_pt: O resultado é sempre não assinado.

source: Return the hexadecimal representation of the binary *data*. Every byte of *data* is converted into the corresponding 2-digit hex representation. The returned bytes object is therefore twice as long as the length of *data*.
pt_pt: Retorna a representação hexadecimal dos dados binários *data*. Cada byte de *data* é convertido na representação hexadecimal correspondente de 2 dígitos. O objeto de bytes retornado tem, portanto, o dobro do comprimento de *data*.

source: Similar functionality (but returning a text string) is also conveniently accessible using the :meth:`bytes.hex` method.
pt_pt: Funcionalidade semelhante (mas retornando uma string de texto) está também acessível de forma conveniente através do método :meth:`bytes.hex`.

source: If *sep* is specified, it must be a single character str or bytes object. It will be inserted in the output after every *bytes_per_sep* input bytes. Separator placement is counted from the right end of the output by default, if you wish to count from the left, supply a negative *bytes_per_sep* value.
pt_pt: Se *sep* for especificado, deve ser uma string de um único caractere ou um objeto de bytes. Será inserido na saída após cada *bytes_per_sep* bytes de entrada. A colocação do separador é contada a partir da extremidade direita da saída por defeito; se desejar contar a partir da esquerda, forneça um valor negativo para *bytes_per_sep*.

source: The *sep* and *bytes_per_sep* parameters were added.
pt_pt: Os parâmetros *sep* e *bytes_per_sep* foram adicionados.

source: Return the binary data represented by the hexadecimal string *hexstr*. This function is the inverse of :func:`b2a_hex`. *hexstr* must contain an even number of hexadecimal digits (which can be upper or lower case), otherwise an :exc:`Error` exception is raised.
pt_pt: Retorna os dados binários representados pela string hexadecimal *hexstr*. Esta função é o inverso de :func:`b2a_hex`. *hexstr* deve conter um número par de dígitos hexadecimais (que podem ser maiúsculas ou minúsculas), caso contrário, é lançada uma exceção :exc:`Error`.

source: Similar functionality (accepting only text string arguments, but more liberal towards whitespace) is also accessible using the :meth:`bytes.fromhex` class method.
pt_pt: Funcionalidade semelhante (aceitando apenas argumentos de string de texto, mas mais liberal em relação a espaços em branco) está também acessível através do método de classe :meth:`bytes.fromhex`.

source: Exception raised on errors. These are usually programming errors.
pt_pt: Exceção lançada em caso de erros. Estes são normalmente erros de programação.

source: Exception raised on incomplete data. These are usually not programming errors, but may be handled by reading a little more data and trying again.
pt_pt: Exceção lançada em caso de dados incompletos. Estes normalmente não são erros de programação, mas podem ser resolvidos lendo um pouco mais de dados e tentando novamente.

source: Module :mod:`base64`
pt_pt: Módulo :mod:`base64`

source: Support for RFC compliant base64-style encoding in base 16, 32, 64, and 85.
pt_pt: Suporte para codificação estilo base64 em conformidade com as RFC nas bases 16, 32, 64 e 85.

source: Module :mod:`quopri`
pt_pt: Módulo :mod:`quopri`

source: Support for quoted-printable encoding used in MIME email messages.
pt_pt: Suporte para codificação quoted-printable utilizada em mensagens de email MIME.

source: module
pt_pt: módulo
