Repository: NyaPuma/python-docs-pt
Catalog: library/bz2.po
Languages: pt_pt

source: :mod:`!bz2` --- Support for :program:`bzip2` compression
pt_pt: :mod:`!bz2` --- Suporte para compressão :program:`bzip2`

source: **Source code:** :source:`Lib/bz2.py`
pt_pt: **Código-fonte:** :source:`Lib/bz2.py`

source: This module provides a comprehensive interface for compressing and decompressing data using the bzip2 compression algorithm.
pt_pt: Este módulo fornece uma interface abrangente para comprimir e descomprimir dados utilizando o algoritmo de compressão bzip2.

source: The :mod:`bz2` module contains:
pt_pt: O módulo :mod:`bz2` contém:

source: The :func:`.open` function and :class:`BZ2File` class for reading and writing compressed files.
pt_pt: A função :func:`.open` e a classe :class:`BZ2File` para ler e escrever ficheiros comprimidos.

source: The :class:`BZ2Compressor` and :class:`BZ2Decompressor` classes for incremental (de)compression.
pt_pt: As classes :class:`BZ2Compressor` e :class:`BZ2Decompressor` para (des)compressão incremental.

source: The :func:`compress` and :func:`decompress` functions for one-shot (de)compression.
pt_pt: As funções :func:`compress` e :func:`decompress` para compressão/descompressão de passo único.

source: This is an :term:`optional module`. If it is missing from your copy of CPython, look for documentation from your distributor (that is, whoever provided Python to you). If you are the distributor, see :ref:`optional-module-requirements`.
pt_pt: Este é um :term:`módulo opcional`. Se estiver em falta na sua cópia do CPython, procure documentação junto do seu distribuidor (ou seja, quem lhe forneceu o Python). Se for o distribuidor, veja :ref:`optional-module-requirements`.

source: (De)compression of files
pt_pt: (Des)compressão de ficheiros

source: Open a bzip2-compressed file in binary or text mode, returning a :term:`file object`.
pt_pt: Abre um ficheiro comprimido com bzip2 em modo binário ou de texto, devolvendo um :term:`objeto de ficheiro`.

source: As with the constructor for :class:`BZ2File`, the *filename* argument can be an actual filename (a :class:`str` or :class:`bytes` object), or an existing file object to read from or write to.
pt_pt: Tal como no construtor de :class:`BZ2File`, o argumento *filename* pode ser um nome de ficheiro real (um objeto :class:`str` ou :class:`bytes`), ou um objeto de ficheiro existente para leitura ou escrita.

source: The *mode* argument can be any of ``'r'``, ``'rb'``, ``'w'``, ``'wb'``, ``'x'``, ``'xb'``, ``'a'`` or ``'ab'`` for binary mode, or ``'rt'``, ``'wt'``, ``'xt'``, or ``'at'`` for text mode. The default is ``'rb'``.
pt_pt: O argumento *mode* pode ser qualquer um de ``'r'``, ``'rb'``, ``'w'``, ``'wb'``, ``'x'``, ``'xb'``, ``'a'`` ou ``'ab'`` para modo binário, ou ``'rt'``, ``'wt'``, ``'xt'``, ou ``'at'`` para modo de texto. O padrão é ``'rb'``.

source: The *compresslevel* argument is an integer from 1 to 9, as for the :class:`BZ2File` constructor.
pt_pt: O argumento *compresslevel* é um número inteiro de 1 a 9, tal como no construtor de :class:`BZ2File`.

source: For binary mode, this function is equivalent to the :class:`BZ2File` constructor: ``BZ2File(filename, mode, compresslevel=compresslevel)``. In this case, the *encoding*, *errors* and *newline* arguments must not be provided.
pt_pt: Para o modo binário, esta função é equivalente ao construtor :class:`BZ2File`: ``BZ2File(filename, mode, compresslevel=compresslevel)``. Neste caso, os argumentos *encoding*, *errors* e *newline* não devem ser fornecidos.

source: For text mode, a :class:`BZ2File` object is created, and wrapped in an :class:`io.TextIOWrapper` instance with the specified encoding, error handling behavior, and line ending(s).
pt_pt: Para o modo de texto, é criado um objeto :class:`BZ2File`, que é envolvido numa instância de :class:`io.TextIOWrapper` com a codificação, comportamento de gestão de erros e fim(ns) de linha especificados.

source: The ``'x'`` (exclusive creation) mode was added.
pt_pt: Foi adicionado o modo ``'x'`` (criação exclusiva).

source: Accepts a :term:`path-like object`.
pt_pt: Aceita um :term:`objeto semelhante a um caminho`.

source: Open a bzip2-compressed file in binary mode.
pt_pt: Abre um ficheiro comprimido com bzip2 em modo binário.

source: If *filename* is a :class:`str` or :class:`bytes` object, open the named file directly. Otherwise, *filename* should be a :term:`file object`, which will be used to read or write the compressed data.
pt_pt: Se *filename* for um objeto :class:`str` ou :class:`bytes`, abre o ficheiro nomeado diretamente. Caso contrário, *filename* deve ser um :term:`objeto de ficheiro`, que será utilizado para ler ou escrever os dados comprimidos.

source: The *mode* argument can be either ``'r'`` for reading (default), ``'w'`` for overwriting, ``'x'`` for exclusive creation, or ``'a'`` for appending. These can equivalently be given as ``'rb'``, ``'wb'``, ``'xb'`` and ``'ab'`` respectively.
pt_pt: O argumento *mode* pode ser ``'r'`` para leitura (padrão), ``'w'`` para sobreposição, ``'x'`` para criação exclusiva, ou ``'a'`` para anexação. Estes podem ser dados equivalentemente como ``'rb'``, ``'wb'``, ``'xb'`` e ``'ab'`` respetivamente.

source: If *filename* is a file object (rather than an actual file name), a mode of ``'w'`` does not truncate the file, and is instead equivalent to ``'a'``.
pt_pt: Se *filename* for um objeto de ficheiro (em vez de um nome de ficheiro real), um modo de ``'w'`` não trunca o ficheiro, sendo antes equivalente a ``'a'``.

source: If *mode* is ``'w'`` or ``'a'``, *compresslevel* can be an integer between ``1`` and ``9`` specifying the level of compression: ``1`` produces the least compression, and ``9`` (default) produces the most compression.
pt_pt: Se *mode* for ``'w'`` ou ``'a'``, *compresslevel* pode ser um número inteiro entre ``1`` e ``9`` especificando o nível de compressão: ``1`` produz a menor compressão, e ``9`` (padrão) produz a maior compressão.

source: If *mode* is ``'r'``, the input file may be the concatenation of multiple compressed streams.
pt_pt: Se *mode* for ``'r'``, o ficheiro de entrada pode ser a concatenação de múltiplos fluxos (streams) comprimidos.

source: :class:`BZ2File` provides all of the members specified by the :class:`io.BufferedIOBase`, except for :meth:`~io.BufferedIOBase.detach` and :meth:`~io.IOBase.truncate`. Iteration and the :keyword:`with` statement are supported.
pt_pt: :class:`BZ2File` fornece todos os membros especificados por :class:`io.BufferedIOBase`, exceto :meth:`~io.BufferedIOBase.detach` e :meth:`~io.IOBase.truncate`. A iteração e a instrução :keyword:`with` são suportadas.

source: :class:`BZ2File` also provides the following methods and attributes:
pt_pt: :class:`BZ2File` também fornece os seguintes métodos e atributos:

source: Return buffered data without advancing the file position. At least one byte of data will be returned (unless at EOF). The exact number of bytes returned is unspecified.
pt_pt: Devolve dados em buffer sem avançar a posição do ficheiro. Pelo menos um byte de dados será devolvido (a menos que esteja no EOF). O número exato de bytes devolvidos não é especificado.

source: While calling :meth:`peek` does not change the file position of the :class:`BZ2File`, it may change the position of the underlying file object (e.g. if the :class:`BZ2File` was constructed by passing a file object for *filename*).
pt_pt: Embora a chamada a :meth:`peek` não altere a posição do ficheiro do :class:`BZ2File`, esta pode alterar a posição do objeto de ficheiro subjacente (ex: se o :class:`BZ2File` foi construído passando um objeto de ficheiro para *filename*).

source: Return the file descriptor for the underlying file.
pt_pt: Devolve o descritor de ficheiro para o ficheiro subjacente.

source: Return whether the file was opened for reading.
pt_pt: Devolve se o ficheiro foi aberto para leitura.

source: Return whether the file supports seeking.
pt_pt: Devolve se o ficheiro suporta posicionamento (seeking).

source: Return whether the file was opened for writing.
pt_pt: Devolve se o ficheiro foi aberto para escrita.

source: Read up to *size* uncompressed bytes, while trying to avoid making multiple reads from the underlying stream. Reads up to a buffer's worth of data if size is negative.
pt_pt: Lê até *size* bytes descomprimidos, tentando evitar fazer múltiplas leituras do fluxo subjacente. Lê até ao tamanho de um buffer de dados se o tamanho for negativo.

source: Returns ``b''`` if the file is at EOF.
pt_pt: Devolve ``b''`` se o ficheiro estiver no fim (EOF).

source: Read bytes into *b*.
pt_pt: Lê bytes para *b*.

source: Returns the number of bytes read (0 for EOF).
pt_pt: Devolve o número de bytes lidos (0 para EOF).

source: ``'rb'`` for reading and ``'wb'`` for writing.
pt_pt: ``'rb'`` para leitura e ``'wb'`` para escrita.

source: The bzip2 file name. Equivalent to the :attr:`~io.FileIO.name` attribute of the underlying :term:`file object`.
pt_pt: O nome do ficheiro bzip2. Equivalente ao atributo :attr:`~io.FileIO.name` do :term:`objeto de ficheiro` subjacente.

source: Support for the :keyword:`with` statement was added.
pt_pt: Foi adicionado suporte para a instrução :keyword:`with`.

source: Support was added for *filename* being a :term:`file object` instead of an actual filename.
pt_pt: Foi adicionado suporte para *filename* ser um :term:`objeto de ficheiro` em vez de um nome de ficheiro real.

source: The ``'a'`` (append) mode was added, along with support for reading multi-stream files.
pt_pt: Foi adicionado o modo ``'a'`` (anexar), juntamente com o suporte para leitura de ficheiros multi-fluxo (multi-stream).

source: The :meth:`~io.BufferedIOBase.read` method now accepts an argument of ``None``.
pt_pt: O método :meth:`~io.BufferedIOBase.read` agora aceita um argumento de ``None``.

source: The *buffering* parameter has been removed. It was ignored and deprecated since Python 3.0. Pass an open file object to control how the file is opened.
pt_pt: O parâmetro *buffering* foi removido. Foi ignorado e descontinuado desde o Python 3.0. Passe um objeto de ficheiro aberto para controlar como o ficheiro é aberto.

source: The *compresslevel* parameter became keyword-only.
pt_pt: O parâmetro *compresslevel* tornou-se apenas de palavra-chave (keyword-only).

source: This class is thread unsafe in the face of multiple simultaneous readers or writers, just like its equivalent classes in :mod:`gzip` and :mod:`lzma` have always been.
pt_pt: Esta classe não é segura para threads (thread unsafe) no caso de múltiplos leitores ou escritores simultâneos, tal como as suas classes equivalentes em :mod:`gzip` e :mod:`lzma` sempre foram.

source: Incremental (de)compression
pt_pt: (Des)compressão incremental

source: Create a new compressor object. This object may be used to compress data incrementally. For one-shot compression, use the :func:`compress` function instead.
pt_pt: Cria um novo objeto compressor. Este objeto pode ser utilizado para comprimir dados de forma incremental. Para compressão de passo único, utilize a função :func:`compress`.

source: *compresslevel*, if given, must be an integer between ``1`` and ``9``. The default is ``9``.
pt_pt: *compresslevel*, se fornecido, deve ser um número inteiro entre ``1`` e ``9``. O padrão é ``9``.

source: Provide data to the compressor object. Returns a chunk of compressed data if possible, or an empty byte string otherwise.
pt_pt: Fornece dados ao objeto compressor. Devolve um bloco de dados comprimidos se possível, ou uma string de bytes vazia caso contrário.

source: When you have finished providing data to the compressor, call the :meth:`flush` method to finish the compression process.
pt_pt: Quando terminar de fornecer dados ao compressor, chame o método :meth:`flush` para terminar o processo de compressão.

source: Finish the compression process. Returns the compressed data left in internal buffers.
pt_pt: Termina o processo de compressão. Devolve os dados comprimidos que restam nos buffers internos.

source: The compressor object may not be used after this method has been called.
pt_pt: O objeto compressor não pode ser utilizado após este método ter sido chamado.

source: Create a new decompressor object. This object may be used to decompress data incrementally. For one-shot compression, use the :func:`decompress` function instead.
pt_pt: Cria um novo objeto descompressor. Este objeto pode ser utilizado para descomprimir dados de forma incremental. Para descompressão de passo único, utilize a função :func:`decompress`.

source: This class does not transparently handle inputs containing multiple compressed streams, unlike :func:`decompress` and :class:`BZ2File`. If you need to decompress a multi-stream input with :class:`BZ2Decompressor`, you must use a new decompressor for each stream.
pt_pt: Esta classe não gere de forma transparente entradas que contenham múltiplos fluxos comprimidos, ao contrário de :func:`decompress` e :class:`BZ2File`. Se precisar de descomprimir uma entrada multi-fluxo com :class:`BZ2Decompressor`, deve utilizar um novo descompressor para cada fluxo.

source: Decompress *data* (a :term:`bytes-like object`), returning uncompressed data as bytes. Some of *data* may be buffered internally, for use in later calls to :meth:`decompress`. The returned data should be concatenated with the output of any previous calls to :meth:`decompress`.
pt_pt: Descomprime *data* (um objeto :term:`semelhante a bytes`), devolvendo dados descomprimidos como bytes. Alguns dos *data* podem ser armazenados em buffer internamente, para uso em chamadas posteriores a :meth:`decompress`. Os dados devolvidos devem ser concatenados com a saída de quaisquer chamadas anteriores a :meth:`decompress`.

source: If *max_length* is nonnegative, returns at most *max_length* bytes of decompressed data. If this limit is reached and further output can be produced, the :attr:`~.needs_input` attribute will be set to ``False``. In this case, the next call to :meth:`~.decompress` may provide *data* as ``b''`` to obtain more of the output.
pt_pt: Se *max_length* for não negativo, devolve no máximo *max_length* bytes de dados descomprimidos. Se este limite for atingido e mais saída puder ser produzida, o atributo :attr:`~.needs_input` será definido como ``False``. Neste caso, a próxima chamada a :meth:`~.decompress` pode fornecer *data* como ``b''`` para obter mais saída.

source: If all of the input data was decompressed and returned (either because this was less than *max_length* bytes, or because *max_length* was negative), the :attr:`~.needs_input` attribute will be set to ``True``.
pt_pt: Se todos os dados de entrada tiverem sido descomprimidos e devolvidos (seja porque eram menos do que *max_length* bytes, ou porque *max_length* era negativo), o atributo :attr:`~.needs_input` será definido como ``True``.

source: Attempting to decompress data after the end of stream is reached raises an :exc:`EOFError`. Any data found after the end of the stream is ignored and saved in the :attr:`~.unused_data` attribute.
pt_pt: Tentar descomprimir dados após o final do fluxo ser atingido lança uma :exc:`EOFError`. Quaisquer dados encontrados após o final do fluxo são ignorados e guardados no atributo :attr:`~.unused_data`.

source: Added the *max_length* parameter.
pt_pt: Adicionado o parâmetro *max_length*.

source: ``True`` if the end-of-stream marker has been reached.
pt_pt: ``True`` se o marcador de fim de fluxo tiver sido atingido.

source: Data found after the end of the compressed stream.
pt_pt: Dados encontrados após o final do fluxo comprimido.

source: If this attribute is accessed before the end of the stream has been reached, its value will be ``b''``.
pt_pt: Se este atributo for acedido antes do final do fluxo ter sido atingido, o seu valor será ``b''``.

source: ``False`` if the :meth:`.decompress` method can provide more decompressed data before requiring new uncompressed input.
pt_pt: ``False`` se o método :meth:`.decompress` puder fornecer mais dados descomprimidos antes de necessitar de nova entrada não comprimida.

source: One-shot (de)compression
pt_pt: Compressão/Descompressão de passo único

source: Compress *data*, a :term:`bytes-like object <bytes-like object>`.
pt_pt: Comprime *data*, um objeto :term:`semelhante a bytes <bytes-like object>`.

source: For incremental compression, use a :class:`BZ2Compressor` instead.
pt_pt: Para compressão incremental, utilize um :class:`BZ2Compressor` em vez disso.

source: Decompress *data*, a :term:`bytes-like object <bytes-like object>`.
pt_pt: Descomprime *data*, um objeto :term:`semelhante a bytes <bytes-like object>`.

source: If *data* is the concatenation of multiple compressed streams, decompress all of the streams.
pt_pt: Se *data* for a concatenação de múltiplos fluxos comprimidos, descomprime todos os fluxos.

source: For incremental decompression, use a :class:`BZ2Decompressor` instead.
pt_pt: Para descompressão incremental, utilize um :class:`BZ2Decompressor` em vez disso.

source: Support for multi-stream inputs was added.
pt_pt: Foi adicionado suporte para entradas multi-fluxo.

source: Examples of usage
pt_pt: Exemplos de utilização

source: Below are some examples of typical usage of the :mod:`bz2` module.
pt_pt: Abaixo estão alguns exemplos de utilização típica do módulo :mod:`bz2`.

source: Using :func:`compress` and :func:`decompress` to demonstrate round-trip compression:
pt_pt: Utilizar :func:`compress` e :func:`decompress` para demonstrar a compressão de ida e volta (round-trip):

source: Using :class:`BZ2Compressor` for incremental compression:
pt_pt: Utilizar :class:`BZ2Compressor` para compressão incremental:

source: The example above uses a very "nonrandom" stream of data (a stream of ``b"z"`` chunks). Random data tends to compress poorly, while ordered, repetitive data usually yields a high compression ratio.
pt_pt: O exemplo acima utiliza um fluxo de dados muito "não aleatório" (um fluxo de blocos ``b"z"``). Dados aleatórios tendem a comprimir mal, enquanto dados ordenados e repetitivos produzem geralmente um rácio de compressão elevado.

source: Writing and reading a bzip2-compressed file in binary mode:
pt_pt: Escrever e ler um ficheiro comprimido com bzip2 em modo binário:
