Repository: NyaPuma/python-docs-pt
Catalog: library/code.po
Languages: pt_pt

source: :mod:`!code` --- Interpreter base classes
pt_pt: :mod:`!code` --- Classes base do interpretador

source: **Source code:** :source:`Lib/code.py`
pt_pt: **Código fonte:** :source:`Lib/code.py`

source: The ``code`` module provides facilities to implement read-eval-print loops in Python. Two classes and convenience functions are included which can be used to build applications which provide an interactive interpreter prompt.
pt_pt: O módulo ``code`` fornece recursos para implementar loops de leitura-avaliação-impressão em Python. Estão incluídas duas classes e funções convenientes que podem ser usadas para criar aplicações que fornecem um prompt de interpretador interativo.

source: This class deals with parsing and interpreter state (the user's namespace); it does not deal with input buffering or prompting or input file naming (the filename is always passed in explicitly). The optional *locals* argument specifies a mapping to use as the namespace in which code will be executed; it defaults to a newly created dictionary with key ``'__name__'`` set to ``'__console__'`` and key ``'__doc__'`` set to ``None``.
pt_pt: Esta classe lida com a análise e o estado do interpretador (o namespace do utilizador); não lida com o buffer de entrada, prompts ou nomenclatura de ficheiros de entrada (o nome do ficheiro é sempre passado explicitamente). O argumento opcional *locals* especifica um mapeamento a ser usado como o namespace no qual o código será executado; o padrão é um dicionário recém-criado com a chave ``'__name__'`` definida como ``'__console__'`` e a chave ``'__doc__'`` definida como ``None``.

source: Note that functions and classes objects created under an :class:`!InteractiveInterpreter` instance will belong to the namespace specified by *locals*. They are only pickleable if *locals* is the namespace of an existing module.
pt_pt: Observe que os objetos de funções e classes criados sob uma instância :class:`!InteractiveInterpreter` pertencerão ao namespace especificado por *locals*. Eles só são pickleable se *locals* for o namespace de um módulo existente.

source: Closely emulate the behavior of the interactive Python interpreter. This class builds on :class:`InteractiveInterpreter` and adds prompting using the familiar ``sys.ps1`` and ``sys.ps2``, and input buffering. If *local_exit* is true, ``exit()`` and ``quit()`` in the console will not raise :exc:`SystemExit`, but instead return to the calling code.
pt_pt: Emula de perto o comportamento do interpretador Python interativo. Esta classe baseia-se em :class:`InteractiveInterpreter` e adiciona prompts usando os familiares ``sys.ps1`` e ``sys.ps2``, além de buffer de entrada. Se *local_exit* for verdadeiro, ``exit()`` e ``quit()`` no console não irão levantar :exc:`SystemExit`, mas sim retornar ao código de chamada.

source: Added *local_exit* parameter.
pt_pt: Adicionado o parâmetro *local_exit*.

source: Convenience function to run a read-eval-print loop. This creates a new instance of :class:`InteractiveConsole` and sets *readfunc* to be used as the :meth:`InteractiveConsole.raw_input` method, if provided. If *local* is provided, it is passed to the :class:`InteractiveConsole` constructor for use as the default namespace for the interpreter loop. If *local_exit* is provided, it is passed to the :class:`InteractiveConsole` constructor. The :meth:`~InteractiveConsole.interact` method of the instance is then run with *banner* and *exitmsg* passed as the banner and exit message to use, if provided. The console object is discarded after use.
pt_pt: Função conveniente para executar um ciclo de leitura-avaliação-impressão. Isso cria uma nova instância de :class:`InteractiveConsole` e define *readfunc* para ser usado como o método :meth:`InteractiveConsole.raw_input`, se fornecido. Se *local* for fornecido, ele será passado para o construtor :class:`InteractiveConsole` para ser usado como o namespace padrão para o ciclo do interpretador. Se *local_exit* for fornecido, ele é passado para o construtor :class:`InteractiveConsole`. O método :meth:`~InteractiveConsole.interact` da instância é então executado com *banner* e *exitmsg* passados como o banner e a mensagem de saída a serem usados, se fornecidos. O objeto console é descartado após o uso.

source: Added *exitmsg* parameter.
pt_pt: Adicionado o parâmetro *exitmsg*.

source: This function is useful for programs that want to emulate Python's interpreter main loop (a.k.a. the read-eval-print loop). The tricky part is to determine when the user has entered an incomplete command that can be completed by entering more text (as opposed to a complete command or a syntax error). This function *almost* always makes the same decision as the real interpreter main loop.
pt_pt: Esta função é útil para programas que desejam emular o loop principal do interpretador Python (também conhecido como loop read-eval-print). A parte complicada é determinar quando o utilizador inseriu um comando incompleto que pode ser completado com a inserção de mais texto (em oposição a um comando completo ou um erro de sintaxe). Esta função *quase* sempre toma a mesma decisão que o loop principal do interpretador real.

source: *source* is the source string; *filename* is the optional filename from which source was read, defaulting to ``'<input>'``; and *symbol* is the optional grammar start symbol, which should be ``'single'`` (the default), ``'eval'`` or ``'exec'``.
pt_pt: *source* é a string de origem; *filename* é o nome de ficheiro opcional a partir do qual a origem foi lida, com o padrão ``'<input>'``; e *symbol* é o símbolo de início de gramática opcional, que deve ser ``'single'`` (o padrão), ``'eval'`` ou ``'exec'``.

source: Returns a code object (the same as ``compile(source, filename, symbol)``) if the command is complete and valid; ``None`` if the command is incomplete; raises :exc:`SyntaxError` if the command is complete and contains a syntax error, or raises :exc:`OverflowError` or :exc:`ValueError` if the command contains an invalid literal.
pt_pt: Retorna um objeto de código (o mesmo que ``compile(source, filename, symbol)``) se o comando estiver completo e válido; ``None`` se o comando estiver incompleto; gera :exc:`SyntaxError` se o comando estiver completo e contiver um erro de sintaxe, ou gera :exc:`OverflowError` ou :exc:`ValueError` se o comando contiver um literal inválido.

source: Interactive Interpreter Objects
pt_pt: Objetos interpretadores interativos

source: Compile and run some source in the interpreter. Arguments are the same as for :func:`compile_command`; the default for *filename* is ``'<input>'``, and for *symbol* is ``'single'``. One of several things can happen:
pt_pt: Compile e execute algum código fonte no interpretador. Os argumentos são os mesmos que para :func:`compile_command`; o padrão para *filename* é ``'<input>'``, e para *symbol* é ``'single'``. Uma das seguintes coisas pode acontecer:

source: The input is incorrect; :func:`compile_command` raised an exception (:exc:`SyntaxError` or :exc:`OverflowError`). A syntax traceback will be printed by calling the :meth:`showsyntaxerror` method. :meth:`runsource` returns ``False``.
pt_pt: A entrada está incorreta; :func:`compile_command` levantou uma exceção (:exc:`SyntaxError` ou :exc:`OverflowError`). Um rastreamento de sintaxe será impresso chamando o método :meth:`showsyntaxerror`. :meth:`runsource` retorna ``False``.

source: The input is incomplete, and more input is required; :func:`compile_command` returned ``None``. :meth:`runsource` returns ``True``.
pt_pt: A entrada está incompleta e são necessárias mais informações; :func:`compile_command` retornou ``None``. :meth:`runsource` retorna ``True``.

source: The input is complete; :func:`compile_command` returned a code object. The code is executed by calling the :meth:`runcode` (which also handles run-time exceptions, except for :exc:`SystemExit`). :meth:`runsource` returns ``False``.
pt_pt: A entrada está completa; :func:`compile_command` retornou um objeto de código. O código é executado chamando :meth:`runcode` (que também lida com exceções de tempo de execução, exceto :exc:`SystemExit`). :meth:`runsource` retorna ``False``.

source: The return value can be used to decide whether to use ``sys.ps1`` or ``sys.ps2`` to prompt the next line.
pt_pt: O valor de retorno pode ser usado para decidir se deve usar ``sys.ps1`` ou ``sys.ps2`` para solicitar a próxima linha.

source: Execute a code object. When an exception occurs, :meth:`showtraceback` is called to display a traceback. All exceptions are caught except :exc:`SystemExit`, which is allowed to propagate.
pt_pt: Executa um objeto de código. Quando ocorre uma exceção, :meth:`showtraceback` é chamado para exibir um rastreamento. Todas as exceções são capturadas, exceto :exc:`SystemExit`, que pode ser propagada.

source: A note about :exc:`KeyboardInterrupt`: this exception may occur elsewhere in this code, and may not always be caught. The caller should be prepared to deal with it.
pt_pt: Uma observação sobre :exc:`KeyboardInterrupt`: esta exceção pode ocorrer em outras partes deste código e nem sempre pode ser capturada. O chamador deve estar preparado para lidar com ela.

source: Display the syntax error that just occurred. This does not display a stack trace because there isn't one for syntax errors. If *filename* is given, it is stuffed into the exception instead of the default filename provided by Python's parser, because it always uses ``'<string>'`` when reading from a string. The output is written by the :meth:`write` method.
pt_pt: Exibe o erro de sintaxe que acabou de ocorrer. Isto não exibe um rastreio da stack porque não existe um para erros de sintaxe. Se *filename* for fornecido, ele é inserido na exceção em vez do nome de ficheiro padrão fornecido pelo analisador do Python, porque ele sempre usa ``'<string>'`` ao ler a partir de uma string. A saída é escrita pelo método :meth:`write`.

source: Display the exception that just occurred. We remove the first stack item because it is within the interpreter object implementation. The output is written by the :meth:`write` method.
pt_pt: Exibe a exceção que acabou de ocorrer. Removemos o primeiro item da stack porque ele está dentro da implementação do objeto interpretador. A saída é escrita pelo método :meth:`write`.

source: The full chained traceback is displayed instead of just the primary traceback.
pt_pt: O rastreamento completo em cadeia é exibido em vez de apenas o rastreamento primário.

source: Write a string to the standard error stream (``sys.stderr``). Derived classes should override this to provide the appropriate output handling as needed.
pt_pt: Escreve uma string no fluxo de erro padrão (``sys.stderr``). As classes derivadas devem substituir isto para fornecer o tratamento de saída apropriado, conforme necessário.

source: Interactive Console Objects
pt_pt: Objetos da consola interativa

source: The :class:`InteractiveConsole` class is a subclass of :class:`InteractiveInterpreter`, and so offers all the methods of the interpreter objects as well as the following additions.
pt_pt: A classe :class:`InteractiveConsole` é uma subclasse de :class:`InteractiveInterpreter` e, portanto, oferece todos os métodos dos objetos interpretadores, bem como as seguintes adições.

source: Closely emulate the interactive Python console. The optional *banner* argument specify the banner to print before the first interaction; by default it prints a banner similar to the one printed by the standard Python interpreter, followed by the class name of the console object in parentheses (so as not to confuse this with the real interpreter -- since it's so close!).
pt_pt: Emula de perto a consola interativa do Python. O argumento opcional *banner* especifica o banner a ser impresso antes da primeira interação; por predefinição, imprime um banner semelhante ao impresso pelo interpretador padrão do Python, seguido do nome da classe do objeto da consola entre parênteses (para não confundir com o interpretador real, uma vez que é muito semelhante!).

source: The optional *exitmsg* argument specifies an exit message printed when exiting. Pass the empty string to suppress the exit message. If *exitmsg* is not given or ``None``, a default message is printed.
pt_pt: O argumento opcional *exitmsg* especifica uma mensagem de saída impressa ao sair. Passe a string vazia para suprimir a mensagem de saída. Se *exitmsg* não for fornecido ou for ``None``, uma mensagem padrão será impressa.

source: To suppress printing any banner, pass an empty string.
pt_pt: Para suprimir a impressão de qualquer banner, passe uma string vazia.

source: Print an exit message when exiting.
pt_pt: Imprimir uma mensagem de saída ao sair.

source: Push a line of source text to the interpreter. The line should not have a trailing newline; it may have internal newlines. The line is appended to a buffer and the interpreter's :meth:`~InteractiveInterpreter.runsource` method is called with the concatenated contents of the buffer as source. If this indicates that the command was executed or invalid, the buffer is reset; otherwise, the command is incomplete, and the buffer is left as it was after the line was appended. The return value is ``True`` if more input is required, ``False`` if the line was dealt with in some way (this is the same as :meth:`!runsource`).
pt_pt: Envia uma linha do texto fonte para o interpretador. A linha não deve ter uma nova linha no final; ela pode ter novas linhas internas. A linha é anexada a um buffer e o método :meth:`~InteractiveInterpreter.runsource` do interpretador é chamado com o conteúdo concatenado do buffer como fonte. Se isso indicar que o comando foi executado ou é inválido, o buffer é reiniciado; caso contrário, o comando está incompleto e o buffer permanece como estava após a linha ter sido anexada. O valor de retorno é ``True`` se for necessária mais entrada, ``False`` se a linha foi tratada de alguma forma (isso é o mesmo que :meth:`!runsource`).

source: Remove any unhandled source text from the input buffer.
pt_pt: Remove qualquer texto fonte não tratado do buffer de entrada.

source: Write a prompt and read a line. The returned line does not include the trailing newline. When the user enters the EOF key sequence, :exc:`EOFError` is raised. The base implementation reads from ``sys.stdin``; a subclass may replace this with a different implementation.
pt_pt: Escreva um prompt e leia uma linha. A linha retornada não inclui a nova linha final. Quando o utilizador introduz a sequência de teclas EOF, é gerado um :exc:`EOFError`. A implementação base lê a partir de ``sys.stdin``; uma subclasse pode substituir isto por uma implementação diferente.
