Repository: NyaPuma/python-docs-pt
Catalog: library/colorsys.po
Languages: pt_pt

source: :mod:`!colorsys` --- Conversions between color systems
pt_pt: :mod:`!colorsys` --- Conversões entre sistemas de cores

source: **Source code:** :source:`Lib/colorsys.py`
pt_pt: **Código fonte:** :source:`Lib/colorsys.py`

source: The :mod:`!colorsys` module defines bidirectional conversions of color values between colors expressed in the RGB (Red Green Blue) color space used in computer monitors and three other coordinate systems: YIQ, HLS (Hue Lightness Saturation) and HSV (Hue Saturation Value). Coordinates in all of these color spaces are floating-point values. In the YIQ space, the Y coordinate is between 0 and 1, but the I and Q coordinates can be positive or negative. In all other spaces, the coordinates are all between 0 and 1.
pt_pt: O módulo :mod:`!colorsys` define conversões bidirecionais de valores de cor entre cores expressas no espaço de cor RGB (vermelho, verde e azul) usado em monitores de computador e três outros sistemas de coordenadas: YIQ, HLS (matiz, luminosidade e saturação) e HSV (matiz, saturação e valor). As coordenadas em todos estes espaços de cor são valores de ponto flutuante. No espaço YIQ, a coordenada Y está entre 0 e 1, mas as coordenadas I e Q podem ser positivas ou negativas. Em todos os outros espaços, as coordenadas estão todas entre 0 e 1.

source: More information about color spaces can be found at https://poynton.ca/ColorFAQ.html and https://www.cambridgeincolour.com/tutorials/color-spaces.htm.
pt_pt: Mais informações sobre espaços de cor podem ser encontradas em https://poynton.ca/ColorFAQ.html e https://www.cambridgeincolour.com/tutorials/color-spaces.htm.

source: The :mod:`!colorsys` module defines the following functions:
pt_pt: O módulo :mod:`!colorsys` define as seguintes funções:

source: Convert the color from RGB coordinates to YIQ coordinates.
pt_pt: Converte a cor das coordenadas RGB para coordenadas YIQ.

source: Convert the color from YIQ coordinates to RGB coordinates.
pt_pt: Converte a cor das coordenadas YIQ para coordenadas RGB.

source: Convert the color from RGB coordinates to HLS coordinates.
pt_pt: Converte a cor das coordenadas RGB para coordenadas HLS.

source: Convert the color from HLS coordinates to RGB coordinates.
pt_pt: Converte a cor das coordenadas HLS para coordenadas RGB.

source: Convert the color from RGB coordinates to HSV coordinates.
pt_pt: Converte a cor das coordenadas RGB para coordenadas HSV.

source: Convert the color from HSV coordinates to RGB coordinates.
pt_pt: Converte a cor das coordenadas HSV para coordenadas RGB.

source: Example::
pt_pt: Exemplo::
