Repository: NyaPuma/python-docs-pt
Catalog: library/copyreg.po
Languages: pt_pt

source: :mod:`!copyreg` --- Register :mod:`!pickle` support functions
pt_pt: :mod:`!copyreg` --- Registar funções de suporte :mod:`!pickle`

source: **Source code:** :source:`Lib/copyreg.py`
pt_pt: **Código fonte:** :source:`Lib/copyreg.py`

source: The :mod:`!copyreg` module offers a way to define functions used while pickling specific objects. The :mod:`pickle` and :mod:`copy` modules use those functions when pickling/copying those objects. The module provides configuration information about object constructors which are not classes. Such constructors may be factory functions or class instances.
pt_pt: O módulo :mod:`!copyreg` oferece uma maneira de definir funções usadas durante a serialização de objetos específicos. Os módulos :mod:`pickle` e :mod:`copy` usam essas funções ao serializar/copiar esses objetos. O módulo fornece informações de configuração sobre construtores de objetos que não são classes. Esses construtores podem ser funções de fábrica ou instâncias de classe.

source: Declares *object* to be a valid constructor. If *object* is not callable (and hence not valid as a constructor), raises :exc:`TypeError`.
pt_pt: Declara *object* como um construtor válido. Se *object* não for invocável (e, portanto, não for válido como construtor), gera :exc:`TypeError`.

source: Declares that *function* should be used as a "reduction" function for objects of type *type*. *function* must return either a string or a tuple containing between two and six elements. See the :attr:`~pickle.Pickler.dispatch_table` for more details on the interface of *function*.
pt_pt: Declara que *função* deve ser usada como uma função de "redução" para objetos do tipo *tipo*. *função* deve retornar uma string ou um tuplo contendo entre dois e seis elementos. Consulte :attr:`~pickle.Pickler.dispatch_table` para obter mais detalhes sobre a interface de *função*.

source: The *constructor_ob* parameter is a legacy feature and is now ignored, but if passed it must be a callable.
pt_pt: O parâmetro *constructor_ob* é um recurso herdado e agora é ignorado, mas se for passado, deve ser um callable.

source: Note that the :attr:`~pickle.Pickler.dispatch_table` attribute of a pickler object or subclass of :class:`pickle.Pickler` can also be used for declaring reduction functions.
pt_pt: Observe que o atributo :attr:`~pickle.Pickler.dispatch_table` de um objeto pickler ou subclasse de :class:`pickle.Pickler` também pode ser usado para declarar funções de redução.

source: Example
pt_pt: Exemplo

source: The example below would like to show how to register a pickle function and how it will be used:
pt_pt: O exemplo abaixo mostra como registar uma função pickle e como ela será utilizada:

source: module
pt_pt: módulo
