Repository: NyaPuma/python-docs-pt
Catalog: library/curses.ascii.po
Languages: pt_pt

source: :mod:`!curses.ascii` --- Utilities for ASCII characters
pt_pt: :mod:`!curses.ascii` --- Utilitários para caracteres ASCII

source: **Source code:** :source:`Lib/curses/ascii.py`
pt_pt: **Código-fonte:** :source:`Lib/curses/ascii.py`

source: Name
pt_pt: Nome

source: Meaning
pt_pt: Significado

source: Start of heading, console interrupt
pt_pt: Início de cabeçalho, interrupção de consola

source: Start of text
pt_pt: Início de texto

source: End of text
pt_pt: Fim de texto

source: End of transmission
pt_pt: Fim de transmissão

source: Enquiry, goes with :const:`ACK` flow control
pt_pt: Inquérito, acompanha o controlo de fluxo :const:`ACK`

source: Acknowledgement
pt_pt: Confirmação (Acknowledgement)

source: Bell
pt_pt: Campainha (Bell)

source: Backspace
pt_pt: Retrocesso (Backspace)

source: Tab
pt_pt: Tabulação (Tab)

source: Alias for :const:`TAB`: "Horizontal tab"
pt_pt: Alias para :const:`TAB`: "Tabulação horizontal"

source: Line feed
pt_pt: Alimentação de linha (Line feed)

source: Alias for :const:`LF`: "New line"
pt_pt: Alias para :const:`LF`: "Nova linha"

source: Vertical tab
pt_pt: Tabulação vertical

source: Form feed
pt_pt: Alimentação de formulário (Form feed)

source: Carriage return
pt_pt: Retorno de carro (Carriage return)

source: Shift-out, begin alternate character set
pt_pt: Shift-out, iniciar conjunto de caracteres alternativo

source: Shift-in, resume default character set
pt_pt: Shift-in, retomar conjunto de caracteres padrão

source: Data-link escape
pt_pt: Escape de ligação de dados

source: XON, for flow control
pt_pt: XON, para controlo de fluxo

source: Device control 2, block-mode flow control
pt_pt: Controlo de dispositivo 2, controlo de fluxo em modo bloco

source: XOFF, for flow control
pt_pt: XOFF, para controlo de fluxo

source: Device control 4
pt_pt: Controlo de dispositivo 4

source: Negative acknowledgement
pt_pt: Confirmação negativa (Negative acknowledgement)

source: Synchronous idle
pt_pt: Inatividade síncrona

source: End transmission block
pt_pt: Fim de bloco de transmissão

source: Cancel
pt_pt: Cancelar

source: End of medium
pt_pt: Fim de suporte (End of medium)

source: Substitute
pt_pt: Substituto

source: File separator
pt_pt: Separador de ficheiros

source: Group separator
pt_pt: Separador de grupos

source: Record separator, block-mode terminator
pt_pt: Separador de registos, terminador de modo bloco

source: Unit separator
pt_pt: Separador de unidades

source: Space
pt_pt: Espaço

source: Delete
pt_pt: Apagar (Delete)

source: Note that many of these have little practical significance in modern usage. The mnemonics derive from teleprinter conventions that predate digital computers.
pt_pt: Note que muitos destes têm pouca relevância prática no uso moderno. As mnemónicas derivam de convenções de teleimpressoras que precedem os computadores digitais.

source: The module supplies the following functions, patterned on those in the standard C library:
pt_pt: O módulo fornece as seguintes funções, baseadas naquelas da biblioteca padrão C:

source: Checks for an ASCII alphanumeric character; it is equivalent to ``isalpha(c) or isdigit(c)``.
pt_pt: Verifica se é um carácter ASCII alfanumérico; é equivalente a ``isalpha(c) or isdigit(c)``.

source: Checks for an ASCII alphabetic character; it is equivalent to ``isupper(c) or islower(c)``.
pt_pt: Verifica se é um carácter ASCII alfabético; é equivalente a ``isupper(c) or islower(c)``.

source: Checks for a character value that fits in the 7-bit ASCII set.
pt_pt: Verifica se o valor de um carácter cabe no conjunto ASCII de 7 bits.

source: Checks for an ASCII whitespace character; space or horizontal tab.
pt_pt: Verifica se é um carácter de espaço em branco ASCII; espaço ou tabulação horizontal.

source: Checks for an ASCII control character (in the range 0x00 to 0x1f or 0x7f).
pt_pt: Verifica se é um carácter de controlo ASCII (no intervalo 0x00 a 0x1f ou 0x7f).

source: Checks for an ASCII decimal digit, ``'0'`` through ``'9'``. This is equivalent to ``c in string.digits``.
pt_pt: Verifica se é um dígito decimal ASCII, de ``'0'`` a ``'9'``. Isto é equivalente a ``c in string.digits``.

source: Checks for ASCII any printable character except space.
pt_pt: Verifica se é qualquer carácter ASCII imprimível, exceto o espaço.

source: Checks for an ASCII lower-case character.
pt_pt: Verifica se é um carácter ASCII minúsculo.

source: Checks for any ASCII printable character including space.
pt_pt: Verifica se é qualquer carácter ASCII imprimível, incluindo o espaço.

source: Checks for any printable ASCII character which is not a space or an alphanumeric character.
pt_pt: Verifica se é qualquer carácter ASCII imprimível que não seja um espaço ou um carácter alfanumérico.

source: Checks for ASCII white-space characters; space, line feed, carriage return, form feed, horizontal tab, vertical tab.
pt_pt: Verifica se são caracteres de espaço em branco ASCII; espaço, alimentação de linha, retorno de carro, alimentação de formulário, tabulação horizontal, tabulação vertical.

source: Checks for an ASCII uppercase letter.
pt_pt: Verifica se é uma letra ASCII maiúscula.

source: Checks for an ASCII hexadecimal digit. This is equivalent to ``c in string.hexdigits``.
pt_pt: Verifica se é um dígito hexadecimal ASCII. Isto é equivalente a ``c in string.hexdigits``.

source: Checks for an ASCII control character (ordinal values 0 to 31).
pt_pt: Verifica se é um carácter de controlo ASCII (valores ordinais de 0 a 31).

source: Checks for a non-ASCII character (ordinal values 0x80 and above).
pt_pt: Verifica se é um carácter não-ASCII (valores ordinais 0x80 e superiores).

source: These functions accept either integers or single-character strings; when the argument is a string, it is first converted using the built-in function :func:`ord`.
pt_pt: Estas funções aceitam inteiros ou strings de um único carácter; quando o argumento é uma string, é primeiro convertido usando a função integrada :func:`ord`.

source: Note that all these functions check ordinal bit values derived from the character of the string you pass in; they do not actually know anything about the host machine's character encoding.
pt_pt: Note que todas estas funções verificam valores de bits ordinais derivados do carácter da string que fornece; elas não sabem, na realidade, nada sobre a codificação de caracteres da máquina anfitriã.

source: The following two functions take either a single-character string or integer byte value; they return a value of the same type.
pt_pt: As duas funções seguintes aceitam uma string de carácter único ou um valor inteiro de byte; devolvem um valor do mesmo tipo.

source: Return the ASCII value corresponding to the low 7 bits of *c*.
pt_pt: Devolve o valor ASCII correspondente aos 7 bits inferiores de *c*.

source: Return the control character corresponding to the given character (the character bit value is bitwise-anded with 0x1f).
pt_pt: Devolve o carácter de controlo correspondente ao carácter fornecido (o valor de bits do carácter sofre uma operação AND bit-a-bit com 0x1f).

source: Return the 8-bit character corresponding to the given ASCII character (the character bit value is bitwise-ored with 0x80).
pt_pt: Devolve o carácter de 8 bits correspondente ao carácter ASCII fornecido (o valor de bits do carácter sofre uma operação OR bit-a-bit com 0x80).

source: Return a string representation of the ASCII character *c*. If *c* is printable, this string is the character itself. If the character is a control character (0x00--0x1f) the string consists of a caret (``'^'``) followed by the corresponding uppercase letter. If the character is an ASCII delete (0x7f) the string is ``'^?'``. If the character has its meta bit (0x80) set, the meta bit is stripped, the preceding rules applied, and ``'!'`` prepended to the result.
pt_pt: Devolve uma representação em string do carácter ASCII *c*. Se *c* for imprimível, esta string é o próprio carácter. Se o carácter for um carácter de controlo (0x00--0x1f), a string consiste num acento circunflexo (``'^'``) seguido da letra maiúscula correspondente. Se o carácter for um delete ASCII (0x7f), a string é ``'^?'``. Se o carácter tiver o seu bit meta (0x80) definido, o bit meta é removido, aplicam-se as regras anteriores e é prefixado um ``'!'`` ao resultado.

source: A 33-element string array that contains the ASCII mnemonics for the thirty-two ASCII control characters from 0 (NUL) to 0x1f (US), in order, plus the mnemonic ``SP`` for the space character.
pt_pt: Um array de strings de 33 elementos que contém as mnemónicas ASCII para os trinta e dois caracteres de controlo ASCII de 0 (NUL) a 0x1f (US), por ordem, mais a mnemónica ``SP`` para o carácter de espaço.

source: ^ (caret)
pt_pt: ^ (acento circunflexo)

source: in curses module
pt_pt: no módulo curses

source: ! (exclamation)
pt_pt: ! (ponto de exclamação)
