Repository: NyaPuma/python-docs-pt
Catalog: library/dialog.po
Languages: pt_pt

source: Tkinter Dialogs
pt_pt: Caixas de Diálogo Tkinter

source: :mod:`tkinter.simpledialog` --- Standard Tkinter input dialogs
pt_pt: :mod:`tkinter.simpledialog` --- Caixas de diálogo de entrada padrão do Tkinter

source: **Source code:** :source:`Lib/tkinter/simpledialog.py`
pt_pt: **Código-fonte:** :source:`Lib/tkinter/simpledialog.py`

source: The :mod:`tkinter.simpledialog` module contains convenience classes and functions for creating simple modal dialogs to get a value from the user.
pt_pt: O módulo :mod:`tkinter.simpledialog` contém classes e funções de conveniência para criar caixas de diálogo modais simples para obter um valor do utilizador.

source: The above three functions provide dialogs that prompt the user to enter a value of the desired type.
pt_pt: As três funções acima fornecem caixas de diálogo que solicitam ao utilizador que insira um valor do tipo desejado.

source: The base class for custom dialogs.
pt_pt: A classe base para caixas de diálogo personalizadas.

source: Override to construct the dialog's interface and return the widget that should have initial focus.
pt_pt: Substitua (override) para construir a interface da caixa de diálogo e devolver o widget que deve ter o foco inicial.

source: Default behaviour adds OK and Cancel buttons. Override for custom button layouts.
pt_pt: O comportamento predefinido adiciona os botões OK e Cancelar. Substitua para layouts de botões personalizados.

source: :mod:`tkinter.filedialog` --- File selection dialogs
pt_pt: :mod:`tkinter.filedialog` --- Caixas de diálogo de seleção de ficheiros

source: **Source code:** :source:`Lib/tkinter/filedialog.py`
pt_pt: **Código-fonte:** :source:`Lib/tkinter/filedialog.py`

source: The :mod:`tkinter.filedialog` module provides classes and factory functions for creating file/directory selection windows.
pt_pt: O módulo :mod:`tkinter.filedialog` fornece classes e funções de fábrica para criar janelas de seleção de ficheiros/diretórios.

source: Native Load/Save Dialogs
pt_pt: Caixas de Diálogo Nativas de Carregamento/Gravação

source: The following classes and functions provide file dialog windows that combine a native look-and-feel with configuration options to customize behaviour. The following keyword arguments are applicable to the classes and functions listed below:
pt_pt: As seguintes classes e funções fornecem janelas de diálogo de ficheiros que combinam uma aparência nativa com opções de configuração para personalizar o comportamento. Os seguintes argumentos de palavra-chave são aplicáveis às classes e funções listadas abaixo:

source: *parent* - the window to place the dialog on top of
pt_pt: *parent* - a janela sobre a qual a caixa de diálogo deve ser colocada

source: *title* - the title of the window
pt_pt: *title* - o título da janela

source: *initialdir* - the directory that the dialog starts in
pt_pt: *initialdir* - o diretório no qual a caixa de diálogo é iniciada

source: *initialfile* - the file selected upon opening of the dialog
pt_pt: *initialfile* - o ficheiro selecionado ao abrir a caixa de diálogo

source: *filetypes* - a sequence of (label, pattern) tuples, '*' wildcard is allowed
pt_pt: *filetypes* - uma sequência de tuplos (rótulo, padrão), o caráter wildcard '*' é permitido

source: *defaultextension* - default extension to append to file (save dialogs)
pt_pt: *defaultextension* - extensão predefinida a anexar ao ficheiro (caixas de diálogo de gravação)

source: *multiple* - when true, selection of multiple items is allowed
pt_pt: *multiple* - quando verdadeiro, a seleção de múltiplos itens é permitida

source: **Static factory functions**
pt_pt: **Funções de fábrica estáticas**

source: The below functions when called create a modal, native look-and-feel dialog, wait for the user's selection, then return the selected value(s) or ``None`` to the caller.
pt_pt: As funções abaixo, quando chamadas, criam uma caixa de diálogo modal com a aparência nativa do sistema, aguardam pela seleção do utilizador e, em seguida, devolvem o(s) valor(es) selecionado(s) ou ``None`` ao chamador.

source: The above two functions create an :class:`Open` dialog and return the opened file object(s) in read-only mode.
pt_pt: As duas funções acima criam uma caixa de diálogo :class:`Open` e devolvem o(s) objeto(s) de ficheiro aberto(s) em modo de apenas leitura.

source: Create a :class:`SaveAs` dialog and return a file object opened in write-only mode.
pt_pt: Cria uma caixa de diálogo :class:`SaveAs` e devolve um objeto de ficheiro aberto em modo de apenas escrita.

source: The above two functions create an :class:`Open` dialog and return the selected filename(s) that correspond to existing file(s).
pt_pt: As duas funções acima criam uma caixa de diálogo :class:`Open` e devolvem o(s) nome(s) de ficheiro selecionado(s) que correspondem a ficheiro(s) existente(s).

source: Create a :class:`SaveAs` dialog and return the selected filename.
pt_pt: Cria uma caixa de diálogo :class:`SaveAs` e devolve o nome de ficheiro selecionado.

source: Prompt user to select a directory.
pt_pt: Solicita ao utilizador a seleção de um diretório.

source: Additional keyword option:
pt_pt: Opção de palavra-chave adicional:

source: *mustexist* - determines if selection must be an existing directory.
pt_pt: *mustexist* - determina se a seleção deve ser um diretório existente.

source: The above two classes provide native dialog windows for saving and loading files.
pt_pt: As duas classes acima fornecem janelas de diálogo nativas para gravar e carregar ficheiros.

source: **Convenience classes**
pt_pt: **Classes de conveniência**

source: The below classes are used for creating file/directory windows from scratch. These do not emulate the native look-and-feel of the platform.
pt_pt: As classes abaixo são utilizadas para criar janelas de ficheiro/diretório do zero. Estas não emulam a aparência nativa da plataforma.

source: Create a dialog prompting the user to select a directory.
pt_pt: Cria uma caixa de diálogo solicitando ao utilizador que selecione um diretório.

source: The *FileDialog* class should be subclassed for custom event handling and behaviour.
pt_pt: A classe *FileDialog* deve ser herdada (subclassed) para manipulação de eventos e comportamento personalizados.

source: Create a basic file selection dialog.
pt_pt: Cria uma caixa de diálogo básica de seleção de ficheiros.

source: Trigger the termination of the dialog window.
pt_pt: Aciona o término da janela de diálogo.

source: Event handler for double-click event on directory.
pt_pt: Manipulador de eventos (event handler) para o evento de duplo clique num diretório.

source: Event handler for click event on directory.
pt_pt: Manipulador de eventos para o evento de clique num diretório.

source: Event handler for double-click event on file.
pt_pt: Manipulador de eventos para o evento de duplo clique num ficheiro.

source: Event handler for single-click event on file.
pt_pt: Manipulador de eventos para o evento de clique único num ficheiro.

source: Filter the files by directory.
pt_pt: Filtra os ficheiros por diretório.

source: Retrieve the file filter currently in use.
pt_pt: Recupera o filtro de ficheiros atualmente em uso.

source: Retrieve the currently selected item.
pt_pt: Recupera o item atualmente selecionado.

source: Render dialog and start event loop.
pt_pt: Renderiza a caixa de diálogo e inicia o loop de eventos.

source: Exit dialog returning current selection.
pt_pt: Sai da caixa de diálogo devolvendo a seleção atual.

source: Exit dialog returning filename, if any.
pt_pt: Sai da caixa de diálogo devolvendo o nome do ficheiro, se houver.

source: Set the file filter.
pt_pt: Define o filtro de ficheiros.

source: Update the current file selection to *file*.
pt_pt: Atualiza a seleção de ficheiro atual para *file*.

source: A subclass of FileDialog that creates a dialog window for selecting an existing file.
pt_pt: Uma subclasse de FileDialog que cria uma janela de diálogo para selecionar um ficheiro existente.

source: Test that a file is provided and that the selection indicates an already existing file.
pt_pt: Testa se um ficheiro é fornecido e se a seleção indica um ficheiro já existente.

source: A subclass of FileDialog that creates a dialog window for selecting a destination file.
pt_pt: Uma subclasse de FileDialog que cria uma janela de diálogo para selecionar um ficheiro de destino.

source: Test whether or not the selection points to a valid file that is not a directory. Confirmation is required if an already existing file is selected.
pt_pt: Testa se a seleção aponta para um ficheiro válido que não é um diretório. É necessária confirmação se um ficheiro já existente for selecionado.

source: :mod:`tkinter.commondialog` --- Dialog window templates
pt_pt: :mod:`tkinter.commondialog` --- Modelos de janela de diálogo

source: **Source code:** :source:`Lib/tkinter/commondialog.py`
pt_pt: **Código-fonte:** :source:`Lib/tkinter/commondialog.py`

source: The :mod:`tkinter.commondialog` module provides the :class:`Dialog` class that is the base class for dialogs defined in other supporting modules.
pt_pt: O módulo :mod:`tkinter.commondialog` fornece a classe :class:`Dialog`, que é a classe base para caixas de diálogo definidas noutros módulos de suporte.

source: Render the Dialog window.
pt_pt: Renderiza a janela Dialog.

source: Modules :mod:`tkinter.messagebox`, :ref:`tut-files`
pt_pt: Módulos :mod:`tkinter.messagebox`, :ref:`tut-files`
