Repository: NyaPuma/python-docs-pt
Catalog: library/email.charset.po
Languages: pt_pt

source: :mod:`!email.charset`: Representing character sets
pt_pt: :mod:`!email.charset`: Representação de conjuntos de caracteres

source: **Source code:** :source:`Lib/email/charset.py`
pt_pt: **Código-fonte:** :source:`Lib/email/charset.py`

source: This module is part of the legacy (``Compat32``) email API. In the new API only the aliases table is used.
pt_pt: Este módulo faz parte da API de e-mail legada (``Compat32``). Na nova API, apenas a tabela de pseudónimos (aliases) é utilizada.

source: The remaining text in this section is the original documentation of the module.
pt_pt: O texto restante nesta secção é a documentação original do módulo.

source: This module provides a class :class:`Charset` for representing character sets and character set conversions in email messages, as well as a character set registry and several convenience methods for manipulating this registry. Instances of :class:`Charset` are used in several other modules within the :mod:`email` package.
pt_pt: Este módulo fornece uma classe :class:`Charset` para representar conjuntos de caracteres e conversões de conjuntos de caracteres em mensagens de e-mail, bem como um registo de conjuntos de caracteres e vários métodos de conveniência para manipular este registo. Instâncias de :class:`Charset` são utilizadas em vários outros módulos dentro do pacote :mod:`email`.

source: Import this class from the :mod:`email.charset` module.
pt_pt: Importe esta classe a partir do módulo :mod:`email.charset`.

source: Map character sets to their email properties.
pt_pt: Mapeia conjuntos de caracteres para as suas propriedades de e-mail.

source: This class provides information about the requirements imposed on email for a specific character set. It also provides convenience routines for converting between character sets, given the availability of the applicable codecs. Given a character set, it will do its best to provide information on how to use that character set in an email message in an RFC-compliant way.
pt_pt: Esta classe fornece informações sobre os requisitos impostos ao e-mail para um conjunto de caracteres específico. Também fornece rotinas de conveniência para converter entre conjuntos de caracteres, dada a disponibilidade dos codecs aplicáveis. Dado um conjunto de caracteres, tentará o seu melhor para fornecer informações sobre como utilizar esse conjunto numa mensagem de e-mail de forma compatível com as RFC.

source: Certain character sets must be encoded with quoted-printable or base64 when used in email headers or bodies. Certain character sets must be converted outright, and are not allowed in email.
pt_pt: Certos conjuntos de caracteres devem ser codificados com quoted-printable ou base64 quando utilizados em cabeçalhos ou corpos de e-mail. Certos conjuntos de caracteres devem ser convertidos diretamente e não são permitidos em e-mail.

source: Optional *input_charset* is as described below; it is always coerced to lower case. After being alias normalized it is also used as a lookup into the registry of character sets to find out the header encoding, body encoding, and output conversion codec to be used for the character set. For example, if *input_charset* is ``iso-8859-1``, then headers and bodies will be encoded using quoted-printable and no output conversion codec is necessary. If *input_charset* is ``euc-jp``, then headers will be encoded with base64, bodies will not be encoded, but output text will be converted from the ``euc-jp`` character set to the ``iso-2022-jp`` character set.
pt_pt: O argumento opcional *input_charset* é como descrito abaixo; é sempre convertido para minúsculas. Após a normalização de pseudónimos, é também utilizado para consulta no registo de conjuntos de caracteres para determinar a codificação do cabeçalho, codificação do corpo e o codec de conversão de saída a ser utilizado. Por exemplo, se *input_charset* for ``iso-8859-1``, os cabeçalhos e corpos serão codificados usando quoted-printable e nenhum codec de conversão de saída é necessário. Se *input_charset* for ``euc-jp``, os cabeçalhos serão codificados com base64, os corpos não serão codificados, mas o texto de saída será convertido do conjunto de caracteres ``euc-jp`` para o conjunto ``iso-2022-jp``.

source: :class:`Charset` instances have the following data attributes:
pt_pt: As instâncias de :class:`Charset` têm os seguintes atributos de dados:

source: The initial character set specified. Common aliases are converted to their *official* email names (e.g. ``latin_1`` is converted to ``iso-8859-1``). Defaults to 7-bit ``us-ascii``.
pt_pt: O conjunto de caracteres inicial especificado. Pseudónimos comuns são convertidos para os seus nomes de e-mail *oficiais* (ex: ``latin_1`` é convertido para ``iso-8859-1``). O valor por omissão é o ``us-ascii`` de 7 bits.

source: If the character set must be encoded before it can be used in an email header, this attribute will be set to ``charset.QP`` (for quoted-printable), ``charset.BASE64`` (for base64 encoding), or ``charset.SHORTEST`` for the shortest of QP or BASE64 encoding. Otherwise, it will be ``None``.
pt_pt: Se o conjunto de caracteres tiver de ser codificado antes de poder ser utilizado num cabeçalho de e-mail, este atributo será definido como ``charset.QP`` (para quoted-printable), ``charset.BASE64`` (para codificação base64), ou ``charset.SHORTEST`` para a mais curta entre QP ou BASE64. Caso contrário, será ``None``.

source: Same as *header_encoding*, but describes the encoding for the mail message's body, which indeed may be different than the header encoding. ``charset.SHORTEST`` is not allowed for *body_encoding*.
pt_pt: Igual a *header_encoding*, mas descreve a codificação para o corpo da mensagem de correio, que pode ser diferente da codificação do cabeçalho. ``charset.SHORTEST`` não é permitido para *body_encoding*.

source: Some character sets must be converted before they can be used in email headers or bodies. If the *input_charset* is one of them, this attribute will contain the name of the character set output will be converted to. Otherwise, it will be ``None``.
pt_pt: Alguns conjuntos de caracteres devem ser convertidos antes de poderem ser utilizados em cabeçalhos ou corpos de e-mail. Se o *input_charset* for um deles, este atributo conterá o nome do conjunto de caracteres para o qual a saída será convertida. Caso contrário, será ``None``.

source: The name of the Python codec used to convert the *input_charset* to Unicode. If no conversion codec is necessary, this attribute will be ``None``.
pt_pt: O nome do codec Python utilizado para converter o *input_charset* para Unicode. Se não for necessário nenhum codec de conversão, este atributo será ``None``.

source: The name of the Python codec used to convert Unicode to the *output_charset*. If no conversion codec is necessary, this attribute will have the same value as the *input_codec*.
pt_pt: O nome do codec Python utilizado para converter Unicode para o *output_charset*. Se não for necessário nenhum codec de conversão, este atributo terá o mesmo valor que o *input_codec*.

source: :class:`Charset` instances also have the following methods:
pt_pt: As instâncias de :class:`Charset` também têm os seguintes métodos:

source: Return the content transfer encoding used for body encoding.
pt_pt: Devolve a codificação de transferência de conteúdo utilizada para a codificação do corpo.

source: This is either the string ``quoted-printable`` or ``base64`` depending on the encoding used, or it is a function, in which case you should call the function with a single argument, the Message object being encoded. The function should then set the :mailheader:`Content-Transfer-Encoding` header itself to whatever is appropriate.
pt_pt: Este valor é a string ``quoted-printable`` ou ``base64`` dependendo da codificação utilizada, ou é uma função; nesse caso, deve chamar a função com um único argumento, o objeto Message que está a ser codificado. A função deve então definir o cabeçalho :mailheader:`Content-Transfer-Encoding` por si mesma para o valor apropriado.

source: Returns the string ``quoted-printable`` if *body_encoding* is ``QP``, returns the string ``base64`` if *body_encoding* is ``BASE64``, and returns the string ``7bit`` otherwise.
pt_pt: Devolve a string ``quoted-printable`` se *body_encoding* for ``QP``, devolve a string ``base64`` se *body_encoding* for ``BASE64``, e devolve a string ``7bit`` caso contrário.

source: Return the output character set.
pt_pt: Devolve o conjunto de caracteres de saída.

source: This is the *output_charset* attribute if that is not ``None``, otherwise it is *input_charset*.
pt_pt: Este é o atributo *output_charset* se este não for ``None``, caso contrário é o *input_charset*.

source: Header-encode the string *string*.
pt_pt: Codifica para cabeçalho a string *string*.

source: The type of encoding (base64 or quoted-printable) will be based on the *header_encoding* attribute.
pt_pt: O tipo de codificação (base64 ou quoted-printable) será baseado no atributo *header_encoding*.

source: Header-encode a *string* by converting it first to bytes.
pt_pt: Codifica para cabeçalho uma *string* convertendo-a primeiro para bytes.

source: This is similar to :meth:`header_encode` except that the string is fit into maximum line lengths as given by the argument *maxlengths*, which must be an iterator: each element returned from this iterator will provide the next maximum line length.
pt_pt: Isto é semelhante a :meth:`header_encode`, exceto que a string é ajustada para os comprimentos máximos de linha dados pelo argumento *maxlengths*, que deve ser um iterador: cada elemento retornado por este iterador fornecerá o próximo comprimento máximo de linha.

source: Body-encode the string *string*.
pt_pt: Codifica para o corpo a string *string*.

source: The type of encoding (base64 or quoted-printable) will be based on the *body_encoding* attribute.
pt_pt: O tipo de codificação (base64 ou quoted-printable) será baseado no atributo *body_encoding*.

source: The :class:`Charset` class also provides a number of methods to support standard operations and built-in functions.
pt_pt: A classe :class:`Charset` também fornece uma série de métodos para suportar operações padrão e funções integradas.

source: Returns *input_charset* as a string coerced to lower case. :meth:`!__repr__` is an alias for :meth:`!__str__`.
pt_pt: Devolve o *input_charset* como uma string convertida para minúsculas. :meth:`!__repr__` é um pseudónimo (alias) para :meth:`!__str__`.

source: This method allows you to compare two :class:`Charset` instances for equality.
pt_pt: Este método permite comparar a igualdade entre duas instâncias de :class:`Charset`.

source: This method allows you to compare two :class:`Charset` instances for inequality.
pt_pt: Este método permite comparar a desigualdade entre duas instâncias de :class:`Charset`.

source: The :mod:`email.charset` module also provides the following functions for adding new entries to the global character set, alias, and codec registries:
pt_pt: O módulo :mod:`email.charset` também fornece as seguintes funções para adicionar novas entradas aos registos globais de conjuntos de caracteres, pseudónimos e codecs:

source: Add character properties to the global registry.
pt_pt: Adiciona propriedades de caracteres ao registo global.

source: *charset* is the input character set, and must be the canonical name of a character set.
pt_pt: *charset* é o conjunto de caracteres de entrada e deve ser o nome canónico de um conjunto de caracteres.

source: Optional *header_enc* and *body_enc* is either ``charset.QP`` for quoted-printable, ``charset.BASE64`` for base64 encoding, ``charset.SHORTEST`` for the shortest of quoted-printable or base64 encoding, or ``None`` for no encoding. ``SHORTEST`` is only valid for *header_enc*. The default is ``None`` for no encoding.
pt_pt: Os argumentos opcionais *header_enc* e *body_enc* podem ser ``charset.QP`` para quoted-printable, ``charset.BASE64`` para codificação base64, ``charset.SHORTEST`` para a mais curta entre quoted-printable ou base64, ou ``None`` para nenhuma codificação. ``SHORTEST`` só é válido para *header_enc*. O valor por omissão é ``None`` (sem codificação).

source: Optional *output_charset* is the character set that the output should be in. Conversions will proceed from input charset, to Unicode, to the output charset when the method :meth:`Charset.convert` is called. The default is to output in the same character set as the input.
pt_pt: O argumento opcional *output_charset* é o conjunto de caracteres em que a saída deve estar. As conversões prosseguirão do charset de entrada para Unicode e depois para o charset de saída quando o método :meth:`Charset.convert` for chamado. O valor por omissão é produzir a saída no mesmo conjunto de caracteres da entrada.

source: Both *input_charset* and *output_charset* must have Unicode codec entries in the module's character set-to-codec mapping; use :func:`add_codec` to add codecs the module does not know about. See the :mod:`codecs` module's documentation for more information.
pt_pt: Tanto *input_charset* como *output_charset* devem ter entradas de codecs Unicode no mapeamento de conjunto de caracteres para codec do módulo; utilize :func:`add_codec` para adicionar codecs que o módulo desconheça. Consulte a documentação do módulo :mod:`codecs` para mais informações.

source: The global character set registry is kept in the module global dictionary ``CHARSETS``.
pt_pt: O registo global de conjuntos de caracteres é mantido no dicionário global do módulo ``CHARSETS``.

source: Add a character set alias. *alias* is the alias name, e.g. ``latin-1``. *canonical* is the character set's canonical name, e.g. ``iso-8859-1``.
pt_pt: Adiciona um pseudónimo (alias) de conjunto de caracteres. *alias* é o nome do pseudónimo, ex: ``latin-1``. *canonical* é o nome canónico do conjunto de caracteres, ex: ``iso-8859-1``.

source: The global charset alias registry is kept in the module global dictionary ``ALIASES``.
pt_pt: O registo global de pseudónimos de conjuntos de caracteres é mantido no dicionário global do módulo ``ALIASES``.

source: Add a codec that map characters in the given character set to and from Unicode.
pt_pt: Adiciona um codec que mapeia caracteres no conjunto de caracteres fornecido de e para Unicode.

source: *charset* is the canonical name of a character set. *codecname* is the name of a Python codec, as appropriate for the second argument to the :class:`str`'s :meth:`~str.encode` method.
pt_pt: *charset* é o nome canónico de um conjunto de caracteres. *codecname* é o nome de um codec Python, conforme apropriado para o segundo argumento do método :meth:`~str.encode` da classe :class:`str`.
