Repository: NyaPuma/python-docs-pt
Catalog: library/email.utils.po
Languages: pt_pt

source: :mod:`!email.utils`: Miscellaneous utilities
pt_pt: :mod:`!email.utils`: Utilitários diversos

source: **Source code:** :source:`Lib/email/utils.py`
pt_pt: **Código-fonte:** :source:`Lib/email/utils.py`

source: There are a couple of useful utilities provided in the :mod:`!email.utils` module:
pt_pt: Existem alguns utilitários úteis fornecidos no módulo :mod:`!email.utils`:

source: Return local time as an aware datetime object. If called without arguments, return current time. Otherwise *dt* argument should be a :class:`~datetime.datetime` instance, and it is converted to the local time zone according to the system time zone database. If *dt* is naive (that is, ``dt.tzinfo`` is ``None``), it is assumed to be in local time.
pt_pt: Retorna a hora local como um objeto datetime "aware" (com fuso horário). Se for chamada sem argumentos, retorna a hora atual. Caso contrário, o argumento *dt* deve ser uma instância de :class:`~datetime.datetime`, sendo convertida para o fuso horário local de acordo com a base de dados de fuso horário do sistema. Se *dt* for "naive" (ou seja, ``dt.tzinfo`` é ``None``), assume-se que está na hora local.

source: The *isdst* parameter.
pt_pt: O parâmetro *isdst*.

source: Returns a string suitable for an :rfc:`2822`\ -compliant :mailheader:`Message-ID` header. Optional *idstring* if given, is a string used to strengthen the uniqueness of the message id. Optional *domain* if given provides the portion of the msgid after the '@'. The default is the local hostname. It is not normally necessary to override this default, but may be useful certain cases, such as a constructing distributed system that uses a consistent domain name across multiple hosts.
pt_pt: Retorna uma string adequada para um cabeçalho :mailheader:`Message-ID` em conformidade com a :rfc:`2822`. O argumento opcional *idstring*, se fornecido, é uma string usada para reforçar a unicidade do ID da mensagem. O argumento opcional *domain*, se fornecido, define a parte do msgid após o '@'. O padrão é o nome de anfitrião (hostname) local. Normalmente não é necessário substituir este padrão, mas pode ser útil em certos casos, como na construção de um sistema distribuído que utilize um nome de domínio consistente em múltiplos anfitriões.

source: Added the *domain* keyword.
pt_pt: Adicionada a palavra-chave *domain*.

source: The remaining functions are part of the legacy (``Compat32``) email API. There is no need to directly use these with the new API, since the parsing and formatting they provide is done automatically by the header parsing machinery of the new API.
pt_pt: As restantes funções fazem parte da API de email legada (``Compat32``). Não há necessidade de usá-las diretamente com a nova API, uma vez que a análise (parsing) e formatação que elas fornecem são feitas automaticamente pelo mecanismo de análise de cabeçalhos da nova API.

source: Return a new string with backslashes in *str* replaced by two backslashes, and double quotes replaced by backslash-double quote.
pt_pt: Retorna uma nova string com as barras invertidas (backslashes) em *str* substituídas por duas barras invertidas, e as aspas duplas substituídas por barra invertida e aspas duplas.

source: Return a new string which is an *unquoted* version of *str*. If *str* ends and begins with double quotes, they are stripped off. Likewise if *str* ends and begins with angle brackets, they are stripped off.
pt_pt: Retorna uma nova string que é uma versão de *str* sem aspas (*unquoted*). Se *str* começar e terminar com aspas duplas, estas são removidas. Da mesma forma, se *str* começar e terminar com parênteses angulares (< >), estes são removidos.

source: Parse address -- which should be the value of some address-containing field such as :mailheader:`To` or :mailheader:`Cc` -- into its constituent *realname* and *email address* parts. Returns a tuple of that information, unless the parse fails, in which case a 2-tuple of ``('', '')`` is returned.
pt_pt: Analisa um endereço — que deve ser o valor de algum campo que contenha endereços, como :mailheader:`To` ou :mailheader:`Cc` — nas suas partes constituintes *realname* (nome real) e *email address* (endereço de email). Retorna um tuplo com essa informação, a menos que a análise falhe, caso em que é retornado um tuplo de dois elementos ``('', '')``.

source: If *strict* is true, use a strict parser which rejects malformed inputs.
pt_pt: Se *strict* for verdadeiro, utiliza um analisador rigoroso que rejeita entradas malformadas.

source: Add *strict* optional parameter and reject malformed inputs by default.
pt_pt: Adicionado o parâmetro opcional *strict* e a rejeição de entradas malformadas por defeito.

source: The inverse of :meth:`parseaddr`, this takes a 2-tuple of the form ``(realname, email_address)`` and returns the string value suitable for a :mailheader:`To` or :mailheader:`Cc` header. If the first element of *pair* is false, then the second element is returned unmodified.
pt_pt: O inverso de :meth:`parseaddr`; recebe um tuplo de dois elementos na forma ``(realname, email_address)`` e retorna o valor em string adequado para um cabeçalho :mailheader:`To` ou :mailheader:`Cc`. Se o primeiro elemento do par (*pair*) for falso, o segundo elemento é retornado sem alterações.

source: Optional *charset* is the character set that will be used in the :rfc:`2047` encoding of the ``realname`` if the ``realname`` contains non-ASCII characters. Can be an instance of :class:`str` or a :class:`~email.charset.Charset`. Defaults to ``utf-8``.
pt_pt: O argumento opcional *charset* é o conjunto de caracteres que será usado na codificação :rfc:`2047` do ``realname``, caso este contenha caracteres não-ASCII. Pode ser uma instância de :class:`str` ou um :class:`~email.charset.Charset`. O padrão é ``utf-8``.

source: Added the *charset* option.
pt_pt: Adicionada a opção *charset*.

source: This method returns a list of 2-tuples of the form returned by ``parseaddr()``. *fieldvalues* is a sequence of header field values as might be returned by :meth:`Message.get_all <email.message.Message.get_all>`.
pt_pt: Este método retorna uma lista de tuplos de dois elementos no formato retornado por ``parseaddr()``. *fieldvalues* é uma sequência de valores de campos de cabeçalho como os que seriam retornados por :meth:`Message.get_all <email.message.Message.get_all>`.

source: Here's a simple example that gets all the recipients of a message::
pt_pt: Eis um exemplo simples que obtém todos os destinatários de uma mensagem::

source: Attempts to parse a date according to the rules in :rfc:`2822`. however, some mailers don't follow that format as specified, so :func:`parsedate` tries to guess correctly in such cases. *date* is a string containing an :rfc:`2822` date, such as ``"Mon, 20 Nov 1995 19:12:08 -0500"``. If it succeeds in parsing the date, :func:`parsedate` returns a 9-tuple that can be passed directly to :func:`time.mktime`; otherwise ``None`` will be returned. Note that indexes 6, 7, and 8 of the result tuple are not usable.
pt_pt: Tenta analisar uma data de acordo com as regras da :rfc:`2822`. No entanto, alguns programas de correio não seguem esse formato como especificado, pelo que :func:`parsedate` tenta adivinhar corretamente nesses casos. *date* é uma string contendo uma data :rfc:`2822`, como ``"Mon, 20 Nov 1995 19:12:08 -0500"``. Se a análise for bem-sucedida, :func:`parsedate` retorna um tuplo de 9 elementos que pode ser passado diretamente para :func:`time.mktime`; caso contrário, será retornado ``None``. Note que os índices 6, 7 e 8 do tuplo resultante não são utilizáveis.

source: Performs the same function as :func:`parsedate`, but returns either ``None`` or a 10-tuple; the first 9 elements make up a tuple that can be passed directly to :func:`time.mktime`, and the tenth is the offset of the date's timezone from UTC (which is the official term for Greenwich Mean Time) [#]_. If the input string has no timezone, the last element of the tuple returned is ``0``, which represents UTC. Note that indexes 6, 7, and 8 of the result tuple are not usable.
pt_pt: Executa a mesma função que :func:`parsedate`, mas retorna ``None`` ou um tuplo de 10 elementos; os primeiros 9 elementos formam um tuplo que pode ser passado diretamente para :func:`time.mktime`, e o décimo é o desvio (offset) do fuso horário da data em relação ao UTC (que é o termo oficial para Greenwich Mean Time) [#]_. Se a string de entrada não tiver fuso horário, o último elemento do tuplo retornado é ``0``, que representa o UTC. Note que os índices 6, 7 e 8 do tuplo resultante não são utilizáveis.

source: The inverse of :func:`format_datetime`. Performs the same function as :func:`parsedate`, but on success returns a :mod:`~datetime.datetime`; otherwise ``ValueError`` is raised if *date* contains an invalid value such as an hour greater than 23 or a timezone offset not between -24 and 24 hours. If the input date has a timezone of ``-0000``, the ``datetime`` will be a naive ``datetime``, and if the date is conforming to the RFCs it will represent a time in UTC but with no indication of the actual source timezone of the message the date comes from. If the input date has any other valid timezone offset, the ``datetime`` will be an aware ``datetime`` with the corresponding a :class:`~datetime.timezone` :class:`~datetime.tzinfo`.
pt_pt: O inverso de :func:`format_datetime`. Executa a mesma função que :func:`parsedate`, mas em caso de sucesso retorna um :mod:`~datetime.datetime`; caso contrário, é lançado um ``ValueError`` se *date* contiver um valor inválido, como uma hora superior a 23 ou um desvio de fuso horário que não esteja entre -24 e 24 horas. Se a data de entrada tiver um fuso horário de ``-0000``, o ``datetime`` será um "naive" ``datetime`` e, se a data estiver em conformidade com as RFCs, representará uma hora em UTC, mas sem indicação do fuso horário de origem real da mensagem de onde a data provém. Se a data de entrada tiver qualquer outro desvio de fuso horário válido, o ``datetime`` será um "aware" ``datetime`` com o correspondente :class:`~datetime.timezone` :class:`~datetime.tzinfo`.

source: Turn a 10-tuple as returned by :func:`parsedate_tz` into a UTC timestamp (seconds since the Epoch). If the timezone item in the tuple is ``None``, assume local time.
pt_pt: Converte um tuplo de 10 elementos, como o retornado por :func:`parsedate_tz`, num timestamp UTC (segundos desde a Época/Epoch). Se o item do fuso horário no tuplo for ``None``, assume-se a hora local.

source: Returns a date string as per :rfc:`2822`, e.g.::
pt_pt: Retorna uma string de data conforme a :rfc:`2822`, ex.::

source: Optional *timeval* if given is a floating-point time value as accepted by :func:`time.gmtime` and :func:`time.localtime`, otherwise the current time is used.
pt_pt: O argumento opcional *timeval*, se fornecido, é um valor de tempo em vírgula flutuante como os aceites por :func:`time.gmtime` e :func:`time.localtime`; caso contrário, é usada a hora atual.

source: Optional *localtime* is a flag that when ``True``, interprets *timeval*, and returns a date relative to the local timezone instead of UTC, properly taking daylight savings time into account. The default is ``False`` meaning UTC is used.
pt_pt: O argumento opcional *localtime* é uma flag que, quando ``True``, interpreta *timeval* e retorna uma data relativa ao fuso horário local em vez do UTC, tendo em conta adequadamente o horário de verão. O padrão é ``False``, o que significa que o UTC é usado.

source: Optional *usegmt* is a flag that when ``True``, outputs a date string with the timezone as an ascii string ``GMT``, rather than a numeric ``-0000``. This is needed for some protocols (such as HTTP). This only applies when *localtime* is ``False``. The default is ``False``.
pt_pt: O argumento opcional *usegmt* é uma flag que, quando ``True``, gera uma string de data com o fuso horário como a string ASCII ``GMT``, em vez de um numérico ``-0000``. Isto é necessário para alguns protocolos (como o HTTP). Isto apenas se aplica quando *localtime* é ``False``. O padrão é ``False``.

source: Like ``formatdate``, but the input is a :mod:`datetime` instance. If it is a naive datetime, it is assumed to be "UTC with no information about the source timezone", and the conventional ``-0000`` is used for the timezone. If it is an aware ``datetime``, then the numeric timezone offset is used. If it is an aware timezone with offset zero, then *usegmt* may be set to ``True``, in which case the string ``GMT`` is used instead of the numeric timezone offset. This provides a way to generate standards conformant HTTP date headers.
pt_pt: Semelhante a ``formatdate``, mas a entrada é uma instância de :mod:`datetime`. Se for um datetime "naive", assume-se que é "UTC sem informação sobre o fuso horário de origem" e o convencional ``-0000`` é usado para o fuso horário. Se for um datetime "aware", então o desvio numérico do fuso horário é usado. Se for um fuso horário "aware" com desvio zero, então *usegmt* pode ser definido como ``True``, caso em que a string ``GMT`` é usada em vez do desvio numérico. Isto permite gerar cabeçalhos de data HTTP em conformidade com os padrões.

source: Decode the string *s* according to :rfc:`2231`.
pt_pt: Descodifica a string *s* de acordo com a :rfc:`2231`.

source: Encode the string *s* according to :rfc:`2231`. Optional *charset* and *language*, if given is the character set name and language name to use. If neither is given, *s* is returned as-is. If *charset* is given but *language* is not, the string is encoded using the empty string for *language*.
pt_pt: Codifica a string *s* de acordo com a :rfc:`2231`. Os argumentos opcionais *charset* e *language*, se fornecidos, são o nome do conjunto de caracteres e o nome do idioma a usar. Se nenhum for fornecido, *s* é retornada tal como está. Se *charset* for fornecido mas *language* não, a string é codificada usando uma string vazia para o idioma.

source: When a header parameter is encoded in :rfc:`2231` format, :meth:`Message.get_param <email.message.Message.get_param>` may return a 3-tuple containing the character set, language, and value. :func:`collapse_rfc2231_value` turns this into a unicode string. Optional *errors* is passed to the *errors* argument of :class:`str`'s :func:`~str.encode` method; it defaults to ``'replace'``. Optional *fallback_charset* specifies the character set to use if the one in the :rfc:`2231` header is not known by Python; it defaults to ``'us-ascii'``.
pt_pt: Quando um parâmetro de cabeçalho está codificado no formato :rfc:`2231`, :meth:`Message.get_param <email.message.Message.get_param>` pode retornar um tuplo de 3 elementos contendo o conjunto de caracteres, o idioma e o valor. :func:`collapse_rfc2231_value` transforma isto numa string unicode. O argumento opcional *errors* é passado para o argumento *errors* do método :func:`~str.encode` de :class:`str`; o padrão é ``'replace'``. O argumento opcional *fallback_charset* especifica o conjunto de caracteres a usar se o que estiver no cabeçalho :rfc:`2231` não for conhecido pelo Python; o padrão é ``'us-ascii'``.

source: For convenience, if the *value* passed to :func:`collapse_rfc2231_value` is not a tuple, it should be a string and it is returned unquoted.
pt_pt: Por conveniência, se o *value* passado para :func:`collapse_rfc2231_value` não for um tuplo, deverá ser uma string e será retornada sem aspas.

source: Decode parameters list according to :rfc:`2231`. *params* is a sequence of 2-tuples containing elements of the form ``(content-type, string-value)``.
pt_pt: Descodifica a lista de parâmetros de acordo com a :rfc:`2231`. *params* é uma sequência de tuplos de 2 elementos contendo elementos na forma ``(content-type, string-value)``.

source: Footnotes
pt_pt: Notas de rodapé

source: Note that the sign of the timezone offset is the opposite of the sign of the ``time.timezone`` variable for the same timezone; the latter variable follows the POSIX standard while this module follows :rfc:`2822`.
pt_pt: Note que o sinal do desvio do fuso horário é o oposto do sinal da variável ``time.timezone`` para o mesmo fuso horário; esta última variável segue o padrão POSIX enquanto este módulo segue a :rfc:`2822`.
