Repository: NyaPuma/python-docs-pt
Catalog: library/email.message.po
Languages: pt_pt

source: :mod:`!email.message`: Representing an email message
pt_pt: :mod:`!email.message`: Representar uma mensagem de email

source: **Source code:** :source:`Lib/email/message.py`
pt_pt: **Código-fonte:** :source:`Lib/email/message.py`

source: The central class in the :mod:`email` package is the :class:`EmailMessage` class, imported from the :mod:`email.message` module. It is the base class for the :mod:`email` object model. :class:`EmailMessage` provides the core functionality for setting and querying header fields, for accessing message bodies, and for creating or modifying structured messages.
pt_pt: A classe central no pacote :mod:`email` é a classe :class:`EmailMessage`, importada do módulo :mod:`email.message`. É a classe base para o modelo de objetos do :mod:`email`. A :class:`EmailMessage` fornece a funcionalidade principal para definir e consultar campos de cabeçalho, para aceder aos corpos das mensagens e para criar ou modificar mensagens estruturadas.

source: An email message consists of *headers* and a *payload* (which is also referred to as the *content*). Headers are :rfc:`5322` or :rfc:`6532` style field names and values, where the field name and value are separated by a colon. The colon is not part of either the field name or the field value. The payload may be a simple text message, or a binary object, or a structured sequence of sub-messages each with their own set of headers and their own payload. The latter type of payload is indicated by the message having a MIME type such as :mimetype:`multipart/\*` or :mimetype:`message/rfc822`.
pt_pt: Uma mensagem de email consiste em *cabeçalhos* (headers) e um *payload* (que também é referido como o *conteúdo*). Os cabeçalhos são nomes de campos e valores ao estilo :rfc:`5322` ou :rfc:`6532`, onde o nome do campo e o valor são separados por um dois-pontos. O dois-pontos não faz parte nem do nome do campo nem do valor do campo. O payload pode ser uma mensagem de texto simples, ou um objeto binário, ou uma sequência estruturada de sub-mensagens, cada uma com o seu próprio conjunto de cabeçalhos e o seu próprio payload. Este último tipo de payload é indicado pelo facto de a mensagem ter um tipo MIME como :mimetype:`multipart/\*` ou :mimetype:`message/rfc822`.

source: The conceptual model provided by an :class:`EmailMessage` object is that of an ordered dictionary of headers coupled with a *payload* that represents the :rfc:`5322` body of the message, which might be a list of sub-``EmailMessage`` objects. In addition to the normal dictionary methods for accessing the header names and values, there are methods for accessing specialized information from the headers (for example the MIME content type), for operating on the payload, for generating a serialized version of the message, and for recursively walking over the object tree.
pt_pt: O modelo conceptual fornecido por um objeto :class:`EmailMessage` é o de um dicionário ordenado de cabeçalhos acoplado a um *payload* que representa o corpo :rfc:`5322` da mensagem, que pode ser uma lista de sub-objetos ``EmailMessage``. Além dos métodos normais de dicionário para aceder aos nomes e valores dos cabeçalhos, existem métodos para aceder a informações especializadas dos cabeçalhos (por exemplo, o tipo de conteúdo MIME), para operar no payload, para gerar uma versão serializada da mensagem e para percorrer recursivamente a árvore de objetos.

source: The :class:`EmailMessage` dictionary-like interface is indexed by the header names, which must be ASCII values. The values of the dictionary are strings with some extra methods. Headers are stored and returned in case-preserving form, but field names are matched case-insensitively. The keys are ordered, but unlike a real dict, there can be duplicates. Additional methods are provided for working with headers that have duplicate keys.
pt_pt: A interface tipo dicionário da :class:`EmailMessage` é indexada pelos nomes dos cabeçalhos, que devem ser valores ASCII. Os valores do dicionário são strings com alguns métodos extra. Os cabeçalhos são armazenados e retornados preservando as maiúsculas/minúsculas originais, mas a correspondência dos nomes dos campos é feita de forma insensível a maiúsculas (case-insensitive). As chaves são ordenadas, mas, ao contrário de um dict real, podem existir duplicados. São fornecidos métodos adicionais para trabalhar com cabeçalhos que possuem chaves duplicadas.

source: The *payload* is either a string or bytes object, in the case of simple message objects, or a list of :class:`EmailMessage` objects, for MIME container documents such as :mimetype:`multipart/\*` and :mimetype:`message/rfc822` message objects.
pt_pt: O *payload* é ou um objeto string ou bytes, no caso de objetos de mensagem simples, ou uma lista de objetos :class:`EmailMessage`, para documentos contentores MIME, como objetos de mensagem :mimetype:`multipart/\*` e :mimetype:`message/rfc822`.

source: If *policy* is specified use the rules it specifies to update and serialize the representation of the message. If *policy* is not set, use the :class:`~email.policy.default` policy, which follows the rules of the email RFCs except for line endings (instead of the RFC mandated ``\r\n``, it uses the Python standard ``\n`` line endings). For more information see the :mod:`~email.policy` documentation. [2]_
pt_pt: Se a *policy* for especificada, utilize as regras que ela define para atualizar e serializar a representação da mensagem. Se a *policy* não for definida, utilize a política :class:`~email.policy.default`, que segue as regras dos RFCs de email, exceto para terminações de linha (em vez do ``\r\n`` exigido pelos RFCs, utiliza as terminações de linha padrão do Python ``\n``). Para mais informações, consulte a documentação de :mod:`~email.policy`. [2]_

source: Return the entire message flattened as a string. When optional *unixfrom* is true, the envelope header is included in the returned string. *unixfrom* defaults to ``False``. For backward compatibility with the base :class:`~email.message.Message` class *maxheaderlen* is accepted, but defaults to ``None``, which means that by default the line length is controlled by the :attr:`~email.policy.Policy.max_line_length` of the policy. The *policy* argument may be used to override the default policy obtained from the message instance. This can be used to control some of the formatting produced by the method, since the specified *policy* will be passed to the :class:`~email.generator.Generator`.
pt_pt: Retorna a mensagem inteira achatada (flattened) como uma string. Quando o parâmetro opcional *unixfrom* é verdadeiro, o cabeçalho do envelope é incluído na string retornada. O valor padrão de *unixfrom* é ``False``. Para compatibilidade com a classe base :class:`~email.message.Message`, o parâmetro *maxheaderlen* é aceite, mas o seu valor padrão é ``None``, o que significa que, por predefinição, o comprimento da linha é controlado pelo :attr:`~email.policy.Policy.max_line_length` da política. O argumento *policy* pode ser utilizado para sobrepor a política padrão obtida da instância da mensagem. Isto pode ser usado para controlar parte da formatação produzida pelo método, uma vez que a *policy* especificada será passada para o :class:`~email.generator.Generator`.

source: Flattening the message may trigger changes to the :class:`EmailMessage` if defaults need to be filled in to complete the transformation to a string (for example, MIME boundaries may be generated or modified).
pt_pt: O achatamento da mensagem pode desencadear alterações na :class:`EmailMessage` se for necessário preencher valores padrão para completar a transformação para string (por exemplo, os limites (boundaries) MIME podem ser gerados ou modificados).

source: Note that this method is provided as a convenience and may not be the most useful way to serialize messages in your application, especially if you are dealing with multiple messages. See :class:`email.generator.Generator` for a more flexible API for serializing messages. Note also that this method is restricted to producing messages serialized as "7 bit clean" when :attr:`~email.policy.EmailPolicy.utf8` is ``False``, which is the default.
pt_pt: Note que este método é fornecido por conveniência e pode não ser a forma mais útil de serializar mensagens na sua aplicação, especialmente se estiver a lidar com múltiplas mensagens. Consulte :class:`email.generator.Generator` para uma API mais flexível de serialização. Note também que este método está restrito a produzir mensagens serializadas como "7 bit clean" quando :attr:`~email.policy.EmailPolicy.utf8` é ``False``, que é o padrão.

source: the default behavior when *maxheaderlen* is not specified was changed from defaulting to 0 to defaulting to the value of *max_line_length* from the policy.
pt_pt: o comportamento padrão quando *maxheaderlen* não é especificado foi alterado de 0 para o valor de *max_line_length* da política.

source: Equivalent to ``as_string(policy=self.policy.clone(utf8=True))``. Allows ``str(msg)`` to produce a string containing the serialized message in a readable format.
pt_pt: Equivalente a ``as_string(policy=self.policy.clone(utf8=True))``. Permite que ``str(msg)`` produza uma string contendo a mensagem serializada num formato legível.

source: the method was changed to use ``utf8=True``, thus producing an :rfc:`6531`-like message representation, instead of being a direct alias for :meth:`as_string`.
pt_pt: o método foi alterado para usar ``utf8=True``, produzindo assim uma representação de mensagem ao estilo :rfc:`6531`, em vez de ser um alias direto para :meth:`as_string`.

source: Return the entire message flattened as a bytes object. When optional *unixfrom* is true, the envelope header is included in the returned string. *unixfrom* defaults to ``False``. The *policy* argument may be used to override the default policy obtained from the message instance. This can be used to control some of the formatting produced by the method, since the specified *policy* will be passed to the :class:`~email.generator.BytesGenerator`.
pt_pt: Retorna a mensagem inteira achatada como um objeto bytes. Quando o parâmetro opcional *unixfrom* é verdadeiro, o cabeçalho do envelope é incluído na string retornada. O valor padrão de *unixfrom* é ``False``. O argumento *policy* pode ser utilizado para sobrepor a política padrão obtida da instância da mensagem. Isto pode ser usado para controlar parte da formatação produzida pelo método, uma vez que a *policy* especificada será passada para o :class:`~email.generator.BytesGenerator`.

source: Note that this method is provided as a convenience and may not be the most useful way to serialize messages in your application, especially if you are dealing with multiple messages. See :class:`email.generator.BytesGenerator` for a more flexible API for serializing messages.
pt_pt: Note que este método é fornecido por conveniência e pode não ser a forma mais útil de serializar mensagens na sua aplicação, especialmente se estiver a lidar com múltiplas mensagens. Consulte :class:`email.generator.BytesGenerator` para uma API mais flexível de serialização.

source: Equivalent to :meth:`.as_bytes`. Allows ``bytes(msg)`` to produce a bytes object containing the serialized message.
pt_pt: Equivalente a :meth:`.as_bytes`. Permite que ``bytes(msg)`` produza um objeto bytes contendo a mensagem serializada.

source: Return ``True`` if the message's payload is a list of sub-\ :class:`EmailMessage` objects, otherwise return ``False``. When :meth:`is_multipart` returns ``False``, the payload should be a string object (which might be a CTE encoded binary payload). Note that :meth:`is_multipart` returning ``True`` does not necessarily mean that "msg.get_content_maintype() == 'multipart'" will return the ``True``. For example, ``is_multipart`` will return ``True`` when the :class:`EmailMessage` is of type ``message/rfc822``.
pt_pt: Retorna ``True`` se o payload da mensagem for uma lista de sub-objetos :class:`EmailMessage`, caso contrário retorna ``False``. Quando :meth:`is_multipart` retorna ``False``, o payload deve ser um objeto string (que pode ser um payload binário codificado em CTE). Note que :meth:`is_multipart` retornar ``True`` não significa necessariamente que "msg.get_content_maintype() == 'multipart'" retornará ``True``. Por exemplo, ``is_multipart`` retornará ``True`` quando a :class:`EmailMessage` for do tipo ``message/rfc822``.

source: Set the message's envelope header to *unixfrom*, which should be a string. (See :class:`~mailbox.mboxMessage` for a brief description of this header.)
pt_pt: Define o cabeçalho do envelope da mensagem para *unixfrom*, que deve ser uma string. (Consulte :class:`~mailbox.mboxMessage` para uma breve descrição deste cabeçalho.)

source: Return the message's envelope header. Defaults to ``None`` if the envelope header was never set.
pt_pt: Retorna o cabeçalho do envelope da mensagem. Por padrão é ``None`` se o cabeçalho do envelope nunca foi definido.

source: The following methods implement the mapping-like interface for accessing the message's headers. Note that there are some semantic differences between these methods and a normal mapping (i.e. dictionary) interface. For example, in a dictionary there are no duplicate keys, but here there may be duplicate message headers. Also, in dictionaries there is no guaranteed order to the keys returned by :meth:`keys`, but in an :class:`EmailMessage` object, headers are always returned in the order they appeared in the original message, or in which they were added to the message later. Any header deleted and then re-added is always appended to the end of the header list.
pt_pt: Os métodos seguintes implementam a interface tipo mapeamento para aceder aos cabeçalhos da mensagem. Note que existem algumas diferenças semânticas entre estes métodos e uma interface de mapeamento normal (ex: dicionário). Por exemplo, num dicionário não existem chaves duplicadas, mas aqui pode haver cabeçalhos de mensagem duplicados. Além disso, nos dicionários não existe uma ordem garantida para as chaves retornadas por :meth:`keys`, mas num objeto :class:`EmailMessage`, os cabeçalhos são sempre retornados na ordem em que apareceram na mensagem original, ou na qual foram adicionados à mensagem posteriormente. Qualquer cabeçalho eliminado e depois re-adicionado é sempre acrescentado ao final da lista de cabeçalhos.

source: These semantic differences are intentional and are biased toward convenience in the most common use cases.
pt_pt: Estas diferenças semânticas são intencionais e visam a conveniência nos casos de uso mais comuns.

source: Note that in all cases, any envelope header present in the message is not included in the mapping interface.
pt_pt: Note que, em todos os casos, qualquer cabeçalho de envelope presente na mensagem não está incluído na interface de mapeamento.

source: Return the total number of headers, including duplicates.
pt_pt: Retorna o número total de cabeçalhos, incluindo duplicados.

source: Return ``True`` if the message object has a field named *name*. Matching is done without regard to case and *name* does not include the trailing colon. Used for the ``in`` operator. For example::
pt_pt: Retorna ``True`` se o objeto de mensagem tiver um campo chamado *name*. A correspondência é feita sem distinção entre maiúsculas e minúsculas e o *name* não inclui o dois-pontos final. Utilizado para o operador ``in``. Por exemplo::

source: if 'message-id' in myMessage: print('Message-ID:', myMessage['message-id'])
pt_pt: if 'message-id' in myMessage: print('ID da Mensagem:', myMessage['message-id'])

source: Return the value of the named header field. *name* does not include the colon field separator. If the header is missing, ``None`` is returned; a :exc:`KeyError` is never raised.
pt_pt: Retorna o valor do campo de cabeçalho nomeado. O *name* não inclui o separador dois-pontos. Se o cabeçalho estiver em falta, é retornado ``None``; nunca é lançado um :exc:`KeyError`.

source: Note that if the named field appears more than once in the message's headers, exactly which of those field values will be returned is undefined. Use the :meth:`get_all` method to get the values of all the extant headers named *name*.
pt_pt: Note que se o campo nomeado aparecer mais de uma vez nos cabeçalhos da mensagem, não está definido qual desses valores de campo será retornado. Utilize o método :meth:`get_all` para obter os valores de todos os cabeçalhos existentes chamados *name*.

source: Using the standard (non-``compat32``) policies, the returned value is an instance of a subclass of :class:`email.headerregistry.BaseHeader`.
pt_pt: Utilizando as políticas padrão (não-``compat32``), o valor retornado é uma instância de uma subclasse de :class:`email.headerregistry.BaseHeader`.

source: Add a header to the message with field name *name* and value *val*. The field is appended to the end of the message's existing headers.
pt_pt: Adiciona um cabeçalho à mensagem com o nome de campo *name* e valor *val*. O campo é acrescentado ao final dos cabeçalhos existentes da mensagem.

source: Note that this does *not* overwrite or delete any existing header with the same name. If you want to ensure that the new header is the only one present in the message with field name *name*, delete the field first, e.g.::
pt_pt: Note que isto *não* sobrescreve ou apaga qualquer cabeçalho existente com o mesmo nome. Se quiser garantir que o novo cabeçalho é o único presente na mensagem com o nome do campo *name*, apague o campo primeiro, por exemplo::

source: del msg['subject'] msg['subject'] = 'Python roolz!'
pt_pt: del msg['assunto'] msg['assunto'] = 'Python é fixe!'

source: If the :mod:`policy <email.policy>` defines certain headers to be unique (as the standard policies do), this method may raise a :exc:`ValueError` when an attempt is made to assign a value to such a header when one already exists. This behavior is intentional for consistency's sake, but do not depend on it as we may choose to make such assignments do an automatic deletion of the existing header in the future.
pt_pt: Se a :mod:`policy <email.policy>` definir certos cabeçalhos como únicos (como as políticas padrão fazem), este método pode lançar um :exc:`ValueError` quando se tenta atribuir um valor a tal cabeçalho se este já existir. Este comportamento é intencional por questões de consistência, mas não dependa dele, pois poderemos optar por fazer com que tais atribuições eliminem automaticamente o cabeçalho existente no futuro.

source: Delete all occurrences of the field with name *name* from the message's headers. No exception is raised if the named field isn't present in the headers.
pt_pt: Apaga todas as ocorrências do campo com o nome *name* dos cabeçalhos da mensagem. Nenhuma exceção é levantada se o campo nomeado não estiver presente nos cabeçalhos.

source: Return a list of all the message's header field names.
pt_pt: Retorna uma lista de todos os nomes dos campos de cabeçalho da mensagem.

source: Return a list of all the message's field values.
pt_pt: Retorna uma lista de todos os valores dos campos da mensagem.

source: Return a list of 2-tuples containing all the message's field headers and values.
pt_pt: Retorna uma lista de tuplos de 2 elementos contendo todos os cabeçalhos e valores dos campos da mensagem.

source: Return the value of the named header field. This is identical to :meth:`~object.__getitem__` except that optional *failobj* is returned if the named header is missing (*failobj* defaults to ``None``).
pt_pt: Retorna o valor do campo de cabeçalho nomeado. Isto é idêntico a :meth:`~object.__getitem__`, exceto que o parâmetro opcional *failobj* é retornado se o cabeçalho estiver em falta (*failobj* tem o valor padrão ``None``).

source: Here are some additional useful header related methods:
pt_pt: Aqui estão alguns métodos adicionais úteis relacionados com cabeçalhos:

source: Return a list of all the values for the field named *name*. If there are no such named headers in the message, *failobj* is returned (defaults to ``None``).
pt_pt: Retorna uma lista de todos os valores para o campo nomeado *name*. Se não houver cabeçalhos com esse nome na mensagem, *failobj* é retornado (o padrão é ``None``).

source: Extended header setting. This method is similar to :meth:`__setitem__` except that additional header parameters can be provided as keyword arguments. *_name* is the header field to add and *_value* is the *primary* value for the header.
pt_pt: Definição estendida de cabeçalho. Este método é semelhante a :meth:`__setitem__`, exceto que parâmetros adicionais de cabeçalho podem ser fornecidos como argumentos de palavra-chave. *_name* é o campo de cabeçalho a adicionar e *_value* é o valor *primário* para o cabeçalho.

source: For each item in the keyword argument dictionary *_params*, the key is taken as the parameter name, with underscores converted to dashes (since dashes are illegal in Python identifiers). Normally, the parameter will be added as ``key="value"`` unless the value is ``None``, in which case only the key will be added.
pt_pt: Para cada item no dicionário de argumentos de palavra-chave *_params*, a chave é usada como o nome do parâmetro, com os sublinhados convertidos em traços (uma vez que os traços são ilegais em identificadores Python). Normalmente, o parâmetro será adicionado como ``key="valor"``, a menos que o valor seja ``None``, caso em que apenas a chave será adicionada.

source: If the value contains non-ASCII characters, the charset and language may be explicitly controlled by specifying the value as a three tuple in the format ``(CHARSET, LANGUAGE, VALUE)``, where ``CHARSET`` is a string naming the charset to be used to encode the value, ``LANGUAGE`` can usually be set to ``None`` or the empty string (see :rfc:`2231` for other possibilities), and ``VALUE`` is the string value containing non-ASCII code points. If a three tuple is not passed and the value contains non-ASCII characters, it is automatically encoded in :rfc:`2231` format using a ``CHARSET`` of ``utf-8`` and a ``LANGUAGE`` of ``None``.
pt_pt: Se o valor contiver caracteres não-ASCII, o conjunto de caracteres e o idioma podem ser explicitamente controlados especificando o valor como um tuplo de três elementos no formato ``(CHARSET, LANGUAGE, VALUE)``, onde ``CHARSET`` é uma string que nomeia o charset a usar para codificar o valor, ``LANGUAGE`` pode ser geralmente definido como ``None`` ou uma string vazia (consulte :rfc:`2231` para outras possibilidades), e ``VALUE`` é o valor da string que contém caracteres não-ASCII. Se um tuplo de três elementos não for passado e o valor contiver caracteres não-ASCII, este é automaticamente codificado no formato :rfc:`2231` usando um ``CHARSET`` de ``utf-8`` e um ``LANGUAGE`` de ``None``.

source: Here is an example::
pt_pt: Aqui está um exemplo::

source: This will add a header that looks like ::
pt_pt: Isto adicionará um cabeçalho com o seguinte aspeto::

source: An example of the extended interface with non-ASCII characters::
pt_pt: Um exemplo da interface estendida com caracteres não-ASCII::

source: Replace a header. Replace the first header found in the message that matches *_name*, retaining header order and field name case of the original header. If no matching header is found, raise a :exc:`KeyError`.
pt_pt: Substitui um cabeçalho. Substitui o primeiro cabeçalho encontrado na mensagem que corresponda a *_name*, preservando a ordem dos cabeçalhos e a caixa do nome do campo do cabeçalho original. Se não for encontrado nenhum cabeçalho correspondente, lança um :exc:`KeyError`.
