Repository: NyaPuma/python-docs-pt
Catalog: library/email.message.po
Languages: pt_pt

source: Return the message's content type, coerced to lower case of the form :mimetype:`maintype/subtype`. If there is no :mailheader:`Content-Type` header in the message return the value returned by :meth:`get_default_type`. If the :mailheader:`Content-Type` header is invalid, return ``text/plain``.
pt_pt: Retorna o tipo de conteúdo da mensagem, convertido para minúsculas no formato :mimetype:`maintype/subtype`. Se não houver um cabeçalho :mailheader:`Content-Type` na mensagem, retorna o valor retornado por :meth:`get_default_type`. Se o cabeçalho :mailheader:`Content-Type` for inválido, retorna ``text/plain``.

source: (According to :rfc:`2045`, messages always have a default type, :meth:`get_content_type` will always return a value. :rfc:`2045` defines a message's default type to be :mimetype:`text/plain` unless it appears inside a :mimetype:`multipart/digest` container, in which case it would be :mimetype:`message/rfc822`. If the :mailheader:`Content-Type` header has an invalid type specification, :rfc:`2045` mandates that the default type be :mimetype:`text/plain`.)
pt_pt: (De acordo com o :rfc:`2045`, as mensagens têm sempre um tipo padrão, e :meth:`get_content_type` retornará sempre um valor. O :rfc:`2045` define o tipo padrão de uma mensagem como :mimetype:`text/plain`, a menos que apareça dentro de um contentor :mimetype:`multipart/digest`, caso em que seria :mimetype:`message/rfc822`. Se o cabeçalho :mailheader:`Content-Type` tiver uma especificação de tipo inválida, o :rfc:`2045` exige que o tipo padrão seja :mimetype:`text/plain`.)

source: Return the message's main content type. This is the :mimetype:`maintype` part of the string returned by :meth:`get_content_type`.
pt_pt: Retorna o tipo de conteúdo principal da mensagem. Esta é a parte :mimetype:`maintype` da string retornada por :meth:`get_content_type`.

source: Return the message's sub-content type. This is the :mimetype:`subtype` part of the string returned by :meth:`get_content_type`.
pt_pt: Retorna o subtipo de conteúdo da mensagem. Esta é a parte :mimetype:`subtype` da string retornada por :meth:`get_content_type`.

source: Return the default content type. Most messages have a default content type of :mimetype:`text/plain`, except for messages that are subparts of :mimetype:`multipart/digest` containers. Such subparts have a default content type of :mimetype:`message/rfc822`.
pt_pt: Retorna o tipo de conteúdo padrão. A maioria das mensagens tem um tipo de conteúdo padrão de :mimetype:`text/plain`, exceto para mensagens que são subpartes de contentores :mimetype:`multipart/digest`. Essas subpartes têm um tipo de conteúdo padrão de :mimetype:`message/rfc822`.

source: Set the default content type. *ctype* should either be :mimetype:`text/plain` or :mimetype:`message/rfc822`, although this is not enforced. The default content type is not stored in the :mailheader:`Content-Type` header, so it only affects the return value of the ``get_content_type`` methods when no :mailheader:`Content-Type` header is present in the message.
pt_pt: Define o tipo de conteúdo padrão. *ctype* deve ser :mimetype:`text/plain` ou :mimetype:`message/rfc822`, embora isto não seja forçado. O tipo de conteúdo padrão não é armazenado no cabeçalho :mailheader:`Content-Type`, pelo que apenas afeta o valor de retorno dos métodos ``get_content_type`` quando não existe um cabeçalho :mailheader:`Content-Type` na mensagem.

source: Set a parameter in the :mailheader:`Content-Type` header. If the parameter already exists in the header, replace its value with *value*. When *header* is ``Content-Type`` (the default) and the header does not yet exist in the message, add it, set its value to :mimetype:`text/plain`, and append the new parameter value. Optional *header* specifies an alternative header to :mailheader:`Content-Type`.
pt_pt: Define um parâmetro no cabeçalho :mailheader:`Content-Type`. Se o parâmetro já existir no cabeçalho, substitui o seu valor por *valor*. Quando o *header* é ``Content-Type`` (o padrão) e o cabeçalho ainda não existe na mensagem, adiciona-o, define o seu valor para :mimetype:`text/plain` e anexa o novo valor do parâmetro. O parâmetro opcional *header* especifica um cabeçalho alternativo ao :mailheader:`Content-Type`.

source: If the value contains non-ASCII characters, the charset and language may be explicitly specified using the optional *charset* and *language* parameters. Optional *language* specifies the :rfc:`2231` language, defaulting to the empty string. Both *charset* and *language* should be strings. The default is to use the ``utf8`` *charset* and ``None`` for the *language*.
pt_pt: Se o valor contiver caracteres não-ASCII, o charset e o idioma podem ser explicitamente especificados utilizando os parâmetros opcionais *charset* e *language*. O parâmetro opcional *language* especifica o idioma :rfc:`2231`, com o valor padrão de uma string vazia. Tanto *charset* como *language* devem ser strings. O padrão é usar o *charset* ``utf8`` e ``None`` para o *language*.

source: If *replace* is ``False`` (the default) the header is moved to the end of the list of headers. If *replace* is ``True``, the header will be updated in place.
pt_pt: Se *replace* for ``False`` (o padrão), o cabeçalho é movido para o final da lista de cabeçalhos. Se *replace* for ``True``, o cabeçalho será atualizado no local.

source: Use of the *requote* parameter with :class:`EmailMessage` objects is deprecated.
pt_pt: O uso do parâmetro *requote* com objetos :class:`EmailMessage` é descontinuado (deprecated).

source: Note that existing parameter values of headers may be accessed through the :attr:`~email.headerregistry.ParameterizedMIMEHeader.params` attribute of the header value (for example, ``msg['Content-Type'].params['charset']``).
pt_pt: Note que os valores dos parâmetros existentes nos cabeçalhos podem ser acedidos através do atributo :attr:`~email.headerregistry.ParameterizedMIMEHeader.params` do valor do cabeçalho (por exemplo, ``msg['Content-Type'].params['charset']``).

source: ``replace`` keyword was added.
pt_pt: A palavra-chave ``replace`` foi adicionada.

source: Remove the given parameter completely from the :mailheader:`Content-Type` header. The header will be re-written in place without the parameter or its value. Optional *header* specifies an alternative to :mailheader:`Content-Type`.
pt_pt: Remove completamente o parâmetro fornecido do cabeçalho :mailheader:`Content-Type`. O cabeçalho será reescrito no local sem o parâmetro ou o seu valor. O parâmetro opcional *header* especifica uma alternativa ao :mailheader:`Content-Type`.

source: Return the value of the ``filename`` parameter of the :mailheader:`Content-Disposition` header of the message. If the header does not have a ``filename`` parameter, this method falls back to looking for the ``name`` parameter on the :mailheader:`Content-Type` header. If neither is found, or the header is missing, then *failobj* is returned. The returned string will always be unquoted as per :func:`email.utils.unquote`.
pt_pt: Retorna o valor do parâmetro ``filename`` do cabeçalho :mailheader:`Content-Disposition` da mensagem. Se o cabeçalho não tiver um parâmetro ``filename``, este método tenta encontrar o parâmetro ``name`` no cabeçalho :mailheader:`Content-Type`. Se nenhum for encontrado, ou se o cabeçalho estiver em falta, então *failobj* é retornado. A string retornada será sempre desaspada conforme :func:`email.utils.unquote`.

source: Return the value of the ``boundary`` parameter of the :mailheader:`Content-Type` header of the message, or *failobj* if either the header is missing, or has no ``boundary`` parameter. The returned string will always be unquoted as per :func:`email.utils.unquote`.
pt_pt: Retorna o valor do parâmetro ``boundary`` do cabeçalho :mailheader:`Content-Type` da mensagem, ou *failobj* se o cabeçalho estiver em falta ou não tiver um parâmetro ``boundary``. A string retornada será sempre desaspada conforme :func:`email.utils.unquote`.

source: Set the ``boundary`` parameter of the :mailheader:`Content-Type` header to *boundary*. :meth:`set_boundary` will always quote *boundary* if necessary. A :exc:`~email.errors.HeaderParseError` is raised if the message object has no :mailheader:`Content-Type` header.
pt_pt: Define o parâmetro ``boundary`` do cabeçalho :mailheader:`Content-Type` para *boundary*. O método :meth:`set_boundary` irá sempre colocar o *boundary* entre aspas, se necessário. Um :exc:`~email.errors.HeaderParseError` é lançado se o objeto de mensagem não tiver um cabeçalho :mailheader:`Content-Type`.

source: Note that using this method is subtly different from deleting the old :mailheader:`Content-Type` header and adding a new one with the new boundary via :meth:`add_header`, because :meth:`set_boundary` preserves the order of the :mailheader:`Content-Type` header in the list of headers.
pt_pt: Note que usar este método é subtilmente diferente de eliminar o antigo cabeçalho :mailheader:`Content-Type` e adicionar um novo com o novo limite através de :meth:`add_header`, porque o :meth:`set_boundary` preserva a ordem do cabeçalho :mailheader:`Content-Type` na lista de cabeçalhos.

source: Return the ``charset`` parameter of the :mailheader:`Content-Type` header, coerced to lower case. If there is no :mailheader:`Content-Type` header, or if that header has no ``charset`` parameter, *failobj* is returned.
pt_pt: Retorna o parâmetro ``charset`` do cabeçalho :mailheader:`Content-Type`, convertido para minúsculas. Se não houver cabeçalho :mailheader:`Content-Type`, ou se esse cabeçalho não tiver um parâmetro ``charset``, *failobj* é retornado.

source: Return a list containing the character set names in the message. If the message is a :mimetype:`multipart`, then the list will contain one element for each subpart in the payload, otherwise, it will be a list of length 1.
pt_pt: Retorna uma lista contendo os nomes dos conjuntos de caracteres na mensagem. Se a mensagem for um :mimetype:`multipart`, então a lista conterá um elemento para cada subparte no payload, caso contrário, será uma lista de comprimento 1.

source: Each item in the list will be a string which is the value of the ``charset`` parameter in the :mailheader:`Content-Type` header for the represented subpart. If the subpart has no :mailheader:`Content-Type` header, no ``charset`` parameter, or is not of the :mimetype:`text` main MIME type, then that item in the returned list will be *failobj*.
pt_pt: Cada item na lista será uma string com o valor do parâmetro ``charset`` no cabeçalho :mailheader:`Content-Type` para a subparte representada. Se a subparte não tiver um cabeçalho :mailheader:`Content-Type`, não tiver parâmetro ``charset`` ou não for do tipo MIME principal :mimetype:`text`, então esse item na lista retornada será *failobj*.

source: Return ``True`` if there is a :mailheader:`Content-Disposition` header and its (case insensitive) value is ``attachment``, ``False`` otherwise.
pt_pt: Retorna ``True`` se existir um cabeçalho :mailheader:`Content-Disposition` e o seu valor (insensível a maiúsculas) for ``attachment``, caso contrário retorna ``False``.

source: is_attachment is now a method instead of a property, for consistency with :meth:`~email.message.Message.is_multipart`.
pt_pt: is_attachment é agora um método em vez de uma propriedade, para consistência com :meth:`~email.message.Message.is_multipart`.

source: Return the lowercased value (without parameters) of the message's :mailheader:`Content-Disposition` header if it has one, or ``None``. The possible values for this method are *inline*, *attachment* or ``None`` if the message follows :rfc:`2183`.
pt_pt: Retorna o valor em minúsculas (sem parâmetros) do cabeçalho :mailheader:`Content-Disposition` da mensagem, se tiver um, ou ``None``. Os valores possíveis para este método são *inline*, *attachment* ou ``None`` se a mensagem seguir o :rfc:`2183`.

source: The following methods relate to interrogating and manipulating the content (payload) of the message.
pt_pt: Os métodos seguintes relacionam-se com a interrogação e manipulação do conteúdo (payload) da mensagem.

source: The :meth:`walk` method is an all-purpose generator which can be used to iterate over all the parts and subparts of a message object tree, in depth-first traversal order. You will typically use :meth:`walk` as the iterator in a ``for`` loop; each iteration returns the next subpart.
pt_pt: O método :meth:`walk` é um gerador de uso geral que pode ser usado para iterar sobre todas as partes e subpartes de uma árvore de objetos de mensagem, em ordem de travessia em profundidade (depth-first). Tipicamente, usará o :meth:`walk` como o iterador num ciclo ``for``; cada iteração retorna a subparte seguinte.

source: Here's an example that prints the MIME type of every part of a multipart message structure:
pt_pt: Eis um exemplo que imprime o tipo MIME de cada parte de uma estrutura de mensagem multiparte:

source: ``walk`` iterates over the subparts of any part where :meth:`is_multipart` returns ``True``, even though ``msg.get_content_maintype() == 'multipart'`` may return ``False``. We can see this in our example by making use of the ``_structure`` debug helper function:
pt_pt: O ``walk`` itera sobre as subpartes de qualquer parte onde :meth:`is_multipart` retorne ``True``, mesmo que ``msg.get_content_maintype() == 'multipart'`` possa retornar ``False``. Podemos ver isto no nosso exemplo utilizando a função auxiliar de depuração ``_structure``:

source: Here the ``message`` parts are not ``multiparts``, but they do contain subparts. ``is_multipart()`` returns ``True`` and ``walk`` descends into the subparts.
pt_pt: Aqui, as partes ``message`` não são ``multiparts``, mas contêm subpartes. O método ``is_multipart()`` retorna ``True`` e o ``walk`` desce para as subpartes.

source: Return the MIME part that is the best candidate to be the "body" of the message.
pt_pt: Retorna a parte MIME que é a melhor candidata a ser o "corpo" (body) da mensagem.

source: *preferencelist* must be a sequence of strings from the set ``related``, ``html``, and ``plain``, and indicates the order of preference for the content type of the part returned.
pt_pt: *preferencelist* deve ser uma sequência de strings do conjunto ``related``, ``html``, e ``plain``, e indica a ordem de preferência para o tipo de conteúdo da parte retornada.

source: Start looking for candidate matches with the object on which the ``get_body`` method is called.
pt_pt: Começa a procurar correspondências candidatas com o objeto sobre o qual o método ``get_body`` é chamado.

source: If ``related`` is not included in *preferencelist*, consider the root part (or subpart of the root part) of any related encountered as a candidate if the (sub-)part matches a preference.
pt_pt: Se ``related`` não for incluído na *preferencelist*, considera a parte raiz (ou subparte da parte raiz) de qualquer elemento relacionado encontrado como candidata se a (sub-)parte corresponder a uma preferência.

source: When encountering a ``multipart/related``, check the ``start`` parameter and if a part with a matching :mailheader:`Content-ID` is found, consider only it when looking for candidate matches. Otherwise consider only the first (default root) part of the ``multipart/related``.
pt_pt: Ao encontrar um ``multipart/related``, verifica o parâmetro ``start`` e, se for encontrada uma parte com um :mailheader:`Content-ID` correspondente, considera apenas essa parte ao procurar correspondências candidatas. Caso contrário, considera apenas a primeira parte (raiz padrão) do ``multipart/related``.

source: If a part has a :mailheader:`Content-Disposition` header, only consider the part a candidate match if the value of the header is ``inline``.
pt_pt: Se uma parte tiver um cabeçalho :mailheader:`Content-Disposition`, apenas considera a parte como uma correspondência candidata se o valor do cabeçalho for ``inline``.

source: If none of the candidates matches any of the preferences in *preferencelist*, return ``None``.
pt_pt: Se nenhum dos candidatos corresponder a qualquer das preferências na *preferencelist*, retorna ``None``.

source: The format of a MIME document allows for some text between the blank line following the headers, and the first multipart boundary string. Normally, this text is never visible in a MIME-aware mail reader because it falls outside the standard MIME armor. However, when viewing the raw text of the message, or when viewing the message in a non-MIME aware reader, this text can become visible.
pt_pt: O formato de um documento MIME permite algum texto entre a linha em branco após os cabeçalhos e a primeira string de limite multiparte. Normalmente, este texto nunca é visível num leitor de correio com consciência MIME porque cai fora da blindagem MIME padrão. No entanto, ao visualizar o texto bruto da mensagem ou ao visualizar a mensagem num leitor sem consciência MIME, este texto pode tornar-se visível.

source: The *preamble* attribute contains this leading extra-armor text for MIME documents. When the :class:`~email.parser.Parser` discovers some text after the headers but before the first boundary string, it assigns this text to the message's *preamble* attribute. When the :class:`~email.generator.Generator` is writing out the plain text representation of a MIME message, and it finds the message has a *preamble* attribute, it will write this text in the area between the headers and the first boundary. See :mod:`email.parser` and :mod:`email.generator` for details.
pt_pt: O atributo *preamble* contém este texto extra-armadura inicial para documentos MIME. Quando o :class:`~email.parser.Parser` descobre algum texto após os cabeçalhos, mas antes da primeira string de limite, atribui este texto ao atributo *preamble* da mensagem. Quando o :class:`~email.generator.Generator` está a escrever a representação de texto simples de uma mensagem MIME e encontra que a mensagem tem um atributo *preamble*, escreverá este texto na área entre os cabeçalhos e o primeiro limite. Consulte :mod:`email.parser` e :mod:`email.generator` para mais detalhes.

source: Note that if the message object has no preamble, the *preamble* attribute will be ``None``.
pt_pt: Note que se o objeto mensagem não tiver preâmbulo, o atributo *preamble* será ``None``.

source: The *defects* attribute contains a list of all the problems found when parsing this message. See :mod:`email.errors` for a detailed description of the possible parsing defects.
pt_pt: O atributo *defects* contém uma lista de todos os problemas encontrados ao analisar esta mensagem. Consulte :mod:`email.errors` para uma descrição detalhada dos possíveis defeitos de análise.

source: Footnotes
pt_pt: Notas de rodapé
