Repository: NyaPuma/python-docs-pt
Catalog: library/email.mime.po
Languages: pt_pt

source: :mod:`!email.mime`: Creating email and MIME objects from scratch
pt_pt: :mod:`!email.mime`: Criação de objetos de email e MIME do zero

source: **Source code:** :source:`Lib/email/mime/`
pt_pt: **Código fonte:** :source:`Lib/email/mime/`

source: This module is part of the legacy (``Compat32``) email API. Its functionality is partially replaced by the :mod:`~email.contentmanager` in the new API, but in certain applications these classes may still be useful, even in non-legacy code.
pt_pt: Este módulo faz parte da API de email legada (``Compat32``). A sua funcionalidade é parcialmente substituída pelo :mod:`~email.contentmanager` na nova API, mas em certas aplicações estas classes ainda podem ser úteis, mesmo em código não legado.

source: Ordinarily, you get a message object structure by passing a file or some text to a parser, which parses the text and returns the root message object. However you can also build a complete message structure from scratch, or even individual :class:`~email.message.Message` objects by hand. In fact, you can also take an existing structure and add new :class:`~email.message.Message` objects, move them around, etc. This makes a very convenient interface for slicing-and-dicing MIME messages.
pt_pt: Normalmente, obtém-se uma estrutura de objeto de mensagem passando um ficheiro ou algum texto a um analisador (*parser*), que processa o texto e retorna o objeto de mensagem raiz. No entanto, também pode construir uma estrutura de mensagem completa do zero, ou até objetos :class:`~email.message.Message` individuais manualmente. De facto, pode também pegar numa estrutura existente e adicionar novos objetos :class:`~email.message.Message`, movê-los, etc. Isto torna a interface muito conveniente para manipular mensagens MIME minuciosamente.

source: You can create a new object structure by creating :class:`~email.message.Message` instances, adding attachments and all the appropriate headers manually. For MIME messages though, the :mod:`email` package provides some convenient subclasses to make things easier.
pt_pt: Pode criar uma nova estrutura de objetos criando instâncias de :class:`~email.message.Message`, adicionando anexos e todos os cabeçalhos apropriados manualmente. Para mensagens MIME, contudo, o pacote :mod:`email` fornece algumas subclasses convenientes para facilitar o processo.

source: Here are the classes:
pt_pt: Aqui estão as classes:

source: Module: :mod:`email.mime.base`
pt_pt: Módulo: :mod:`email.mime.base`

source: This is the base class for all the MIME-specific subclasses of :class:`~email.message.Message`. Ordinarily you won't create instances specifically of :class:`MIMEBase`, although you could. :class:`MIMEBase` is provided primarily as a convenient base class for more specific MIME-aware subclasses.
pt_pt: Esta é a classe base para todas as subclasses específicas de MIME de :class:`~email.message.Message`. Normalmente não criará instâncias especificamente de :class:`MIMEBase`, embora o possa fazer. A :class:`MIMEBase` é fornecida principalmente como uma classe base conveniente para subclasses mais específicas que lidam com MIME.

source: *_maintype* is the :mailheader:`Content-Type` major type (e.g. :mimetype:`text` or :mimetype:`image`), and *_subtype* is the :mailheader:`Content-Type` minor type (e.g. :mimetype:`plain` or :mimetype:`gif`). *_params* is a parameter key/value dictionary and is passed directly to :meth:`Message.add_header <email.message.Message.add_header>`.
pt_pt: *_maintype* é o tipo principal de :mailheader:`Content-Type` (ex: :mimetype:`text` ou :mimetype:`image`), e *_subtype* é o tipo secundário de :mailheader:`Content-Type` (ex: :mimetype:`plain` ou :mimetype:`gif`). *_params* é um dicionário de chave/valor de parâmetros e é passado diretamente para :meth:`Message.add_header <email.message.Message.add_header>`.

source: If *policy* is specified, (defaults to the :class:`compat32 <email.policy.Compat32>` policy) it will be passed to :class:`~email.message.Message`.
pt_pt: Se *policy* for especificada (o padrão é a política :class:`compat32 <email.policy.Compat32>`), será passada para :class:`~email.message.Message`.

source: The :class:`MIMEBase` class always adds a :mailheader:`Content-Type` header (based on *_maintype*, *_subtype*, and *_params*), and a :mailheader:`MIME-Version` header (always set to ``1.0``).
pt_pt: A classe :class:`MIMEBase` adiciona sempre um cabeçalho :mailheader:`Content-Type` (baseado em *_maintype*, *_subtype* e *_params*) e um cabeçalho :mailheader:`MIME-Version` (sempre definido como ``1.0``).

source: Added *policy* keyword-only parameter.
pt_pt: Adicionado o parâmetro *policy* apenas por palavra-chave.

source: Module: :mod:`email.mime.nonmultipart`
pt_pt: Módulo: :mod:`email.mime.nonmultipart`

source: A subclass of :class:`~email.mime.base.MIMEBase`, this is an intermediate base class for MIME messages that are not :mimetype:`multipart`. The primary purpose of this class is to prevent the use of the :meth:`~email.message.Message.attach` method, which only makes sense for :mimetype:`multipart` messages. If :meth:`~email.message.Message.attach` is called, a :exc:`~email.errors.MultipartConversionError` exception is raised.
pt_pt: Uma subclasse de :class:`~email.mime.base.MIMEBase`, esta é uma classe base intermédia para mensagens MIME que não são :mimetype:`multipart`. O propósito principal desta classe é impedir o uso do método :meth:`~email.message.Message.attach`, que apenas faz sentido para mensagens :mimetype:`multipart`. Se :meth:`~email.message.Message.attach` for chamado, é lançada a exceção :exc:`~email.errors.MultipartConversionError`.

source: Module: :mod:`email.mime.multipart`
pt_pt: Módulo: :mod:`email.mime.multipart`

source: A subclass of :class:`~email.mime.base.MIMEBase`, this is an intermediate base class for MIME messages that are :mimetype:`multipart`. Optional *_subtype* defaults to :mimetype:`mixed`, but can be used to specify the subtype of the message. A :mailheader:`Content-Type` header of :mimetype:`multipart/_subtype` will be added to the message object. A :mailheader:`MIME-Version` header will also be added.
pt_pt: Uma subclasse de :class:`~email.mime.base.MIMEBase`, esta é uma classe base intermédia para mensagens MIME que são :mimetype:`multipart`. O *_subtype* opcional tem como padrão :mimetype:`mixed`, mas pode ser usado para especificar o subtipo da mensagem. Um cabeçalho :mailheader:`Content-Type` de :mimetype:`multipart/_subtype` será adicionado ao objeto de mensagem. Será também adicionado um cabeçalho :mailheader:`MIME-Version`.

source: Optional *boundary* is the multipart boundary string. When ``None`` (the default), the boundary is calculated when needed (for example, when the message is serialized).
pt_pt: *boundary* opcional é a string delimitadora multipart. Quando ``None`` (o padrão), o delimitador é calculado quando necessário (por exemplo, quando a mensagem é serializada).

source: *_subparts* is a sequence of initial subparts for the payload. It must be possible to convert this sequence to a list. You can always attach new subparts to the message by using the :meth:`Message.attach <email.message.Message.attach>` method.
pt_pt: *_subparts* é uma sequência de subpartes iniciais para o payload. Deve ser possível converter esta sequência para uma lista. Pode sempre anexar novas subpartes à mensagem utilizando o método :meth:`Message.attach <email.message.Message.attach>`.

source: Module: :mod:`email.mime.application`
pt_pt: Módulo: :mod:`email.mime.application`

source: A subclass of :class:`~email.mime.nonmultipart.MIMENonMultipart`, the :class:`MIMEApplication` class is used to represent MIME message objects of major type :mimetype:`application`. *_data* contains the bytes for the raw application data. Optional *_subtype* specifies the MIME subtype and defaults to :mimetype:`octet-stream`.
pt_pt: Uma subclasse de :class:`~email.mime.nonmultipart.MIMENonMultipart`, a classe :class:`MIMEApplication` é utilizada para representar objetos de mensagem MIME do tipo principal :mimetype:`application`. *_data* contém os bytes para os dados brutos da aplicação. O *_subtype* opcional especifica o subtipo MIME e tem como padrão :mimetype:`octet-stream`.

source: Module: :mod:`email.mime.audio`
pt_pt: Módulo: :mod:`email.mime.audio`

source: A subclass of :class:`~email.mime.nonmultipart.MIMENonMultipart`, the :class:`MIMEAudio` class is used to create MIME message objects of major type :mimetype:`audio`. *_audiodata* contains the bytes for the raw audio data. If this data can be decoded as au, wav, aiff, or aifc, then the subtype will be automatically included in the :mailheader:`Content-Type` header. Otherwise you can explicitly specify the audio subtype via the *_subtype* argument. If the minor type could not be guessed and *_subtype* was not given, then :exc:`TypeError` is raised.
pt_pt: Uma subclasse de :class:`~email.mime.nonmultipart.MIMENonMultipart`, a classe :class:`MIMEAudio` é usada para criar objetos de mensagem MIME do tipo principal :mimetype:`audio`. *_audiodata* contém os bytes para os dados brutos de áudio. Se estes dados puderem ser descodificados como au, wav, aiff ou aifc, o subtipo será automaticamente incluído no cabeçalho :mailheader:`Content-Type`. Caso contrário, pode especificar explicitamente o subtipo de áudio através do argumento *_subtype*. Se o tipo secundário não puder ser adivinhado e o *_subtype* não for fornecido, é lançado :exc:`TypeError`.

source: Module: :mod:`email.mime.image`
pt_pt: Módulo: :mod:`email.mime.image`

source: A subclass of :class:`~email.mime.nonmultipart.MIMENonMultipart`, the :class:`MIMEImage` class is used to create MIME message objects of major type :mimetype:`image`. *_imagedata* contains the bytes for the raw image data. If this data type can be detected (jpeg, png, gif, tiff, rgb, pbm, pgm, ppm, rast, xbm, bmp, webp, and exr attempted), then the subtype will be automatically included in the :mailheader:`Content-Type` header. Otherwise you can explicitly specify the image subtype via the *_subtype* argument. If the minor type could not be guessed and *_subtype* was not given, then :exc:`TypeError` is raised.
pt_pt: Uma subclasse de :class:`~email.mime.nonmultipart.MIMENonMultipart`, a classe :class:`MIMEImage` é utilizada para criar objetos de mensagem MIME do tipo principal :mimetype:`image`. *_imagedata* contém os bytes para os dados brutos da imagem. Se este tipo de dados puder ser detetado (são tentados jpeg, png, gif, tiff, rgb, pbm, pgm, ppm, rast, xbm, bmp, webp e exr), o subtipo será automaticamente incluído no cabeçalho :mailheader:`Content-Type`. Caso contrário, pode especificar explicitamente o subtipo de imagem através do argumento *_subtype*. Se o tipo secundário não puder ser adivinhado e o *_subtype* não for fornecido, é lançado :exc:`TypeError`.

source: Module: :mod:`email.mime.message`
pt_pt: Módulo: :mod:`email.mime.message`

source: A subclass of :class:`~email.mime.nonmultipart.MIMENonMultipart`, the :class:`MIMEMessage` class is used to create MIME objects of main type :mimetype:`message`. *_msg* is used as the payload, and must be an instance of class :class:`~email.message.Message` (or a subclass thereof), otherwise a :exc:`TypeError` is raised.
pt_pt: Uma subclasse de :class:`~email.mime.nonmultipart.MIMENonMultipart`, a classe :class:`MIMEMessage` é utilizada para criar objetos MIME do tipo principal :mimetype:`message`. *_msg* é usado como payload e deve ser uma instância da classe :class:`~email.message.Message` (ou uma subclasse da mesma), caso contrário é lançado :exc:`TypeError`.

source: Module: :mod:`email.mime.text`
pt_pt: Módulo: :mod:`email.mime.text`

source: A subclass of :class:`~email.mime.nonmultipart.MIMENonMultipart`, the :class:`MIMEText` class is used to create MIME objects of major type :mimetype:`text`. *_text* is the string for the payload. *_subtype* is the minor type and defaults to :mimetype:`plain`. *_charset* is the character set of the text and is passed as an argument to the :class:`~email.mime.nonmultipart.MIMENonMultipart` constructor; it defaults to ``us-ascii`` if the string contains only ``ascii`` code points, and ``utf-8`` otherwise. The *_charset* parameter accepts either a string or a :class:`~email.charset.Charset` instance.
pt_pt: Uma subclasse de :class:`~email.mime.nonmultipart.MIMENonMultipart`, a classe :class:`MIMEText` é usada para criar objetos MIME do tipo principal :mimetype:`text`. *_text* é a string para o payload. *_subtype* é o tipo secundário e tem como padrão :mimetype:`plain`. *_charset* é o conjunto de caracteres do texto e é passado como argumento ao construtor de :class:`~email.mime.nonmultipart.MIMENonMultipart`; o padrão é ``us-ascii`` se a string contiver apenas pontos de código ``ascii``, e ``utf-8`` caso contrário. O parâmetro *_charset* aceita uma string ou uma instância de :class:`~email.charset.Charset`.
