Repository: NyaPuma/python-docs-pt
Catalog: library/errno.po
Languages: pt_pt

source: :mod:`!errno` --- Standard errno system symbols
pt_pt: :mod:`!errno` --- Símbolos do sistema errno padrão

source: This module makes available standard ``errno`` system symbols. The value of each symbol is the corresponding integer value. The names and descriptions are borrowed from :file:`linux/include/errno.h`, which should be all-inclusive.
pt_pt: Este módulo disponibiliza os símbolos do sistema ``errno`` padrão. O valor de cada símbolo é o valor inteiro correspondente. Os nomes e descrições são retirados de :file:`linux/include/errno.h`, que deve ser abrangente.

source: Dictionary providing a mapping from the errno value to the string name in the underlying system. For instance, ``errno.errorcode[errno.EPERM]`` maps to ``'EPERM'``.
pt_pt: Dicionário que fornece um mapeamento do valor errno para o nome da string no sistema subjacente. Por exemplo, ``errno.errorcode[errno.EPERM]`` mapeia para ``'EPERM'``.

source: To translate a numeric error code to an error message, use :func:`os.strerror`.
pt_pt: Para traduzir um código de erro numérico para uma mensagem de erro, use :func:`os.strerror`.

source: Of the following list, symbols that are not used on the current platform are not defined by the module. The specific list of defined symbols is available as ``errno.errorcode.keys()``. Symbols available can include:
pt_pt: Da lista seguinte, os símbolos que não são usados na plataforma atual não são definidos pelo módulo. A lista específica de símbolos definidos está disponível como ``errno.errorcode.keys()``. Os símbolos disponíveis podem incluir:

source: Operation not permitted. This error is mapped to the exception :exc:`PermissionError`.
pt_pt: Operação não permitida. Este erro é mapeado para a exceção :exc:`PermissionError`.

source: No such file or directory. This error is mapped to the exception :exc:`FileNotFoundError`.
pt_pt: Ficheiro ou diretório inexistente. Este erro é mapeado para a exceção :exc:`FileNotFoundError`.

source: No such process. This error is mapped to the exception :exc:`ProcessLookupError`.
pt_pt: Processo inexistente. Este erro é mapeado para a exceção :exc:`ProcessLookupError`.

source: Interrupted system call. This error is mapped to the exception :exc:`InterruptedError`.
pt_pt: Chamada de sistema interrompida. Este erro é mapeado para a exceção :exc:`InterruptedError`.

source: I/O error
pt_pt: Erro de E/S

source: No such device or address
pt_pt: Dispositivo ou endereço inexistente

source: Arg list too long
pt_pt: Lista de argumentos demasiado longa

source: Exec format error
pt_pt: Erro de formato de execução

source: Bad file number
pt_pt: Número de ficheiro inválido

source: No child processes. This error is mapped to the exception :exc:`ChildProcessError`.
pt_pt: Sem processos filhos. Este erro é mapeado para a exceção :exc:`ChildProcessError`.

source: Try again. This error is mapped to the exception :exc:`BlockingIOError`.
pt_pt: Tente novamente. Este erro é mapeado para a exceção :exc:`BlockingIOError`.

source: Out of memory
pt_pt: Sem memória

source: Permission denied. This error is mapped to the exception :exc:`PermissionError`.
pt_pt: Permissão negada. Este erro é mapeado para a exceção :exc:`PermissionError`.

source: Bad address
pt_pt: Endereço inválido

source: Block device required
pt_pt: Dispositivo de bloco necessário

source: Device or resource busy
pt_pt: Dispositivo ou recurso ocupado

source: File exists. This error is mapped to the exception :exc:`FileExistsError`.
pt_pt: Ficheiro já existe. Este erro é mapeado para a exceção :exc:`FileExistsError`.

source: Cross-device link
pt_pt: Ligação entre dispositivos

source: No such device
pt_pt: Dispositivo inexistente

source: Not a directory. This error is mapped to the exception :exc:`NotADirectoryError`.
pt_pt: Não é um diretório. Este erro é mapeado para a exceção :exc:`NotADirectoryError`.

source: Is a directory. This error is mapped to the exception :exc:`IsADirectoryError`.
pt_pt: É um diretório. Este erro é mapeado para a exceção :exc:`IsADirectoryError`.

source: Invalid argument
pt_pt: Argumento inválido

source: File table overflow
pt_pt: Transbordo da tabela de ficheiros

source: Too many open files
pt_pt: Ficheiros abertos a mais

source: Not a typewriter
pt_pt: Não é uma máquina de escrever

source: Text file busy
pt_pt: Ficheiro de texto ocupado

source: File too large
pt_pt: Ficheiro demasiado grande

source: No space left on device
pt_pt: Sem espaço no dispositivo

source: Illegal seek
pt_pt: Procura ilegal

source: Read-only file system
pt_pt: Sistema de ficheiros só de leitura

source: Too many links
pt_pt: Ligações a mais

source: Broken pipe. This error is mapped to the exception :exc:`BrokenPipeError`.
pt_pt: Tubo partido. Este erro é mapeado para a exceção :exc:`BrokenPipeError`.

source: Math argument out of domain of func
pt_pt: Argumento matemático fora do domínio da função

source: Math result not representable
pt_pt: Resultado matemático não representável

source: Resource deadlock would occur
pt_pt: Ocorreria um impasse de recursos

source: File name too long
pt_pt: Nome de ficheiro demasiado longo

source: No record locks available
pt_pt: Sem bloqueios de registo disponíveis

source: Function not implemented
pt_pt: Função não implementada

source: Directory not empty
pt_pt: Diretório não vazio

source: Too many symbolic links encountered
pt_pt: Demasiadas ligações simbólicas encontradas

source: Operation would block. This error is mapped to the exception :exc:`BlockingIOError`.
pt_pt: Operação bloquearia. Este erro é mapeado para a exceção :exc:`BlockingIOError`.

source: No message of desired type
pt_pt: Sem mensagem do tipo desejado

source: Identifier removed
pt_pt: Identificador removido

source: Channel number out of range
pt_pt: Número de canal fora do intervalo

source: Level 2 not synchronized
pt_pt: Nível 2 não sincronizado

source: Level 3 halted
pt_pt: Nível 3 parado

source: Level 3 reset
pt_pt: Nível 3 reiniciado

source: Link number out of range
pt_pt: Número de ligação fora do intervalo

source: Protocol driver not attached
pt_pt: Controlador de protocolo não anexado

source: No CSI structure available
pt_pt: Sem estrutura CSI disponível

source: Level 2 halted
pt_pt: Nível 2 parado

source: Invalid exchange
pt_pt: Troca inválida

source: Invalid request descriptor
pt_pt: Descritor de pedido inválido

source: Exchange full
pt_pt: Troca cheia

source: No anode
pt_pt: Sem ânodo

source: Invalid request code
pt_pt: Código de pedido inválido

source: Invalid slot
pt_pt: Slot inválido

source: File locking deadlock error
pt_pt: Erro de impasse de bloqueio de ficheiro

source: Bad font file format
pt_pt: Formato de ficheiro de tipo de letra inválido

source: Device not a stream
pt_pt: Dispositivo não é um fluxo

source: No data available
pt_pt: Sem dados disponíveis

source: Timer expired
pt_pt: Temporizador expirado

source: Out of streams resources
pt_pt: Sem recursos de fluxos

source: Machine is not on the network
pt_pt: Máquina não está na rede

source: Package not installed
pt_pt: Pacote não instalado

source: Object is remote
pt_pt: Objeto é remoto

source: Link has been severed
pt_pt: Ligação foi cortada

source: Advertise error
pt_pt: Erro de anúncio

source: Srmount error
pt_pt: Erro de srmount

source: Communication error on send
pt_pt: Erro de comunicação ao enviar

source: Protocol error
pt_pt: Erro de protocolo

source: Multihop attempted
pt_pt: Tentativa de multihop

source: RFS specific error
pt_pt: Erro específico do RFS

source: Not a data message
pt_pt: Não é uma mensagem de dados

source: Value too large for defined data type
pt_pt: Valor demasiado grande para o tipo de dados definido

source: Name not unique on network
pt_pt: Nome não único na rede

source: File descriptor in bad state
pt_pt: Descritor de ficheiro em estado inválido

source: Remote address changed
pt_pt: Endereço remoto alterado

source: Can not access a needed shared library
pt_pt: Não é possível aceder a uma biblioteca partilhada necessária

source: Accessing a corrupted shared library
pt_pt: A aceder a uma biblioteca partilhada corrompida

source: .lib section in a.out corrupted
pt_pt: Secção .lib em a.out corrompida

source: Attempting to link in too many shared libraries
pt_pt: Tentativa de ligar demasiadas bibliotecas partilhadas

source: Cannot exec a shared library directly
pt_pt: Não é possível executar diretamente uma biblioteca partilhada

source: Illegal byte sequence
pt_pt: Sequência de bytes ilegal

source: Interrupted system call should be restarted
pt_pt: Chamada de sistema interrompida deve ser reiniciada

source: Streams pipe error
pt_pt: Erro de tubo de fluxos

source: Too many users
pt_pt: Demasiados utilizadores

source: Socket operation on non-socket
pt_pt: Operação de socket em não-socket

source: Destination address required
pt_pt: Endereço de destino necessário

source: Message too long
pt_pt: Mensagem demasiado longa

source: Protocol wrong type for socket
pt_pt: Tipo de protocolo errado para socket

source: Protocol not available
pt_pt: Protocolo não disponível

source: Protocol not supported
pt_pt: Protocolo não suportado

source: Socket type not supported
pt_pt: Tipo de socket não suportado

source: Operation not supported on transport endpoint
pt_pt: Operação não suportada no ponto final de transporte

source: Operation not supported
pt_pt: Operação não suportada

source: Protocol family not supported
pt_pt: Família de protocolos não suportada

source: Address family not supported by protocol
pt_pt: Família de endereços não suportada pelo protocolo

source: Address already in use
pt_pt: Endereço já em uso

source: Cannot assign requested address
pt_pt: Não é possível atribuir o endereço solicitado

source: Network is down
pt_pt: Rede inativa

source: Network is unreachable
pt_pt: Rede inacessível

source: Network dropped connection because of reset
pt_pt: Rede cortou ligação devido a reinício

source: Software caused connection abort. This error is mapped to the exception :exc:`ConnectionAbortedError`.
pt_pt: Aborto de ligação causado por software. Este erro é mapeado para a exceção :exc:`ConnectionAbortedError`.

source: Connection reset by peer. This error is mapped to the exception :exc:`ConnectionResetError`.
pt_pt: Ligação reiniciada pelo par. Este erro é mapeado para a exceção :exc:`ConnectionResetError`.

source: No buffer space available
pt_pt: Sem espaço de buffer disponível

source: Transport endpoint is already connected
pt_pt: Ponto final de transporte já ligado

source: Transport endpoint is not connected
pt_pt: Ponto final de transporte não ligado

source: Cannot send after transport endpoint shutdown. This error is mapped to the exception :exc:`BrokenPipeError`.
pt_pt: Não é possível enviar após o encerramento do ponto final de transporte. Este erro é mapeado para a exceção :exc:`BrokenPipeError`.

source: Too many references: cannot splice
pt_pt: Demasiadas referências: não é possível empalmar

source: Connection timed out. This error is mapped to the exception :exc:`TimeoutError`.
pt_pt: Tempo limite de ligação excedido. Este erro é mapeado para a exceção :exc:`TimeoutError`.

source: Connection refused. This error is mapped to the exception :exc:`ConnectionRefusedError`.
pt_pt: Ligação recusada. Este erro é mapeado para a exceção :exc:`ConnectionRefusedError`.

source: Host is down
pt_pt: Anfitrião inativo

source: No route to host
pt_pt: Sem rota para o anfitrião

source: Memory page has hardware error.
pt_pt: Página de memória com erro de hardware.

source: Operation already in progress. This error is mapped to the exception :exc:`BlockingIOError`.
pt_pt: Operação já em curso. Este erro é mapeado para a exceção :exc:`BlockingIOError`.

source: Operation now in progress. This error is mapped to the exception :exc:`BlockingIOError`.
pt_pt: Operação agora em curso. Este erro é mapeado para a exceção :exc:`BlockingIOError`.

source: Stale NFS file handle
pt_pt: Descritor de ficheiro NFS obsoleto

source: Structure needs cleaning
pt_pt: Estrutura necessita de limpeza

source: Not a XENIX named type file
pt_pt: Não é um ficheiro de tipo nomeado XENIX

source: No XENIX semaphores available
pt_pt: Sem semáforos XENIX disponíveis

source: Is a named type file
pt_pt: É um ficheiro de tipo nomeado

source: Remote I/O error
pt_pt: Erro de E/S remoto

source: Quota exceeded
pt_pt: Quota excedida

source: Interface output queue is full
pt_pt: Fila de saída da interface cheia

source: No medium found
pt_pt: Sem suporte encontrado

source: Wrong medium type
pt_pt: Tipo de suporte errado

source: Required key not available
pt_pt: Chave necessária não disponível

source: Key has expired
pt_pt: Chave expirada

source: Key has been revoked
pt_pt: Chave revogada

source: Key was rejected by service
pt_pt: Chave rejeitada pelo serviço

source: Operation not possible due to RF-kill
pt_pt: Operação não possível devido a RF-kill

source: Locked lock was unmapped
pt_pt: Bloqueio bloqueado foi desmapeado

source: Facility is not active
pt_pt: Instalação não está ativa

source: Authentication error
pt_pt: Erro de autenticação

source: Bad CPU type in executable
pt_pt: Tipo de CPU inválido no executável

source: Bad executable (or shared library)
pt_pt: Executável (ou biblioteca partilhada) inválido

source: Malformed Mach-o file
pt_pt: Ficheiro Mach-o malformado

source: Device error
pt_pt: Erro de dispositivo

source: Inappropriate file type or format
pt_pt: Tipo ou formato de ficheiro inadequado

source: Need authenticator
pt_pt: Necessário autenticador

source: Attribute not found
pt_pt: Atributo não encontrado

source: Policy not found
pt_pt: Política não encontrada

source: Too many processes
pt_pt: Demasiados processos

source: Bad procedure for program
pt_pt: Procedimento inválido para o programa

source: Program version wrong
pt_pt: Versão do programa errada

source: RPC prog. not avail
pt_pt: Programa RPC não disponível

source: Device power is off
pt_pt: Dispositivo desligado

source: RPC struct is bad
pt_pt: Estrutura RPC inválida

source: RPC version wrong
pt_pt: Versão RPC errada

source: Shared library version mismatch
pt_pt: Incompatibilidade de versão de biblioteca partilhada

source: Capabilities insufficient. This error is mapped to the exception :exc:`PermissionError`.
pt_pt: Capacidades insuficientes. Este erro é mapeado para a exceção :exc:`PermissionError`.

source: Availability
pt_pt: Disponibilidade

source: Operation canceled
pt_pt: Operação cancelada

source: Owner died
pt_pt: Proprietário morreu

source: State not recoverable
pt_pt: Estado não recuperável
