Repository: NyaPuma/python-docs-pt
Catalog: library/fileinput.po
Languages: pt_pt

source: :mod:`!fileinput` --- Iterate over lines from multiple input streams
pt_pt: :mod:`!fileinput` --- Iterar sobre linhas de múltiplos fluxos de entrada

source: **Source code:** :source:`Lib/fileinput.py`
pt_pt: **Código-fonte:** :source:`Lib/fileinput.py`

source: This module implements a helper class and functions to quickly write a loop over standard input or a list of files. If you just want to read or write one file see :func:`open`.
pt_pt: Este módulo implementa uma classe auxiliar e funções para escrever rapidamente um loop sobre a entrada padrão (stdin) ou uma lista de ficheiros. Se pretender apenas ler ou escrever num ficheiro, veja :func:`open`.

source: The typical use is::
pt_pt: O uso típico é::

source: This iterates over the lines of all files listed in ``sys.argv[1:]``, defaulting to ``sys.stdin`` if the list is empty. If a filename is ``'-'``, it is also replaced by ``sys.stdin`` and the optional arguments *mode* and *openhook* are ignored. To specify an alternative list of filenames, pass it as the first argument to :func:`.input`. A single file name is also allowed.
pt_pt: Isto itera sobre as linhas de todos os ficheiros listados em ``sys.argv[1:]``, utilizando por predefinição o ``sys.stdin`` se a lista estiver vazia. Se um nome de ficheiro for ``'-'``, este também é substituído por ``sys.stdin`` e os argumentos opcionais *mode* e *openhook* são ignorados. Para especificar uma lista alternativa de nomes de ficheiros, passe-a como primeiro argumento para :func:`.input`. Um único nome de ficheiro também é permitido.

source: All files are opened in text mode by default, but you can override this by specifying the *mode* parameter in the call to :func:`.input` or :class:`FileInput`. If an I/O error occurs during opening or reading a file, :exc:`OSError` is raised.
pt_pt: Todos os ficheiros são abertos em modo de texto por predefinição, mas pode anular isto especificando o parâmetro *mode* na chamada a :func:`.input` ou :class:`FileInput`. Se ocorrer um erro de I/O durante a abertura ou leitura de um ficheiro, é lançada a exceção :exc:`OSError`.

source: :exc:`IOError` used to be raised; it is now an alias of :exc:`OSError`.
pt_pt: Antigamente era lançada a exceção :exc:`IOError`; agora é um alias de :exc:`OSError`.

source: If ``sys.stdin`` is used more than once, the second and further use will return no lines, except perhaps for interactive use, or if it has been explicitly reset (e.g. using ``sys.stdin.seek(0)``).
pt_pt: Se o ``sys.stdin`` for usado mais do que uma vez, a segunda utilização e as seguintes não retornarão linhas, exceto talvez em uso interativo, ou se tiver sido explicitamente reiniciado (ex: usando ``sys.stdin.seek(0)``).

source: Empty files are opened and immediately closed; the only time their presence in the list of filenames is noticeable at all is when the last file opened is empty.
pt_pt: Ficheiros vazios são abertos e imediatamente fechados; a única altura em que a sua presença na lista de nomes de ficheiros é percetível é quando o último ficheiro aberto está vazio.

source: Lines are returned with any newlines intact, which means that the last line in a file may not have one.
pt_pt: As linhas são retornadas com quaisquer quebras de linha intactas, o que significa que a última linha de um ficheiro pode não ter uma.

source: You can control how files are opened by providing an opening hook via the *openhook* parameter to :func:`fileinput.input` or :func:`FileInput`. The hook must be a function that takes two arguments, *filename* and *mode*, and returns an accordingly opened file-like object. If *encoding* and/or *errors* are specified, they will be passed to the hook as additional keyword arguments. This module provides a :func:`hook_compressed` to support compressed files.
pt_pt: Pode controlar como os ficheiros são abertos fornecendo um "opening hook" através do parâmetro *openhook* para :func:`fileinput.input` ou :func:`FileInput`. O hook deve ser uma função que aceite dois argumentos, *filename* e *mode*, e retorne um objeto do tipo ficheiro aberto adequadamente. Se *encoding* e/ou *errors* forem especificados, serão passados ao hook como argumentos de palavra-chave adicionais. Este módulo fornece um :func:`hook_compressed` para suportar ficheiros comprimidos.

source: The following function is the primary interface of this module:
pt_pt: A seguinte função é a interface principal deste módulo:

source: Create an instance of the :class:`FileInput` class. The instance will be used as global state for the functions of this module, and is also returned to use during iteration. The parameters to this function will be passed along to the constructor of the :class:`FileInput` class.
pt_pt: Cria uma instância da classe :class:`FileInput`. A instância será usada como estado global para as funções deste módulo, e é também retornada para uso durante a iteração. Os parâmetros desta função serão passados ao construtor da classe :class:`FileInput`.

source: The :class:`FileInput` instance can be used as a context manager in the :keyword:`with` statement. In this example, *input* is closed after the :keyword:`!with` statement is exited, even if an exception occurs::
pt_pt: A instância :class:`FileInput` pode ser usada como um gestor de contexto na instrução :keyword:`with`. Neste exemplo, *input* é fechado após a saída da instrução :keyword:`!with`, mesmo que ocorra uma exceção::

source: Can be used as a context manager.
pt_pt: Pode ser usado como gestor de contexto.

source: The keyword parameters *mode* and *openhook* are now keyword-only.
pt_pt: Os parâmetros de palavra-chave *mode* e *openhook* são agora apenas de palavra-chave (keyword-only).

source: The keyword-only parameter *encoding* and *errors* are added.
pt_pt: Foram adicionados os parâmetros apenas de palavra-chave *encoding* e *errors*.

source: The following functions use the global state created by :func:`fileinput.input`; if there is no active state, :exc:`RuntimeError` is raised.
pt_pt: As seguintes funções utilizam o estado global criado por :func:`fileinput.input`; se não houver um estado ativo, é lançada a exceção :exc:`RuntimeError`.

source: Return the name of the file currently being read. Before the first line has been read, returns ``None``.
pt_pt: Retorna o nome do ficheiro que está a ser lido no momento. Antes de a primeira linha ser lida, retorna ``None``.

source: Return the integer "file descriptor" for the current file. When no file is opened (before the first line and between files), returns ``-1``.
pt_pt: Retorna o "descritor de ficheiro" (file descriptor) inteiro do ficheiro atual. Quando nenhum ficheiro está aberto (antes da primeira linha e entre ficheiros), retorna ``-1``.

source: Return the cumulative line number of the line that has just been read. Before the first line has been read, returns ``0``. After the last line of the last file has been read, returns the line number of that line.
pt_pt: Retorna o número cumulativo da linha que acabou de ser lida. Antes da primeira linha ser lida, retorna ``0``. Após a leitura da última linha do último ficheiro, retorna o número dessa linha.

source: Return the line number in the current file. Before the first line has been read, returns ``0``. After the last line of the last file has been read, returns the line number of that line within the file.
pt_pt: Retorna o número da linha no ficheiro atual. Antes da primeira linha ser lida, retorna ``0``. Após a leitura da última linha do último ficheiro, retorna o número dessa linha dentro do ficheiro.

source: Return ``True`` if the line just read is the first line of its file, otherwise return ``False``.
pt_pt: Retorna ``True`` se a linha que acabou de ser lida for a primeira linha do seu ficheiro, caso contrário retorna ``False``.

source: Return ``True`` if the last line was read from ``sys.stdin``, otherwise return ``False``.
pt_pt: Retorna ``True`` se a última linha foi lida de ``sys.stdin``, caso contrário retorna ``False``.

source: Close the current file so that the next iteration will read the first line from the next file (if any); lines not read from the file will not count towards the cumulative line count. The filename is not changed until after the first line of the next file has been read. Before the first line has been read, this function has no effect; it cannot be used to skip the first file. After the last line of the last file has been read, this function has no effect.
pt_pt: Fecha o ficheiro atual para que a próxima iteração leia a primeira linha do próximo ficheiro (se houver); as linhas não lidas do ficheiro não contarão para a contagem cumulativa de linhas. O nome do ficheiro não é alterado até que a primeira linha do próximo ficheiro tenha sido lida. Antes da primeira linha ser lida, esta função não tem efeito; não pode ser usada para saltar o primeiro ficheiro. Após a última linha do último ficheiro ter sido lida, esta função não tem efeito.

source: Close the sequence.
pt_pt: Fecha a sequência.

source: The class which implements the sequence behavior provided by the module is available for subclassing as well:
pt_pt: A classe que implementa o comportamento de sequência fornecido pelo módulo também está disponível para subclassificação:

source: Class :class:`FileInput` is the implementation; its methods :meth:`filename`, :meth:`fileno`, :meth:`lineno`, :meth:`filelineno`, :meth:`isfirstline`, :meth:`isstdin`, :meth:`nextfile` and :meth:`close` correspond to the functions of the same name in the module. In addition it is :term:`iterable` and has a :meth:`~io.TextIOBase.readline` method which returns the next input line. The sequence must be accessed in strictly sequential order; random access and :meth:`~io.TextIOBase.readline` cannot be mixed.
pt_pt: A classe :class:`FileInput` é a implementação; os seus métodos :meth:`filename`, :meth:`fileno`, :meth:`lineno`, :meth:`filelineno`, :meth:`isfirstline`, :meth:`isstdin`, :meth:`nextfile` e :meth:`close` correspondem às funções com o mesmo nome no módulo. Além disso, é :term:`iterable` (iterável) e possui um método :meth:`~io.TextIOBase.readline` que retorna a próxima linha de entrada. A sequência deve ser acedida em ordem estritamente sequencial; o acesso aleatório e o método :meth:`~io.TextIOBase.readline` não podem ser misturados.

source: With *mode* you can specify which file mode will be passed to :func:`open`. It must be one of ``'r'`` and ``'rb'``.
pt_pt: Com *mode* pode especificar qual o modo de ficheiro que será passado a :func:`open`. Deve ser um de ``'r'`` ou ``'rb'``.

source: The *openhook*, when given, must be a function that takes two arguments, *filename* and *mode*, and returns an accordingly opened file-like object. You cannot use *inplace* and *openhook* together.
pt_pt: O *openhook*, quando fornecido, deve ser uma função que aceite dois argumentos, *filename* e *mode*, e retorne um objeto do tipo ficheiro aberto adequadamente. Não pode usar *inplace* e *openhook* em conjunto.

source: You can specify *encoding* and *errors* that is passed to :func:`open` or *openhook*.
pt_pt: Pode especificar o *encoding* (codificação) e *errors* (erros) que são passados a :func:`open` ou *openhook*.

source: A :class:`FileInput` instance can be used as a context manager in the :keyword:`with` statement. In this example, *input* is closed after the :keyword:`!with` statement is exited, even if an exception occurs::
pt_pt: Uma instância de :class:`FileInput` pode ser usada como um gestor de contexto na instrução :keyword:`with`. Neste exemplo, *input* é fechado após a saída da instrução :keyword:`!with`, mesmo que ocorra uma exceção::

source: The keyword parameter *mode* and *openhook* are now keyword-only.
pt_pt: O parâmetro de palavra-chave *mode* e *openhook* são agora apenas de palavra-chave.

source: The ``'rU'`` and ``'U'`` modes and the :meth:`!__getitem__` method have been removed.
pt_pt: Os modos ``'rU'`` e ``'U'`` e o método :meth:`!__getitem__` foram removidos.

source: **Optional in-place filtering:** if the keyword argument ``inplace=True`` is passed to :func:`fileinput.input` or to the :class:`FileInput` constructor, the file is moved to a backup file and standard output is directed to the input file (if a file of the same name as the backup file already exists, it will be replaced silently). This makes it possible to write a filter that rewrites its input file in place. If the *backup* parameter is given (typically as ``backup='.<some extension>'``), it specifies the extension for the backup file, and the backup file remains around; by default, the extension is ``'.bak'`` and it is deleted when the output file is closed. In-place filtering is disabled when standard input is read.
pt_pt: **Filtragem in-place opcional:** se o argumento de palavra-chave ``inplace=True`` for passado para :func:`fileinput.input` ou para o construtor :class:`FileInput`, o ficheiro é movido para um ficheiro de backup e a saída padrão (stdout) é direcionada para o ficheiro de entrada (se já existir um ficheiro com o mesmo nome que o de backup, será substituído silenciosamente). Isto torna possível escrever um filtro que reescreve o seu ficheiro de entrada in-place. Se o parâmetro *backup* for fornecido (tipicamente como ``backup='.<alguma extensão>'``), este especifica a extensão para o ficheiro de backup, e o ficheiro de backup permanece; por predefinição, a extensão é ``'.bak'`` e este é apagado quando o ficheiro de saída é fechado. A filtragem in-place é desativada quando a entrada padrão é lida.

source: The two following opening hooks are provided by this module:
pt_pt: Os dois seguintes hooks de abertura são fornecidos por este módulo:

source: Transparently opens files compressed with gzip and bzip2 (recognized by the extensions ``'.gz'`` and ``'.bz2'``) using the :mod:`gzip` and :mod:`bz2` modules. If the filename extension is not ``'.gz'`` or ``'.bz2'``, the file is opened normally (ie, using :func:`open` without any decompression).
pt_pt: Abre de forma transparente ficheiros comprimidos com gzip e bzip2 (reconhecidos pelas extensões ``'.gz'`` e ``'.bz2'``) usando os módulos :mod:`gzip` e :mod:`bz2`. Se a extensão do nome do ficheiro não for ``'.gz'`` ou ``'.bz2'``, o ficheiro é aberto normalmente (ou seja, usando :func:`open` sem qualquer descompressão).

source: The *encoding* and *errors* values are passed to :class:`io.TextIOWrapper` for compressed files and open for normal files.
pt_pt: Os valores de *encoding* e *errors* são passados para :class:`io.TextIOWrapper` para ficheiros comprimidos e para open para ficheiros normais.

source: Usage example: ``fi = fileinput.FileInput(openhook=fileinput.hook_compressed, encoding="utf-8")``
pt_pt: Exemplo de uso: ``fi = fileinput.FileInput(openhook=fileinput.hook_compressed, encoding="utf-8")``

source: Returns a hook which opens each file with :func:`open`, using the given *encoding* and *errors* to read the file.
pt_pt: Retorna um hook que abre cada ficheiro com :func:`open`, usando o *encoding* e *errors* fornecidos para ler o ficheiro.

source: Usage example: ``fi = fileinput.FileInput(openhook=fileinput.hook_encoded("utf-8", "surrogateescape"))``
pt_pt: Exemplo de uso: ``fi = fileinput.FileInput(openhook=fileinput.hook_encoded("utf-8", "surrogateescape"))``

source: Added the optional *errors* parameter.
pt_pt: Adicionado o parâmetro opcional *errors*.

source: This function is deprecated since :func:`fileinput.input` and :class:`FileInput` now have *encoding* and *errors* parameters.
pt_pt: Esta função é considerada obsoleta (deprecated) uma vez que :func:`fileinput.input` e :class:`FileInput` já possuem agora parâmetros *encoding* e *errors*.
