Repository: NyaPuma/python-docs-pt
Catalog: library/gc.po
Languages: pt_pt

source: :mod:`!gc` --- Garbage Collector interface
pt_pt: :mod:`!gc` --- Interface do Garbage Collector

source: This module provides an interface to the optional garbage collector. It provides the ability to disable the collector, tune the collection frequency, and set debugging options. It also provides access to unreachable objects that the collector found but cannot free. Since the collector supplements the reference counting already used in Python, you can disable the collector if you are sure your program does not create reference cycles. Automatic collection can be disabled by calling ``gc.disable()``. To debug a leaking program call ``gc.set_debug(gc.DEBUG_LEAK)``. Notice that this includes ``gc.DEBUG_SAVEALL``, causing garbage-collected objects to be saved in gc.garbage for inspection.
pt_pt: Este módulo fornece uma interface para o coletor de lixo (garbage collector) opcional. Oferece a capacidade de desativar o coletor, ajustar a frequência de recolha e definir opções de depuração. Também fornece acesso a objetos inacessíveis que o coletor encontrou mas não consegue libertar. Como o coletor suplementa a contagem de referências já utilizada no Python, pode desativá-lo se tiver a certeza de que o seu programa não cria ciclos de referências. A recolha automática pode ser desativada chamando ``gc.disable()``. Para depurar um programa com fugas de memória (leaks), chame ``gc.set_debug(gc.DEBUG_LEAK)``. Note que isto inclui ``gc.DEBUG_SAVEALL``, fazendo com que os objetos recolhidos sejam guardados em gc.garbage para inspeção.

source: Enable automatic garbage collection.
pt_pt: Ativa a recolha automática de lixo.

source: Disable automatic garbage collection.
pt_pt: Desativa a recolha automática de lixo.

source: Return ``True`` if automatic collection is enabled.
pt_pt: Retorna ``True`` se a recolha automática estiver ativada.

source: Perform a collection. The optional argument *generation* may be an integer specifying which generation to collect (from 0 to 2). A :exc:`ValueError` is raised if the generation number is invalid. The sum of collected objects and uncollectable objects is returned.
pt_pt: Executa uma recolha. O argumento opcional *generation* pode ser um número inteiro especificando que geração recolher (de 0 a 2). É lançada uma exceção :exc:`ValueError` se o número da geração for inválido. É retornada a soma de objetos recolhidos e objetos não recolhíveis.

source: Calling ``gc.collect(0)`` will perform a GC collection on the young generation.
pt_pt: Chamar ``gc.collect(0)`` executará uma recolha do GC na geração jovem (young generation).

source: Calling ``gc.collect(1)`` will perform a GC collection on the young generation and an increment of the old generation.
pt_pt: Chamar ``gc.collect(1)`` executará uma recolha do GC na geração jovem e um incremento da geração antiga (old generation).

source: Calling ``gc.collect(2)`` or ``gc.collect()`` performs a full collection
pt_pt: Chamar ``gc.collect(2)`` ou ``gc.collect()`` executa uma recolha completa.

source: The free lists maintained for a number of built-in types are cleared whenever a full collection or collection of the highest generation (2) is run. Not all items in some free lists may be freed due to the particular implementation, in particular :class:`float`.
pt_pt: As listas livres (free lists) mantidas para vários tipos integrados são limpas sempre que uma recolha completa ou uma recolha da geração mais alta (2) é executada. Devido a particularidades da implementação, nem todos os itens de algumas listas livres podem ser libertados, em particular :class:`float`.

source: The effect of calling ``gc.collect()`` while the interpreter is already performing a collection is undefined.
pt_pt: O efeito de chamar ``gc.collect()`` enquanto o intérprete já está a executar uma recolha é indefinido.

source: ``generation=1`` performs an increment of collection.
pt_pt: ``generation=1`` executa um incremento da recolha.

source: Set the garbage collection debugging flags. Debugging information will be written to ``sys.stderr``. See below for a list of debugging flags which can be combined using bit operations to control debugging.
pt_pt: Define as flags de depuração do garbage collector. A informação de depuração será escrita em ``sys.stderr``. Veja abaixo uma lista de flags de depuração que podem ser combinadas usando operações binárias para controlar a depuração.

source: Return the debugging flags currently set.
pt_pt: Retorna as flags de depuração atualmente definidas.

source: Returns a list of all objects tracked by the collector, excluding the list returned. If *generation* is not ``None``, return only the objects as follows:
pt_pt: Retorna uma lista de todos os objetos rastreados pelo coletor, excluindo a própria lista retornada. Se *generation* não for ``None``, retorna apenas os objetos seguintes:

source: 0: All objects in the young generation
pt_pt: 0: Todos os objetos na geração jovem

source: 1: No objects, as there is no generation 1 (as of Python 3.14)
pt_pt: 1: Nenhum objeto, dado que não existe geração 1 (a partir do Python 3.14)

source: 2: All objects in the old generation
pt_pt: 2: Todos os objetos na geração antiga

source: New *generation* parameter.
pt_pt: Novo parâmetro *generation*.

source: Generation 1 is removed
pt_pt: A Geração 1 foi removida

source: Raises an :ref:`auditing event <auditing>` ``gc.get_objects`` with argument ``generation``.
pt_pt: Lança um :ref:`evento de auditoria <auditing>` ``gc.get_objects`` com o argumento ``generation``.

source: Return a list of three per-generation dictionaries containing collection statistics since interpreter start. The number of keys may change in the future, but currently each dictionary will contain the following items:
pt_pt: Retorna uma lista de três dicionários (um por geração) contendo estatísticas de recolha desde o início do intérprete. O número de chaves pode mudar no futuro, mas atualmente cada dicionário conterá os seguintes itens:

source: ``collections`` is the number of times this generation was collected;
pt_pt: ``collections`` é o número de vezes que esta geração foi recolhida;

source: ``collected`` is the total number of objects collected inside this generation;
pt_pt: ``collected`` é o número total de objetos recolhidos nesta geração;

source: ``uncollectable`` is the total number of objects which were found to be uncollectable (and were therefore moved to the :data:`garbage` list) inside this generation.
pt_pt: ``uncollectable`` é o número total de objetos que foram considerados não recolhíveis (e foram, portanto, movidos para a lista :data:`garbage`) dentro desta geração.

source: Set the garbage collection thresholds (the collection frequency). Setting *threshold0* to zero disables collection.
pt_pt: Define os limiares (thresholds) de recolha (a frequência de recolha). Definir *threshold0* para zero desativa a recolha.

source: The GC classifies objects into two generations depending on whether they have survived a collection. New objects are placed in the young generation. If an object survives a collection it is moved into the old generation.
pt_pt: O GC classifica os objetos em duas gerações dependendo de terem sobrevivido ou não a uma recolha. Novos objetos são colocados na geração jovem. Se um objeto sobrevive a uma recolha, é movido para a geração antiga.

source: In order to decide when to run, the collector keeps track of the number of object allocations and deallocations since the last collection. When the number of allocations minus the number of deallocations exceeds *threshold0*, collection starts. For each collection, all the objects in the young generation and some fraction of the old generation is collected.
pt_pt: Para decidir quando correr, o coletor regista o número de alocações e desalocações de objetos desde a última recolha. Quando o número de alocações menos o número de desalocações excede o *threshold0*, a recolha inicia-se. Em cada recolha, todos os objetos na geração jovem e uma fração da geração antiga são recolhidos.

source: In the free-threaded build, the increase in process memory usage is also checked before running the collector. If the memory usage has not increased by 10% since the last collection and the net number of object allocations has not exceeded 40 times *threshold0*, the collection is not run.
pt_pt: Na build free-threaded, o aumento do uso de memória do processo também é verificado antes de executar o coletor. Se o uso de memória não tiver aumentado 10% desde a última recolha e o número líquido de alocações de objetos não tiver excedido 40 vezes o *threshold0*, a recolha não é executada.

source: The fraction of the old generation that is collected is **inversely** proportional to *threshold1*. The larger *threshold1* is, the slower objects in the old generation are collected. For the default value of 10, 1% of the old generation is scanned during each collection.
pt_pt: A fração da geração antiga que é recolhida é **inversamente** proporcional ao *threshold1*. Quanto maior for o *threshold1*, mais lentamente os objetos na geração antiga são recolhidos. Para o valor predefinido de 10, 1% da geração antiga é verificada durante cada recolha.

source: *threshold2* is ignored.
pt_pt: O *threshold2* é ignorado.

source: See `Garbage collector design <https://github.com/python/cpython/blob/3.14/InternalDocs/garbage_collector.md>`_ for more information.
pt_pt: Veja `Design do garbage collector <https://github.com/python/cpython/blob/3.14/InternalDocs/garbage_collector.md>`_ para mais informações.

source: *threshold2* is ignored
pt_pt: O *threshold2* é ignorado

source: Return the current collection counts as a tuple of ``(count0, count1, count2)``.
pt_pt: Retorna as contagens de recolha atuais como um tuplo de ``(count0, count1, count2)``.

source: Return the current collection thresholds as a tuple of ``(threshold0, threshold1, threshold2)``.
pt_pt: Retorna os limiares de recolha atuais como um tuplo de ``(threshold0, threshold1, threshold2)``.

source: Return the list of objects that directly refer to any of objs. This function will only locate those containers which support garbage collection; extension types which do refer to other objects but do not support garbage collection will not be found.
pt_pt: Retorna a lista de objetos que se referem diretamente a qualquer um de objs. Esta função apenas localizará os contentores que suportam recolha de lixo; tipos de extensão que referem outros objetos mas não suportam recolha de lixo não serão encontrados.

source: Note that objects which have already been dereferenced, but which live in cycles and have not yet been collected by the garbage collector can be listed among the resulting referrers. To get only currently live objects, call :func:`collect` before calling :func:`get_referrers`.
pt_pt: Note que objetos que já foram desreferenciados, mas que vivem em ciclos e ainda não foram recolhidos pelo coletor de lixo, podem constar entre os referenciadores resultantes. Para obter apenas objetos atualmente ativos, chame :func:`collect` antes de chamar :func:`get_referrers`.

source: Care must be taken when using objects returned by :func:`get_referrers` because some of them could still be under construction and hence in a temporarily invalid state. Avoid using :func:`get_referrers` for any purpose other than debugging.
pt_pt: Deve ter-se cuidado ao utilizar objetos retornados por :func:`get_referrers` porque alguns deles podem ainda estar em construção e, portanto, num estado temporariamente inválido. Evite usar :func:`get_referrers` para qualquer fim que não seja depuração.

source: Raises an :ref:`auditing event <auditing>` ``gc.get_referrers`` with argument ``objs``.
pt_pt: Lança um :ref:`evento de auditoria <auditing>` ``gc.get_referrers`` com o argumento ``objs``.

source: Return a list of objects directly referred to by any of the arguments. The referents returned are those objects visited by the arguments' C-level :c:member:`~PyTypeObject.tp_traverse` methods (if any), and may not be all objects actually directly reachable. :c:member:`~PyTypeObject.tp_traverse` methods are supported only by objects that support garbage collection, and are only required to visit objects that may be involved in a cycle. So, for example, if an integer is directly reachable from an argument, that integer object may or may not appear in the result list.
pt_pt: Retorna uma lista de objetos diretamente referidos por qualquer um dos argumentos. Os referentes retornados são os objetos visitados pelos métodos :c:member:`~PyTypeObject.tp_traverse` de nível C dos argumentos (se existirem), e podem não ser todos os objetos realmente alcançáveis de forma direta. Os métodos :c:member:`~PyTypeObject.tp_traverse` são suportados apenas por objetos que suportam recolha de lixo, sendo apenas obrigados a visitar objetos que possam estar envolvidos num ciclo. Assim, por exemplo, se um inteiro for diretamente alcançável a partir de um argumento, esse objeto inteiro pode ou não aparecer na lista de resultados.

source: Raises an :ref:`auditing event <auditing>` ``gc.get_referents`` with argument ``objs``.
pt_pt: Lança um :ref:`evento de auditoria <auditing>` ``gc.get_referents`` com o argumento ``objs``.

source: Returns ``True`` if the object is currently tracked by the garbage collector, ``False`` otherwise. As a general rule, instances of atomic types aren't tracked and instances of non-atomic types (containers, user-defined objects...) are. However, some type-specific optimizations can be present in order to suppress the garbage collector footprint of simple instances (e.g. dicts containing only atomic keys and values)::
pt_pt: Retorna ``True`` se o objeto estiver atualmente a ser rastreado pelo coletor de lixo, ``False`` caso contrário. Como regra geral, instâncias de tipos atómicos não são rastreadas e instâncias de tipos não atómicos (contentores, objetos definidos pelo utilizador...) são. No entanto, podem existir algumas otimizações específicas de tipo para suprimir a pegada do coletor de lixo em instâncias simples (ex: dicionários que contenham apenas chaves e valores atómicos)::

source: Returns ``True`` if the given object has been finalized by the garbage collector, ``False`` otherwise. ::
pt_pt: Retorna ``True`` se o objeto fornecido tiver sido finalizado pelo coletor de lixo, ``False`` caso contrário. ::

source: Freeze all the objects tracked by the garbage collector; move them to a permanent generation and ignore them in all the future collections.
pt_pt: Congela (freeze) todos os objetos rastreados pelo coletor de lixo; move-os para uma geração permanente e ignora-os em todas as recolhas futuras.

source: If a process will ``fork()`` without ``exec()``, avoiding unnecessary copy-on-write in child processes will maximize memory sharing and reduce overall memory usage. This requires both avoiding creation of freed "holes" in memory pages in the parent process and ensuring that GC collections in child processes won't touch the ``gc_refs`` counter of long-lived objects originating in the parent process. To accomplish both, call ``gc.disable()`` early in the parent process, ``gc.freeze()`` right before ``fork()``, and ``gc.enable()`` early in child processes.
pt_pt: Se um processo for executar ``fork()`` sem ``exec()``, evitar o copy-on-write desnecessário nos processos filhos maximizará a partilha de memória e reduzirá o uso global de memória. Isto requer tanto evitar a criação de "buracos" libertados em páginas de memória no processo pai, como garantir que as recolhas de GC nos processos filhos não toquem no contador ``gc_refs`` de objetos de longa duração originários do processo pai. Para alcançar ambos, chame ``gc.disable()`` cedo no processo pai, ``gc.freeze()`` logo antes do ``fork()``, e ``gc.enable()`` cedo nos processos filhos.

source: Unfreeze the objects in the permanent generation, put them back into the oldest generation.
pt_pt: Descongela (unfreeze) os objetos na geração permanente, colocando-os de volta na geração mais antiga.

source: Return the number of objects in the permanent generation.
pt_pt: Retorna o número de objetos na geração permanente.

source: The following variables are provided for read-only access (you can mutate the values but should not rebind them):
pt_pt: As seguintes variáveis são fornecidas para acesso de apenas leitura (pode alterar os valores mas não deve reatribuí-las):

source: A list of objects which the collector found to be unreachable but could not be freed (uncollectable objects). Starting with Python 3.4, this list should be empty most of the time, except when using instances of C extension types with a non-``NULL`` ``tp_del`` slot.
pt_pt: Uma lista de objetos que o coletor considerou inacessíveis mas que não puderam ser libertados (objetos não recolhíveis). A partir do Python 3.4, esta lista deve estar vazia a maior parte do tempo, exceto quando se utilizam instâncias de tipos de extensão em C com um slot ``tp_del`` não ``NULL``.

source: If :const:`DEBUG_SAVEALL` is set, then all unreachable objects will be added to this list rather than freed.
pt_pt: Se :const:`DEBUG_SAVEALL` estiver definido, então todos os objetos inacessíveis serão adicionados a esta lista em vez de serem libertados.

source: If this list is non-empty at :term:`interpreter shutdown`, a :exc:`ResourceWarning` is emitted, which is silent by default. If :const:`DEBUG_UNCOLLECTABLE` is set, in addition all uncollectable objects are printed.
pt_pt: Se esta lista não estiver vazia no :term:`encerramento do intérprete`, é emitido um :exc:`ResourceWarning`, que é silencioso por predefinição. Se :const:`DEBUG_UNCOLLECTABLE` estiver definido, todos os objetos não recolhíveis são adicionalmente impressos.

source: Following :pep:`442`, objects with a :meth:`~object.__del__` method don't end up in :data:`gc.garbage` anymore.
pt_pt: Seguindo a :pep:`442`, objetos com um método :meth:`~object.__del__` já não vão parar a :data:`gc.garbage`.

source: A list of callbacks that will be invoked by the garbage collector before and after collection. The callbacks will be called with two arguments, *phase* and *info*.
pt_pt: Uma lista de callbacks que serão invocados pelo coletor de lixo antes e depois da recolha. Os callbacks serão chamados com dois argumentos, *phase* e *info*.

source: *phase* can be one of two values:
pt_pt: *phase* pode ser um de dois valores:

source: "start": The garbage collection is about to start.
pt_pt: "start": A recolha de lixo está prestes a começar.

source: "stop": The garbage collection has finished.
pt_pt: "stop": A recolha de lixo terminou.

source: *info* is a dict providing more information for the callback. The following keys are currently defined:
pt_pt: *info* é um dicionário que fornece mais informação para o callback. As seguintes chaves estão atualmente definidas:

source: "generation": The oldest generation being collected.
pt_pt: "generation": A geração mais antiga a ser recolhida.

source: "collected": When *phase* is "stop", the number of objects successfully collected.
pt_pt: "collected": Quando *phase* é "stop", o número de objetos recolhidos com sucesso.

source: "uncollectable": When *phase* is "stop", the number of objects that could not be collected and were put in :data:`garbage`.
pt_pt: "uncollectable": Quando *phase* é "stop", o número de objetos que não puderam ser recolhidos e foram colocados em :data:`garbage`.

source: Applications can add their own callbacks to this list. The primary use cases are:
pt_pt: As aplicações podem adicionar os seus próprios callbacks a esta lista. Os principais casos de uso são:

source: Gathering statistics about garbage collection, such as how often various generations are collected, and how long the collection takes.
pt_pt: Recolher estatísticas sobre a recolha de lixo, tais como a frequência com que várias gerações são recolhidas e quanto tempo demora a recolha.

source: Allowing applications to identify and clear their own uncollectable types when they appear in :data:`garbage`.
pt_pt: Permitir que as aplicações identifiquem e limpem os seus próprios tipos não recolhíveis quando estes aparecem em :data:`garbage`.

source: The following constants are provided for use with :func:`set_debug`:
pt_pt: As seguintes constantes são fornecidas para uso com :func:`set_debug`:

source: Print statistics during collection. This information can be useful when tuning the collection frequency.
pt_pt: Imprime estatísticas durante a recolha. Esta informação pode ser útil ao ajustar a frequência de recolha.

source: Print information on collectable objects found.
pt_pt: Imprime informações sobre objetos recolhíveis encontrados.

source: Print information of uncollectable objects found (objects which are not reachable but cannot be freed by the collector). These objects will be added to the ``garbage`` list.
pt_pt: Imprime informações sobre objetos não recolhíveis encontrados (objetos que não são alcançáveis mas não podem ser libertados pelo coletor). Estes objetos serão adicionados à lista ``garbage``.

source: Also print the contents of the :data:`garbage` list at :term:`interpreter shutdown`, if it isn't empty.
pt_pt: Também imprime o conteúdo da lista :data:`garbage` no :term:`encerramento do intérprete`, se esta não estiver vazia.

source: When set, all unreachable objects found will be appended to *garbage* rather than being freed. This can be useful for debugging a leaking program.
pt_pt: Quando definido, todos os objetos inacessíveis encontrados serão anexados a *garbage* em vez de serem libertados. Isto pode ser útil para depurar um programa com fugas de memória.

source: The debugging flags necessary for the collector to print information about a leaking program (equal to ``DEBUG_COLLECTABLE | DEBUG_UNCOLLECTABLE | DEBUG_SAVEALL``).
pt_pt: As flags de depuração necessárias para o coletor imprimir informações sobre um programa com fugas de memória (equivalente a ``DEBUG_COLLECTABLE | DEBUG_UNCOLLECTABLE | DEBUG_SAVEALL``).
