Repository: NyaPuma/python-docs-pt
Catalog: library/gzip.po
Languages: pt_pt

source: :mod:`!gzip` --- Support for :program:`gzip` files
pt_pt: :mod:`!gzip` --- Suporte para ficheiros :program:`gzip`

source: **Source code:** :source:`Lib/gzip.py`
pt_pt: **Código-fonte:** :source:`Lib/gzip.py`

source: This module provides a simple interface to compress and decompress files just like the GNU programs :program:`gzip` and :program:`gunzip` would.
pt_pt: Este módulo fornece uma interface simples para comprimir e descomprimir ficheiros tal como os programas GNU :program:`gzip` e :program:`gunzip` o fariam.

source: This is an :term:`optional module`. If it is missing from your copy of CPython, look for documentation from your distributor (that is, whoever provided Python to you). If you are the distributor, see :ref:`optional-module-requirements`.
pt_pt: Este é um :term:`módulo opcional`. Se estiver em falta na sua cópia do CPython, procure documentação junto do seu distribuidor (ou seja, quem lhe forneceu o Python). Se for o distribuidor, veja :ref:`optional-module-requirements`.

source: The data compression is provided by the :mod:`zlib` module.
pt_pt: A compressão de dados é fornecida pelo módulo :mod:`zlib`.

source: The :mod:`gzip` module provides the :class:`GzipFile` class, as well as the :func:`.open`, :func:`compress` and :func:`decompress` convenience functions. The :class:`GzipFile` class reads and writes :program:`gzip`\ -format files, automatically compressing or decompressing the data so that it looks like an ordinary :term:`file object`.
pt_pt: O módulo :mod:`gzip` fornece a classe :class:`GzipFile`, bem como as funções de conveniência :func:`.open`, :func:`compress` e :func:`decompress`. A classe :class:`GzipFile` lê e escreve ficheiros no formato :program:`gzip`, comprimindo ou descomprimindo automaticamente os dados para que pareçam um :term:`objeto ficheiro (file object)` comum.

source: Note that additional file formats which can be decompressed by the :program:`gzip` and :program:`gunzip` programs, such as those produced by :program:`compress` and :program:`pack`, are not supported by this module.
pt_pt: Note que formatos de ficheiro adicionais que podem ser descomprimidos pelos programas :program:`gzip` e :program:`gunzip`, tais como os produzidos pelos programas :program:`compress` e :program:`pack`, não são suportados por este módulo.

source: The module defines the following items:
pt_pt: O módulo define os seguintes itens:

source: Open a gzip-compressed file in binary or text mode, returning a :term:`file object`.
pt_pt: Abre um ficheiro comprimido com gzip em modo binário ou de texto, devolvendo um :term:`objeto ficheiro`.

source: The *filename* argument can be an actual filename (a :class:`str` or :class:`bytes` object), or an existing file object to read from or write to.
pt_pt: O argumento *filename* pode ser um nome de ficheiro real (um objeto :class:`str` ou :class:`bytes`), ou um objeto ficheiro existente para leitura ou escrita.

source: The *mode* argument can be any of ``'r'``, ``'rb'``, ``'a'``, ``'ab'``, ``'w'``, ``'wb'``, ``'x'`` or ``'xb'`` for binary mode, or ``'rt'``, ``'at'``, ``'wt'``, or ``'xt'`` for text mode. The default is ``'rb'``.
pt_pt: O argumento *mode* pode ser qualquer um de ``'r'``, ``'rb'``, ``'a'``, ``'ab'``, ``'w'``, ``'wb'``, ``'x'`` ou ``'xb'`` para modo binário, ou ``'rt'``, ``'at'``, ``'wt'``, ou ``'xt'`` para modo de texto. O padrão é ``'rb'``.

source: The *compresslevel* argument is an integer from 0 to 9, as for the :class:`GzipFile` constructor.
pt_pt: O argumento *compresslevel* é um inteiro de 0 a 9, tal como no construtor de :class:`GzipFile`.

source: For binary mode, this function is equivalent to the :class:`GzipFile` constructor: ``GzipFile(filename, mode, compresslevel)``. In this case, the *encoding*, *errors* and *newline* arguments must not be provided.
pt_pt: Para o modo binário, esta função é equivalente ao construtor :class:`GzipFile`: ``GzipFile(filename, mode, compresslevel)``. Neste caso, os argumentos *encoding*, *errors* e *newline* não devem ser fornecidos.

source: For text mode, a :class:`GzipFile` object is created, and wrapped in an :class:`io.TextIOWrapper` instance with the specified encoding, error handling behavior, and line ending(s).
pt_pt: Para o modo de texto, um objeto :class:`GzipFile` é criado e envolvido numa instância de :class:`io.TextIOWrapper` com a codificação especificada, comportamento de tratamento de erros e terminação(ões) de linha.

source: Added support for *filename* being a file object, support for text mode, and the *encoding*, *errors* and *newline* arguments.
pt_pt: Adicionado suporte para *filename* ser um objeto ficheiro, suporte para modo de texto e os argumentos *encoding*, *errors* e *newline*.

source: Added support for the ``'x'``, ``'xb'`` and ``'xt'`` modes.
pt_pt: Adicionado suporte para os modos ``'x'``, ``'xb'`` e ``'xt'``.

source: Accepts a :term:`path-like object`.
pt_pt: Aceita um :term:`objeto semelhante a um caminho`.

source: An exception raised for invalid gzip files. It inherits from :exc:`OSError`. :exc:`EOFError` and :exc:`zlib.error` can also be raised for invalid gzip files.
pt_pt: Uma exceção lançada para ficheiros gzip inválidos. Herda de :exc:`OSError`. :exc:`EOFError` e :exc:`zlib.error` também podem ser lançados para ficheiros gzip inválidos.

source: Constructor for the :class:`GzipFile` class, which simulates most of the methods of a :term:`file object`, with the exception of the :meth:`~io.IOBase.truncate` method. At least one of *fileobj* and *filename* must be given a non-trivial value.
pt_pt: Construtor para a classe :class:`GzipFile`, que simula a maioria dos métodos de um :term:`objeto ficheiro`, com a exceção do método :meth:`~io.IOBase.truncate`. Pelo menos um dos argumentos *fileobj* ou *filename* deve ter um valor não trivial.

source: The new class instance is based on *fileobj*, which can be a regular file, an :class:`io.BytesIO` object, or any other object which simulates a file. It defaults to ``None``, in which case *filename* is opened to provide a file object.
pt_pt: A nova instância da classe é baseada em *fileobj*, que pode ser um ficheiro normal, um objeto :class:`io.BytesIO` ou qualquer outro objeto que simule um ficheiro. O padrão é ``None``, caso em que *filename* é aberto para fornecer um objeto ficheiro.

source: When *fileobj* is not ``None``, the *filename* argument is only used to be included in the :program:`gzip` file header, which may include the original filename of the uncompressed file. It defaults to the filename of *fileobj*, if discernible; otherwise, it defaults to the empty string, and in this case the original filename is not included in the header.
pt_pt: Quando *fileobj* não é ``None``, o argumento *filename* é apenas utilizado para ser incluído no cabeçalho do ficheiro :program:`gzip`, que pode incluir o nome original do ficheiro não comprimido. O valor padrão é o nome de ficheiro de *fileobj*, se for discernível; caso contrário, o padrão é uma string vazia e, neste caso, o nome original não é incluído no cabeçalho.

source: The *mode* argument can be any of ``'r'``, ``'rb'``, ``'a'``, ``'ab'``, ``'w'``, ``'wb'``, ``'x'``, or ``'xb'``, depending on whether the file will be read or written. The default is the mode of *fileobj* if discernible; otherwise, the default is ``'rb'``. In future Python releases the mode of *fileobj* will not be used. It is better to always specify *mode* for writing.
pt_pt: O argumento *mode* pode ser qualquer um de ``'r'``, ``'rb'``, ``'a'``, ``'ab'``, ``'w'``, ``'wb'``, ``'x'`` ou ``'xb'``, dependendo se o ficheiro será lido ou escrito. O padrão é o modo de *fileobj* se for discernível; caso contrário, o padrão é ``'rb'``. Em futuras versões do Python, o modo de *fileobj* não será utilizado. É preferível especificar sempre o *mode* para escrita.

source: Note that the file is always opened in binary mode. To open a compressed file in text mode, use :func:`.open` (or wrap your :class:`GzipFile` with an :class:`io.TextIOWrapper`).
pt_pt: Note que o ficheiro é sempre aberto em modo binário. Para abrir um ficheiro comprimido em modo de texto, utilize :func:`.open` (ou envolva o seu :class:`GzipFile` com um :class:`io.TextIOWrapper`).

source: The *compresslevel* argument is an integer from ``0`` to ``9`` controlling the level of compression; ``1`` is fastest and produces the least compression, and ``9`` is slowest and produces the most compression. ``0`` is no compression. The default is ``9``.
pt_pt: O argumento *compresslevel* é um inteiro de ``0`` a ``9`` que controla o nível de compressão; ``1`` é o mais rápido e produz a menor compressão, e ``9`` é o mais lento e produz a maior compressão. ``0`` não aplica compressão. O padrão é ``9``.

source: The optional *mtime* argument is the timestamp requested by gzip. The time is in Unix format, i.e., seconds since 00:00:00 UTC, January 1, 1970. If *mtime* is omitted or ``None``, the current time is used. Use *mtime* = 0 to generate a compressed stream that does not depend on creation time.
pt_pt: O argumento opcional *mtime* é o carimbo de data/hora (timestamp) solicitado pelo gzip. O tempo está no formato Unix, ou seja, segundos desde 00:00:00 UTC de 1 de janeiro de 1970. Se *mtime* for omitido ou ``None``, é utilizada a hora atual. Utilize *mtime* = 0 para gerar um fluxo comprimido que não dependa do momento da criação.

source: See below for the :attr:`mtime` attribute that is set when decompressing.
pt_pt: Veja abaixo o atributo :attr:`mtime` que é definido durante a descompressão.

source: Calling a :class:`GzipFile` object's :meth:`!close` method does not close *fileobj*, since you might wish to append more material after the compressed data. This also allows you to pass an :class:`io.BytesIO` object opened for writing as *fileobj*, and retrieve the resulting memory buffer using the :class:`io.BytesIO` object's :meth:`~io.BytesIO.getvalue` method.
pt_pt: Chamar o método :meth:`!close` de um objeto :class:`GzipFile` não fecha o *fileobj*, pois poderá querer acrescentar mais conteúdo após os dados comprimidos. Isto também permite passar um objeto :class:`io.BytesIO` aberto para escrita como *fileobj* e recuperar o buffer de memória resultante usando o método :meth:`~io.BytesIO.getvalue` do objeto :class:`io.BytesIO`.

source: :class:`GzipFile` supports the :class:`io.BufferedIOBase` interface, including iteration and the :keyword:`with` statement. Only the :meth:`~io.IOBase.truncate` method isn't implemented.
pt_pt: :class:`GzipFile` suporta a interface :class:`io.BufferedIOBase`, incluindo iteração e a instrução :keyword:`with`. Apenas o método :meth:`~io.IOBase.truncate` não está implementado.

source: Read *n* uncompressed bytes without advancing the file position. The number of bytes returned may be more or less than requested.
pt_pt: Lê *n* bytes não comprimidos sem avançar a posição do ficheiro. O número de bytes devolvidos pode ser superior ou inferior ao solicitado.

source: While calling :meth:`peek` does not change the file position of the :class:`GzipFile`, it may change the position of the underlying file object (e.g. if the :class:`GzipFile` was constructed with the *fileobj* parameter).
pt_pt: Embora a chamada a :meth:`peek` não altere a posição do ficheiro do :class:`GzipFile`, pode alterar a posição do objeto ficheiro subjacente (por exemplo, se o :class:`GzipFile` foi construído com o parâmetro *fileobj*).

source: ``'rb'`` for reading and ``'wb'`` for writing.
pt_pt: ``'rb'`` para leitura e ``'wb'`` para escrita.

source: In previous versions it was an integer ``1`` or ``2``.
pt_pt: Em versões anteriores era um inteiro ``1`` ou ``2``.

source: When decompressing, this attribute is set to the last timestamp in the most recently read header. It is an integer, holding the number of seconds since the Unix epoch (00:00:00 UTC, January 1, 1970). The initial value before reading any headers is ``None``.
pt_pt: Ao descomprimir, este atributo é definido com o último carimbo de data/hora no cabeçalho lido mais recentemente. É um inteiro, contendo o número de segundos desde a época Unix (00:00:00 UTC de 1 de janeiro de 1970). O valor inicial antes de ler qualquer cabeçalho é ``None``.

source: The path to the gzip file on disk, as a :class:`str` or :class:`bytes`. Equivalent to the output of :func:`os.fspath` on the original input path, with no other normalization, resolution or expansion.
pt_pt: O caminho para o ficheiro gzip no disco, como uma :class:`str` ou :class:`bytes`. Equivalente à saída de :func:`os.fspath` no caminho de entrada original, sem qualquer outra normalização, resolução ou expansão.

source: Support for the :keyword:`with` statement was added, along with the *mtime* constructor argument and :attr:`mtime` attribute.
pt_pt: Foi adicionado suporte para a instrução :keyword:`with`, juntamente com o argumento *mtime* do construtor e o atributo :attr:`mtime`.

source: Support for zero-padded and unseekable files was added.
pt_pt: Foi adicionado suporte para ficheiros com preenchimento de zeros (zero-padded) e não pesquisáveis (unseekable).

source: The :meth:`io.BufferedIOBase.read1` method is now implemented.
pt_pt: O método :meth:`io.BufferedIOBase.read1` está agora implementado.

source: Added support for the ``'x'`` and ``'xb'`` modes.
pt_pt: Adicionado suporte para os modos ``'x'`` e ``'xb'``.

source: Added support for writing arbitrary :term:`bytes-like objects <bytes-like object>`. The :meth:`~io.BufferedIOBase.read` method now accepts an argument of ``None``.
pt_pt: Adicionado suporte para a escrita de :term:`objetos semelhantes a bytes <bytes-like object>` arbitrários. O método :meth:`~io.BufferedIOBase.read` aceita agora um argumento de ``None``.

source: Opening :class:`GzipFile` for writing without specifying the *mode* argument is deprecated.
pt_pt: A abertura de :class:`GzipFile` para escrita sem especificar o argumento *mode* está descontinuada.

source: Remove the ``filename`` attribute, use the :attr:`~GzipFile.name` attribute instead.
pt_pt: Removido o atributo ``filename``; use o atributo :attr:`~GzipFile.name` em vez disso.

source: Compress the *data*, returning a :class:`bytes` object containing the compressed data. *compresslevel* and *mtime* have the same meaning as in the :class:`GzipFile` constructor above, but *mtime* defaults to 0 for reproducible output.
pt_pt: Comprime os dados (*data*), devolvendo um objeto :class:`bytes` contendo os dados comprimidos. *compresslevel* e *mtime* têm o mesmo significado que no construtor de :class:`GzipFile` acima, mas o padrão de *mtime* é 0 para garantir uma saída reproduzível.

source: Added the *mtime* parameter for reproducible output.
pt_pt: Adicionado o parâmetro *mtime* para saída reproduzível.

source: Speed is improved by compressing all data at once instead of in a streamed fashion. Calls with *mtime* set to ``0`` are delegated to :func:`zlib.compress` for better speed. In this situation the output may contain a gzip header "OS" byte value other than 255 "unknown" as supplied by the underlying zlib implementation.
pt_pt: A velocidade foi melhorada ao comprimir todos os dados de uma vez, em vez de o fazer de forma faseada (streamed). Chamadas com *mtime* definido como ``0`` são delegadas para :func:`zlib.compress` para melhor velocidade. Nesta situação, a saída pode conter um valor de byte "OS" no cabeçalho gzip diferente de 255 "desconhecido", conforme fornecido pela implementação subjacente do zlib.

source: The gzip header OS byte is guaranteed to be set to 255 when this function is used as was the case in 3.10 and earlier.
pt_pt: O byte OS do cabeçalho gzip tem a garantia de ser definido como 255 quando esta função é utilizada, tal como acontecia na versão 3.10 e anteriores.

source: The *mtime* parameter now defaults to 0 for reproducible output. For the previous behaviour of using the current time, pass ``None`` to *mtime*.
pt_pt: O parâmetro *mtime* agora tem 0 como padrão para saída reproduzível. Para o comportamento anterior de usar a hora atual, passe ``None`` para *mtime*.

source: Decompress the *data*, returning a :class:`bytes` object containing the uncompressed data. This function is capable of decompressing multi-member gzip data (multiple gzip blocks concatenated together). When the data is certain to contain only one member the :func:`zlib.decompress` function with *wbits* set to 31 is faster.
pt_pt: Descomprime os dados (*data*), devolvendo um objeto :class:`bytes` contendo os dados não comprimidos. Esta função é capaz de descomprimir dados gzip multi-membros (múltiplos blocos gzip concatenados). Quando se tem a certeza de que os dados contêm apenas um membro, a função :func:`zlib.decompress` com *wbits* definido para 31 é mais rápida.

source: Speed is improved by decompressing members at once in memory instead of in a streamed fashion.
pt_pt: A velocidade foi melhorada ao descomprimir membros de uma só vez em memória, em vez de o fazer de forma faseada.

source: Examples of usage
pt_pt: Exemplos de utilização

source: Example of how to read a compressed file::
pt_pt: Exemplo de como ler um ficheiro comprimido::

source: Example of how to create a compressed GZIP file::
pt_pt: Exemplo de como criar um ficheiro GZIP comprimido::

source: Example of how to GZIP compress an existing file::
pt_pt: Exemplo de como comprimir com GZIP um ficheiro existente::

source: Example of how to GZIP compress a binary string::
pt_pt: Exemplo de como comprimir com GZIP uma string binária::

source: Module :mod:`zlib`
pt_pt: Módulo :mod:`zlib`

source: The basic data compression module needed to support the :program:`gzip` file format.
pt_pt: O módulo de compressão de dados básico necessário para suportar o formato de ficheiro :program:`gzip`.

source: In case gzip (de)compression is a bottleneck, the `python-isal`_ package speeds up (de)compression with a mostly compatible API.
pt_pt: Caso a (des)compressão gzip seja um gargalo, o pacote `python-isal`_ acelera a (des)compressão com uma API maioritariamente compatível.

source: Command-line interface
pt_pt: Interface de linha de comandos

source: The :mod:`gzip` module provides a simple command line interface to compress or decompress files.
pt_pt: O módulo :mod:`gzip` fornece uma interface de linha de comandos simples para comprimir ou descomprimir ficheiros.

source: Once executed the :mod:`gzip` module keeps the input file(s).
pt_pt: Uma vez executado, o módulo :mod:`gzip` mantém o(s) ficheiro(s) de entrada.

source: Add a new command line interface with a usage. By default, when you will execute the CLI, the default compression level is 6.
pt_pt: Adicionada uma nova interface de linha de comandos com instruções de uso. Por padrão, ao executar o CLI, o nível de compressão padrão é 6.

source: Command-line options
pt_pt: Opções de linha de comandos

source: If *file* is not specified, read from :data:`sys.stdin`.
pt_pt: Se o ficheiro (*file*) não for especificado, lê de :data:`sys.stdin`.

source: Indicates the fastest compression method (less compression).
pt_pt: Indica o método de compressão mais rápido (menos compressão).

source: Indicates the slowest compression method (best compression).
pt_pt: Indica o método de compressão mais lento (melhor compressão).

source: Decompress the given file.
pt_pt: Descomprime o ficheiro fornecido.

source: Show the help message.
pt_pt: Mostrar a mensagem de ajuda.
