Repository: NyaPuma/python-docs-pt
Catalog: library/html.parser.po
Languages: pt_pt

source: :mod:`!html.parser` --- Simple HTML and XHTML parser
pt_pt: :mod:`!html.parser` --- Analisador (*parser*) simples de HTML e XHTML

source: **Source code:** :source:`Lib/html/parser.py`
pt_pt: **Código fonte:** :source:`Lib/html/parser.py`

source: This module defines a class :class:`HTMLParser` which serves as the basis for parsing text files formatted in HTML (HyperText Mark-up Language) and XHTML.
pt_pt: Este módulo define uma classe :class:`HTMLParser` que serve de base para analisar ficheiros de texto formatados em HTML (HyperText Mark-up Language) e XHTML.

source: Create a parser instance able to parse invalid markup.
pt_pt: Cria uma instância do analisador capaz de processar marcação inválida.

source: If *convert_charrefs* is true (the default), all character references (except the ones in elements like ``script`` and ``style``) are automatically converted to the corresponding Unicode characters.
pt_pt: Se *convert_charrefs* for verdadeiro (o valor por omissão), todas as referências de caracteres (exceto as que se encontram em elementos como ``script`` e ``style``) são automaticamente convertidas para os caracteres Unicode correspondentes.

source: If *scripting* is false (the default), the content of the ``noscript`` element is parsed normally; if it's true, it's returned as is without being parsed.
pt_pt: Se *scripting* for falso (o valor por omissão), o conteúdo do elemento ``noscript`` é analisado normalmente; se for verdadeiro, é retornado tal como está sem ser analisado.

source: An :class:`.HTMLParser` instance is fed HTML data and calls handler methods when start tags, end tags, text, comments, and other markup elements are encountered. The user should subclass :class:`.HTMLParser` and override its methods to implement the desired behavior.
pt_pt: Uma instância de :class:`.HTMLParser` recebe dados HTML e chama métodos de manipulação (*handlers*) quando são encontrados marcadores de abertura, de fecho, texto, comentários e outros elementos de marcação. O utilizador deve criar uma subclasse de :class:`.HTMLParser` e sobrepor os seus métodos para implementar o comportamento desejado.

source: This parser does not check that end tags match start tags or call the end-tag handler for elements which are closed implicitly by closing an outer element.
pt_pt: Este analisador não verifica se as tags de fecho correspondem às de abertura, nem chama o manipulador de tag de fecho para elementos que são fechados implicitamente ao fechar um elemento exterior.

source: *convert_charrefs* keyword argument added.
pt_pt: Adicionado o argumento de palavra-chave *convert_charrefs*.

source: The default value for argument *convert_charrefs* is now ``True``.
pt_pt: O valor por omissão para o argumento *convert_charrefs* é agora ``True``.

source: Added the *scripting* parameter.
pt_pt: Adicionado o parâmetro *scripting*.

source: Example HTML Parser Application
pt_pt: Exemplo de Aplicação de Analisador HTML

source: As a basic example, below is a simple HTML parser that uses the :class:`HTMLParser` class to print out start tags, end tags, and data as they are encountered:
pt_pt: Como exemplo básico, abaixo encontra-se um analisador HTML simples que utiliza a classe :class:`HTMLParser` para imprimir marcadores de abertura, de fecho e dados à medida que são encontrados:

source: The output will then be:
pt_pt: A saída será então:

source: :class:`.HTMLParser` Methods
pt_pt: Métodos de :class:`.HTMLParser`

source: :class:`HTMLParser` instances have the following methods:
pt_pt: As instâncias de :class:`HTMLParser` possuem os seguintes métodos:

source: Feed some text to the parser. It is processed insofar as it consists of complete elements; incomplete data is buffered until more data is fed or :meth:`close` is called. *data* must be :class:`str`.
pt_pt: Fornece texto ao analisador. Este é processado na medida em que consista em elementos completos; dados incompletos são mantidos num buffer até que mais dados sejam fornecidos ou o método :meth:`close` seja chamado. *data* deve ser uma :class:`str`.

source: Force processing of all buffered data as if it were followed by an end-of-file mark. This method may be redefined by a derived class to define additional processing at the end of the input, but the redefined version should always call the :class:`HTMLParser` base class method :meth:`close`.
pt_pt: Força o processamento de todos os dados no buffer como se fossem seguidos por uma marca de fim de ficheiro. Este método pode ser redefinido por uma classe derivada para definir processamento adicional no final da entrada, mas a versão redefinida deve sempre chamar o método :meth:`close` da classe base :class:`HTMLParser`.

source: Reset the instance. Loses all unprocessed data. This is called implicitly at instantiation time.
pt_pt: Reinicia a instância. Perde todos os dados não processados. Isto é chamado implicitamente no momento da instanciação.

source: Return current line number and offset.
pt_pt: Retorna o número da linha atual e o deslocamento (*offset*).

source: Return the text of the most recently opened start tag. This should not normally be needed for structured processing, but may be useful in dealing with HTML "as deployed" or for re-generating input with minimal changes (whitespace between attributes can be preserved, etc.).
pt_pt: Retorna o texto da tag de abertura mais recentemente aberta. Normalmente não deve ser necessário para processamento estruturado, mas pode ser útil ao lidar com HTML "tal como publicado" ou para gerar novamente a entrada com alterações mínimas (espaços em branco entre atributos podem ser preservados, etc.).

source: The following methods are called when data or markup elements are encountered and they are meant to be overridden in a subclass. The base class implementations do nothing (except for :meth:`~HTMLParser.handle_startendtag`):
pt_pt: Os métodos seguintes são chamados quando são encontrados dados ou elementos de marcação e destinam-se a ser sobrepostos numa subclasse. As implementações da classe base não fazem nada (exceto no caso de :meth:`~HTMLParser.handle_startendtag`):

source: This method is called to handle the start tag of an element (e.g. ``<div id="main">``).
pt_pt: Este método é chamado para manipular o marcador de abertura de um elemento (ex: ``<div id="main">``).

source: The *tag* argument is the name of the tag converted to lower case. The *attrs* argument is a list of ``(name, value)`` pairs containing the attributes found inside the tag's ``<>`` brackets. The *name* will be translated to lower case, and quotes in the *value* have been removed, and character and entity references have been replaced.
pt_pt: O argumento *tag* é o nome da tag convertido para minúsculas. O argumento *attrs* é uma lista de pares ``(nome, valor)`` contendo os atributos encontrados dentro dos parênteses angulares ``<>`` da tag. O *nome* será traduzido para minúsculas, as aspas no *valor* são removidas e as referências de caracteres e entidades são substituídas.

source: For instance, for the tag ``<A HREF="https://www.cwi.nl/">``, this method would be called as ``handle_starttag('a', [('href', 'https://www.cwi.nl/')])``.
pt_pt: Por exemplo, para a tag ``<A HREF="https://www.cwi.nl/">``, este método seria chamado como ``handle_starttag('a', [('href', 'https://www.cwi.nl/')])``.

source: All entity references from :mod:`html.entities` are replaced in the attribute values.
pt_pt: Todas as referências de entidades de :mod:`html.entities` são substituídas nos valores dos atributos.

source: This method is called to handle the end tag of an element (e.g. ``</div>``).
pt_pt: Este método é chamado para manipular a tag de fecho de um elemento (ex: ``</div>``).

source: The *tag* argument is the name of the tag converted to lower case.
pt_pt: O argumento *tag* é o nome da tag convertido para minúsculas.

source: Similar to :meth:`handle_starttag`, but called when the parser encounters an XHTML-style empty tag (``<img ... />``). This method may be overridden by subclasses which require this particular lexical information; the default implementation simply calls :meth:`handle_starttag` and :meth:`handle_endtag`.
pt_pt: Semelhante ao :meth:`handle_starttag`, mas chamado quando o analisador encontra uma tag vazia ao estilo XHTML (``<img ... />``). Este método pode ser sobreposto por subclasses que requeiram esta informação lexical particular; a implementação por omissão simplesmente chama :meth:`handle_starttag` e :meth:`handle_endtag`.

source: This method is called to process arbitrary data (e.g. text nodes and the content of elements like ``script`` and ``style``).
pt_pt: Este método é chamado para processar dados arbitrários (ex: nós de texto e o conteúdo de elementos como ``script`` e ``style``).

source: This method is called to process a named character reference of the form ``&name;`` (e.g. ``&gt;``), where *name* is a general entity reference (e.g. ``'gt'``). This method is only called if *convert_charrefs* is false.
pt_pt: Este método é chamado para processar uma referência de caráter nomeada do tipo ``&nome;`` (ex: ``&gt;``), onde *nome* é uma referência de entidade geral (ex: ``'gt'``). Este método só é chamado se *convert_charrefs* for falso.

source: This method is called to process decimal and hexadecimal numeric character references of the form :samp:`&#{NNN};` and :samp:`&#x{NNN};`. For example, the decimal equivalent for ``&gt;`` is ``&#62;``, whereas the hexadecimal is ``&#x3E;``; in this case the method will receive ``'62'`` or ``'x3E'``. This method is only called if *convert_charrefs* is false.
pt_pt: Este método é chamado para processar referências numéricas de caracteres decimais e hexadecimais da forma :samp:`&#{NNN};` e :samp:`&#x{NNN};`. Por exemplo, o equivalente decimal para ``&gt;`` é ``&#62;``, enquanto o hexadecimal é ``&#x3E;``; neste caso, o método receberá ``'62'`` ou ``'x3E'``. Este método só é chamado se *convert_charrefs* for falso.

source: This method is called to handle an HTML doctype declaration (e.g. ``<!DOCTYPE html>``).
pt_pt: Este método é chamado para manipular uma declaração doctype de HTML (ex: ``<!DOCTYPE html>``).

source: The *decl* parameter will be the entire contents of the declaration inside the ``<!...>`` markup (e.g. ``'DOCTYPE html'``).
pt_pt: O parâmetro *decl* será todo o conteúdo da declaração dentro da marcação ``<!...>`` (ex: ``'DOCTYPE html'``).

source: Method called when a processing instruction is encountered. The *data* parameter will contain the entire processing instruction. For example, for the processing instruction ``<?proc color='red'>``, this method would be called as ``handle_pi("proc color='red'")``. It is intended to be overridden by a derived class; the base class implementation does nothing.
pt_pt: Método chamado quando uma instrução de processamento é encontrada. O parâmetro *data* conterá a instrução de processamento completa. Por exemplo, para a instrução ``<?proc color='red'>``, este método seria chamado como ``handle_pi("proc color='red'")``. Destina-se a ser sobreposto por uma classe derivada; a implementação da classe base não faz nada.

source: The :class:`HTMLParser` class uses the SGML syntactic rules for processing instructions. An XHTML processing instruction using the trailing ``'?'`` will cause the ``'?'`` to be included in *data*.
pt_pt: A classe :class:`HTMLParser` utiliza as regras sintáticas SGML para instruções de processamento. Uma instrução de processamento XHTML que utilize um ``'?'`` no final fará com que o ``'?'`` seja incluído em *data*.

source: This method is called when an unrecognized declaration is read by the parser.
pt_pt: Este método é chamado quando uma declaração não reconhecida é lida pelo analisador.

source: The *data* parameter will be the entire contents of the declaration inside the ``<![...]>`` markup. It is sometimes useful to be overridden by a derived class. The base class implementation does nothing.
pt_pt: O parâmetro *data* será todo o conteúdo da declaração dentro da marcação ``<![...]>``. Por vezes é útil sobrepô-lo numa classe derivada. A implementação da classe base não faz nada.

source: Examples
pt_pt: Exemplos

source: The following class implements a parser that will be used to illustrate more examples:
pt_pt: A classe seguinte implementa um analisador que será utilizado para ilustrar mais exemplos:

source: Parsing a doctype:
pt_pt: Analisar um doctype:

source: Parsing an element with a few attributes and a title:
pt_pt: Analisar um elemento com alguns atributos e um título:

source: The content of elements like ``script`` and ``style`` is returned as is, without further parsing:
pt_pt: O conteúdo de elementos como ``script`` e ``style`` é retornado tal como está, sem análise adicional:

source: Parsing comments:
pt_pt: Analisar comentários:

source: Parsing named and numeric character references and converting them to the correct char (note: these 3 references are all equivalent to ``'>'``):
pt_pt: Analisar referências de caracteres numéricas e nomeadas e convertê-las para o caráter correto (nota: estas 3 referências são todas equivalentes a ``'>'``):

source: Feeding incomplete chunks to :meth:`~HTMLParser.feed` works, but :meth:`~HTMLParser.handle_data` might be called more than once if *convert_charrefs* is false:
pt_pt: Fornecer pedaços (*chunks*) incompletos ao :meth:`~HTMLParser.feed` funciona, mas o :meth:`~HTMLParser.handle_data` pode ser chamado mais do que uma vez se *convert_charrefs* for falso:

source: Parsing invalid HTML (e.g. unquoted attributes) also works:
pt_pt: Analisar HTML inválido (ex: atributos sem aspas) também funciona:
