Repository: NyaPuma/python-docs-pt
Catalog: library/json.po
Languages: pt_pt

source: If the data being deserialized is not a valid JSON document, a :exc:`JSONDecodeError` will be raised.
pt_pt: Se os dados a serem descodificados não forem um documento JSON válido, será lançado um :exc:`JSONDecodeError`.

source: All parameters are now :ref:`keyword-only <keyword-only_parameter>`.
pt_pt: Todos os parâmetros são agora :ref:`apenas por palavra-chave <keyword-only_parameter>`.

source: Return the Python representation of *s* (a :class:`str` instance containing a JSON document).
pt_pt: Retorna a representação Python de *s* (uma instância :class:`str` que contém um documento JSON).

source: :exc:`JSONDecodeError` will be raised if the given JSON document is not valid.
pt_pt: Será lançado um :exc:`JSONDecodeError` se o documento JSON fornecido não for válido.

source: Decode a JSON document from *s* (a :class:`str` beginning with a JSON document) and return a 2-tuple of the Python representation and the index in *s* where the document ended.
pt_pt: Descodificar um documento JSON a partir de *s* (uma :class:`str` que começa com um documento JSON) e retornar um tuplo de 2 elementos com a representação Python e o índice em *s* onde o documento terminou.

source: This can be used to decode a JSON document from a string that may have extraneous data at the end.
pt_pt: Isto pode ser usado para descodificar um documento JSON a partir de uma string que pode ter dados extranos no final.

source: Extensible JSON encoder for Python data structures.
pt_pt: Codificador JSON extensível para estruturas de dados Python.

source: Supports the following objects and types by default:
pt_pt: Suporta os seguintes objetos e tipos por predefinição:

source: list, tuple
pt_pt: lista, tuplo

source: int, float, int- & float-derived Enums
pt_pt: int, float, Enums derivados de int e float

source: number
pt_pt: número

source: Added support for int- and float-derived Enum classes.
pt_pt: Adicionado suporte para classes Enum derivadas de int e float.

source: To extend this to recognize other objects, subclass and implement a :meth:`~JSONEncoder.default` method with another method that returns a serializable object for ``o`` if possible, otherwise it should call the superclass implementation (to raise :exc:`TypeError`).
pt_pt: Para estender isto para reconhecer outros objetos, crie uma subclasse e implemente um método :meth:`~JSONEncoder.default` com outro método que retorne um objeto serializável para ``o``, se possível; caso contrário, deve chamar a implementação da superclasse (para lançar :exc:`TypeError`).

source: If *skipkeys* is false (the default), a :exc:`TypeError` will be raised when trying to encode keys that are not :class:`str`, :class:`int`, :class:`float`, :class:`bool` or ``None``. If *skipkeys* is true, such items are simply skipped.
pt_pt: Se *skipkeys* for falso (predefinição), será lançado um :exc:`TypeError` ao tentar codificar chaves que não sejam :class:`str`, :class:`int`, :class:`float`, :class:`bool` ou ``None``. Se *skipkeys* for verdadeiro, esses itens são simplesmente ignorados.

source: If *ensure_ascii* is true (the default), the output is guaranteed to have all incoming non-ASCII and non-printable characters escaped. If *ensure_ascii* is false, all characters will be output as-is, except for the characters that must be escaped: quotation mark, reverse solidus, and the control characters U+0000 through U+001F.
pt_pt: Se *ensure_ascii* for verdadeiro (predefinição), a saída terá todos os caracteres não-ASCII e não-imprimíveis escapados. Se *ensure_ascii* for falso, todos os caracteres serão apresentados como estão, exceto os caracteres que devem ser escapados: aspas, barra invertida e os caracteres de controlo U+0000 a U+001F.

source: If *check_circular* is true (the default), then lists, dicts, and custom encoded objects will be checked for circular references during encoding to prevent an infinite recursion (which would cause a :exc:`RecursionError`). Otherwise, no such check takes place.
pt_pt: Se *check_circular* for verdadeiro (predefinição), então listas, dicionários e objetos codificados personalizados serão verificados quanto a referências circulares durante a codificação para evitar uma recursão infinita (o que causaria um :exc:`RecursionError`). Caso contrário, essa verificação não ocorre.

source: If *allow_nan* is true (the default), then ``NaN``, ``Infinity``, and ``-Infinity`` will be encoded as such. This behavior is not JSON specification compliant, but is consistent with most JavaScript based encoders and decoders. Otherwise, it will be a :exc:`ValueError` to encode such floats.
pt_pt: Se *allow_nan* for verdadeiro (predefinição), então ``NaN``, ``Infinity`` e ``-Infinity`` serão codificados como tal. Este comportamento não está em conformidade com a especificação JSON, mas é consistente com a maioria dos codificadores e descodificadores baseados em JavaScript. Caso contrário, será lançado um :exc:`ValueError` ao codificar tais floats.

source: If *sort_keys* is true (default: ``False``), then the output of dictionaries will be sorted by key; this is useful for regression tests to ensure that JSON serializations can be compared on a day-to-day basis.
pt_pt: Se *sort_keys* for verdadeiro (predefinição: ``False``), então a saída dos dicionários será ordenada por chave; isto é útil para testes de regressão para garantir que as serializações JSON possam ser comparadas diariamente.

source: If *indent* is a non-negative integer or string, then JSON array elements and object members will be pretty-printed with that indent level. An indent level of 0, negative, or ``""`` will only insert newlines. ``None`` (the default) selects the most compact representation. Using a positive integer indent indents that many spaces per level. If *indent* is a string (such as ``"\t"``), that string is used to indent each level.
pt_pt: Se *indent* for um número inteiro não-negativo ou uma string, então os elementos de arrays JSON e os membros de objetos serão apresentados com esse nível de indentação. Um nível de indentação de 0, negativo ou ``""`` apenas inserirá quebras de linha. ``None`` (predefinição) seleciona a representação mais compacta. Usar um número inteiro positivo para indentação recua esse número de espaços por nível. Se *indent* for uma string (como ``"\t"``), essa string é usada para recuar cada nível.

source: If specified, *separators* should be an ``(item_separator, key_separator)`` tuple. The default is ``(', ', ': ')`` if *indent* is ``None`` and ``(',', ': ')`` otherwise. To get the most compact JSON representation, you should specify ``(',', ':')`` to eliminate whitespace.
pt_pt: Se especificado, *separators* deve ser um tuplo ``(item_separator, key_separator)``. A predefinição é ``(', ', ': ')`` se *indent* for ``None`` e ``(',', ': ')`` caso contrário. Para obter a representação JSON mais compacta, deve especificar ``(',', ':')`` para eliminar espaços em branco.

source: If specified, *default* should be a function that gets called for objects that can't otherwise be serialized. It should return a JSON encodable version of the object or raise a :exc:`TypeError`. If not specified, :exc:`TypeError` is raised.
pt_pt: Se especificado, *default* deve ser uma função que é chamada para objetos que não podem ser serializados de outra forma. Deve retornar uma versão do objeto que possa ser codificada em JSON ou lançar um :exc:`TypeError`. Se não for especificado, é lançado um :exc:`TypeError`.

source: Implement this method in a subclass such that it returns a serializable object for *o*, or calls the base implementation (to raise a :exc:`TypeError`).
pt_pt: Implemente este método numa subclasse de forma a que retorne um objeto serializável para *o*, ou chame a implementação da classe base (para lançar um :exc:`TypeError`).

source: For example, to support arbitrary iterators, you could implement :meth:`~JSONEncoder.default` like this::
pt_pt: Por exemplo, para suportar iteradores arbitrários, pode implementar :meth:`~JSONEncoder.default` assim::

source: def default(self, o): try: iterable = iter(o) except TypeError: pass else: return list(iterable) # Let the base class default method raise the TypeError return super().default(o)
pt_pt: def default(self, o): try: iterable = iter(o) except TypeError: pass else: return list(iterable) # Deixar o método default da classe base lançar o TypeError return super().default(o)

source: Return a JSON string representation of a Python data structure, *o*. For example::
pt_pt: Retorna uma representação em string JSON de uma estrutura de dados Python, *o*. Por exemplo::

source: Encode the given object, *o*, and yield each string representation as available. For example::
pt_pt: Codificar o objeto dado, *o*, e produzir cada representação em string conforme disponível. Por exemplo::

source: Exceptions
pt_pt: Exceções

source: Subclass of :exc:`ValueError` with the following additional attributes:
pt_pt: Subclasse de :exc:`ValueError` com os seguintes atributos adicionais:

source: The unformatted error message.
pt_pt: A mensagem de erro não formatada.

source: The JSON document being parsed.
pt_pt: O documento JSON a ser analisado.

source: The start index of *doc* where parsing failed.
pt_pt: O índice inicial de *doc* onde a análise falhou.

source: The line corresponding to *pos*.
pt_pt: A linha correspondente a *pos*.

source: The column corresponding to *pos*.
pt_pt: A coluna correspondente a *pos*.

source: Standard Compliance and Interoperability
pt_pt: Conformidade Padrão e Interoperabilidade

source: The JSON format is specified by :rfc:`7159` and by `ECMA-404 <https://ecma-international.org/publications-and-standards/standards/ecma-404/>`_. This section details this module's level of compliance with the RFC. For simplicity, :class:`JSONEncoder` and :class:`JSONDecoder` subclasses, and parameters other than those explicitly mentioned, are not considered.
pt_pt: O formato JSON é especificado pelo :rfc:`7159` e pelo `ECMA-404 <https://ecma-international.org/publications-and-standards/standards/ecma-404/>`_. Esta secção detalha o nível de conformidade deste módulo com o RFC. Por simplicidade, subclasses de :class:`JSONEncoder` e :class:`JSONDecoder`, e parâmetros além daqueles explicitamente mencionados, não são considerados.

source: This module does not comply with the RFC in a strict fashion, implementing some extensions that are valid JavaScript but not valid JSON. In particular:
pt_pt: Este módulo não cumpre estritamente o RFC, implementando algumas extensões que são válidas em JavaScript mas não em JSON. Em particular:

source: Infinite and NaN number values are accepted and output;
pt_pt: Valores numéricos infinitos e NaN são aceites e apresentados;

source: Repeated names within an object are accepted, and only the value of the last name-value pair is used.
pt_pt: Nomes repetidos dentro de um objeto são aceites, e apenas o valor do último par nome-valor é usado.

source: Since the RFC permits RFC-compliant parsers to accept input texts that are not RFC-compliant, this module's deserializer is technically RFC-compliant under default settings.
pt_pt: Como o RFC permite que analisadores conformes com o RFC aceitem textos de entrada que não são conformes com o RFC, o descodificador deste módulo é tecnicamente conforme com o RFC nas configurações predefinidas.

source: Character Encodings
pt_pt: Codificações de Caracteres

source: The RFC requires that JSON be represented using either UTF-8, UTF-16, or UTF-32, with UTF-8 being the recommended default for maximum interoperability.
pt_pt: O RFC exige que o JSON seja representado usando UTF-8, UTF-16 ou UTF-32, sendo o UTF-8 a recomendação predefinida para máxima interoperabilidade.

source: As permitted, though not required, by the RFC, this module's serializer sets *ensure_ascii=True* by default, thus escaping the output so that the resulting strings only contain printable ASCII characters.
pt_pt: Como permitido, embora não obrigatório, pelo RFC, o serializador deste módulo define *ensure_ascii=True* por predefinição, escapando assim a saída para que as strings resultantes conttenham apenas caracteres ASCII imprimíveis.

source: Other than the *ensure_ascii* parameter, this module is defined strictly in terms of conversion between Python objects and :class:`Unicode strings <str>`, and thus does not otherwise directly address the issue of character encodings.
pt_pt: Além do parâmetro *ensure_ascii*, este módulo é definido estritamente em termos de conversão entre objetos Python e :class:`strings Unicode <str>`, e assim não aborda diretamente a questão das codificações de caracteres.

source: The RFC prohibits adding a byte order mark (BOM) to the start of a JSON text, and this module's serializer does not add a BOM to its output. The RFC permits, but does not require, JSON deserializers to ignore an initial BOM in their input. This module's deserializer raises a :exc:`ValueError` when an initial BOM is present.
pt_pt: O RFC proíbe a adição de uma marca de ordem de bytes (BOM) ao início de um texto JSON, e o serializador deste módulo não adiciona uma BOM à sua saída. O RFC permite, mas não exige, que os descodificadores JSON ignorem uma BOM inicial na sua entrada. O descodificador deste módulo lança um :exc:`ValueError` quando uma BOM inicial está presente.

source: The RFC does not explicitly forbid JSON strings which contain byte sequences that don't correspond to valid Unicode characters (e.g. unpaired UTF-16 surrogates), but it does note that they may cause interoperability problems. By default, this module accepts and outputs (when present in the original :class:`str`) code points for such sequences.
pt_pt: O RFC não proíbe explicitamente strings JSON que contenham sequências de bytes que não correspondam a caracteres Unicode válidos (por exemplo, surrogates UTF-16 não emparelhados), mas observa que podem causar problemas de interoperabilidade. Por predefinição, este módulo aceita e apresenta (quando presentes na :class:`str` original) pontos de código para tais sequências.

source: Infinite and NaN Number Values
pt_pt: Valores Numéricos Infinitos e NaN

source: The RFC does not permit the representation of infinite or NaN number values. Despite that, by default, this module accepts and outputs ``Infinity``, ``-Infinity``, and ``NaN`` as if they were valid JSON number literal values::
pt_pt: O RFC não permite a representação de valores numéricos infinitos ou NaN. Apesar disso, por predefinição, este módulo aceita e apresenta ``Infinity``, ``-Infinity`` e ``NaN`` como se fossem valores literais numéricos JSON válidos::

source: >>> # Neither of these calls raises an exception, but the results are not valid JSON >>> json.dumps(float('-inf')) '-Infinity' >>> json.dumps(float('nan')) 'NaN' >>> # Same when deserializing >>> json.loads('-Infinity') -inf >>> json.loads('NaN') nan
pt_pt: >>> # Nenhuma destas chamadas lança uma exceção, mas os resultados não são JSON válido >>> json.dumps(float('-inf')) '-Infinity' >>> json.dumps(float('nan')) 'NaN' >>> # O mesmo ao descodificar >>> json.loads('-Infinity') -inf >>> json.loads('NaN') nan

source: In the serializer, the *allow_nan* parameter can be used to alter this behavior. In the deserializer, the *parse_constant* parameter can be used to alter this behavior.
pt_pt: No serializador, o parâmetro *allow_nan* pode ser usado para alterar este comportamento. No descodificador, o parâmetro *parse_constant* pode ser usado para alterar este comportamento.

source: Repeated Names Within an Object
pt_pt: Nomes Repetidos Dentro de um Objeto

source: The RFC specifies that the names within a JSON object should be unique, but does not mandate how repeated names in JSON objects should be handled. By default, this module does not raise an exception; instead, it ignores all but the last name-value pair for a given name::
pt_pt: O RFC especifica que os nomes dentro de um objeto JSON devem ser únicos, mas não impõe como os nomes repetidos em objetos JSON devem ser tratados. Por predefinição, este módulo não lança uma exceção; em vez disso, ignora todos exceto o último par nome-valor para um dado nome::

source: The *object_pairs_hook* parameter can be used to alter this behavior.
pt_pt: O parâmetro *object_pairs_hook* pode ser usado para alterar este comportamento.

source: Top-level Non-Object, Non-Array Values
pt_pt: Valores de Nível Superior Não-Objeto e Não-Array

source: The old version of JSON specified by the obsolete :rfc:`4627` required that the top-level value of a JSON text must be either a JSON object or array (Python :class:`dict` or :class:`list`), and could not be a JSON null, boolean, number, or string value. :rfc:`7159` removed that restriction, and this module does not and has never implemented that restriction in either its serializer or its deserializer.
pt_pt: A versão antiga do JSON especificada pelo obsoleto :rfc:`4627` exigia que o valor de nível superior de um texto JSON fosse um objeto ou array JSON (Python :class:`dict` ou :class:`list`), e não podia ser um valor nulo, booleano, numérico ou string JSON. O :rfc:`7159` removeu essa restrição, e este módulo nunca implementou essa restrição, nem no seu serializador nem no seu descodificador.

source: Regardless, for maximum interoperability, you may wish to voluntarily adhere to the restriction yourself.
pt_pt: Independentemente disso, para máxima interoperabilidade, pode optar por aderir voluntariamente a essa restrição.

source: Implementation Limitations
pt_pt: Limitações de Implementação

source: Some JSON deserializer implementations may set limits on:
pt_pt: Algumas implementações de descodificadores JSON podem definir limites em:

source: the size of accepted JSON texts
pt_pt: o tamanho dos textos JSON aceites

source: the maximum level of nesting of JSON objects and arrays
pt_pt: o nível máximo de aninhamento de objetos e arrays JSON

source: the range and precision of JSON numbers
pt_pt: a gama e precisão dos números JSON

source: the content and maximum length of JSON strings
pt_pt: o conteúdo e comprimento máximo das strings JSON

source: This module does not impose any such limits beyond those of the relevant Python datatypes themselves or the Python interpreter itself.
pt_pt: Este módulo não impõe quaisquer limites além daqueles dos próprios tipos de dados Python ou do interpretador Python.

source: When serializing to JSON, beware any such limitations in applications that may consume your JSON. In particular, it is common for JSON numbers to be deserialized into IEEE 754 double precision numbers and thus subject to that representation's range and precision limitations. This is especially relevant when serializing Python :class:`int` values of extremely large magnitude, or when serializing instances of "exotic" numerical types such as :class:`decimal.Decimal`.
pt_pt: Ao serializar para JSON, esteja ciente de quaisquer limitações em aplicações que possam consumir o seu JSON. Em particular, é comum que números JSON sejam descodificados em números de precisão dupla IEEE 754 e, assim, estejam sujeitos às limitações de gama e precisão dessa representação. Isto é especialmente relevante ao serializar valores :class:`int` Python de magnitude extremamente grande, ou ao serializar instâncias de tipos numéricos "exóticos" como :class:`decimal.Decimal`.

source: Command-line interface
pt_pt: Interface de Linha de Comandos

source: **Source code:** :source:`Lib/json/tool.py`
pt_pt: **Código-fonte:** :source:`Lib/json/tool.py`

source: If the optional ``infile`` and ``outfile`` arguments are not specified, :data:`sys.stdin` and :data:`sys.stdout` will be used respectively:
pt_pt: Se os argumentos opcionais ``infile`` e ``outfile`` não forem especificados, serão usados :data:`sys.stdin` e :data:`sys.stdout`, respetivamente:

source: $ echo '{"json": "obj"}' | python -m json { "json": "obj" } $ echo '{1.2:3.4}' | python -m json Expecting property name enclosed in double quotes: line 1 column 2 (char 1)
pt_pt: $ echo '{"json": "obj"}' | python -m json { "json": "obj" } $ echo '{1.2:3.4}' | python -m json Esperado nome de propriedade entre aspas duplas: linha 1 coluna 2 (caractere 1)

source: The output is now in the same order as the input. Use the :option:`--sort-keys` option to sort the output of dictionaries alphabetically by key.
pt_pt: A saída está agora na mesma ordem que a entrada. Use a opção :option:`--sort-keys` para ordenar a saída dos dicionários alfabéticamente por chave.

source: Command-line options
pt_pt: Opções de Linha de Comandos

source: The JSON file to be validated or pretty-printed:
pt_pt: O ficheiro JSON a ser validado ou formatado:

source: If *infile* is not specified, read from :data:`sys.stdin`.
pt_pt: Se *infile* não for especificado, ler a partir de :data:`sys.stdin`.

source: Write the output of the *infile* to the given *outfile*. Otherwise, write it to :data:`sys.stdout`.
pt_pt: Escrever a saída de *infile* para o *outfile* dado. Caso contrário, escrever para :data:`sys.stdout`.

source: Sort the output of dictionaries alphabetically by key.
pt_pt: Ordenar a saída dos dicionários alfabéticamente por chave.

source: Disable escaping of non-ascii characters, see :func:`json.dumps` for more information.
pt_pt: Desativar o escape de caracteres não-ASCII; consulte :func:`json.dumps` para mais informações.

source: Parse every input line as separate JSON object.
pt_pt: Analisar cada linha de entrada como um objeto JSON separado.

source: Mutually exclusive options for whitespace control.
pt_pt: Opções mutuamente exclusivas para controlo de espaços em branco.

source: Show the help message.
pt_pt: Mostrar a mensagem de ajuda.

source: Footnotes
pt_pt: Notas de Rodapé

source: As noted in `the errata for RFC 7159 <https://www.rfc-editor.org/errata_search.php?rfc=7159>`_, JSON permits literal U+2028 (LINE SEPARATOR) and U+2029 (PARAGRAPH SEPARATOR) characters in strings, whereas JavaScript (as of ECMAScript Edition 5.1) does not.
pt_pt: Como observado nos `errata para o RFC 7159 <https://www.rfc-editor.org/errata_search.php?rfc=7159>`_, o JSON permite caracteres literais U+2028 (SEPARADOR DE LINHA) e U+2029 (SEPARADOR DE PARÁGRAFO) em strings, enquanto o JavaScript (até à Edição 5.1 do ECMAScript) não permite.
