Repository: NyaPuma/python-docs-pt
Catalog: library/json.po
Languages: pt_pt

source: :mod:`!json` --- JSON encoder and decoder
pt_pt: :mod:`!json` --- Codificador e descodificador JSON

source: **Source code:** :source:`Lib/json/__init__.py`
pt_pt: **Código-fonte:** :source:`Lib/json/__init__.py`

source: `JSON (JavaScript Object Notation) <https://json.org>`_, specified by :rfc:`7159` (which obsoletes :rfc:`4627`) and by `ECMA-404 <https://ecma-international.org/publications-and-standards/standards/ecma-404/>`_, is a lightweight data interchange format inspired by `JavaScript <https://en.wikipedia.org/wiki/JavaScript>`_ object literal syntax (although it is not a strict subset of JavaScript [#rfc-errata]_ ).
pt_pt: `JSON (JavaScript Object Notation) <https://json.org>`_, especificado pelo :rfc:`7159` (que substitui o :rfc:`4627`) e pelo `ECMA-404 <https://ecma-international.org/publications-and-standards/standards/ecma-404/>`_, é um formato leve de intercâmbio de dados inspirado na sintaxe de objetos literais do `JavaScript <https://en.wikipedia.org/wiki/JavaScript>`_ (embora não seja um subconjunto estrito do JavaScript [#rfc-errata]_ ).

source: The term "object" in the context of JSON processing in Python can be ambiguous. All values in Python are objects. In JSON, an object refers to any data wrapped in curly braces, similar to a Python dictionary.
pt_pt: O termo "objeto" no contexto do processamento JSON em Python pode ser ambíguo. Todos os valores em Python são objetos. Em JSON, um objeto refere-se a quaisquer dados envolvidos por chavetas, semelhante a um dicionário Python.

source: Be cautious when parsing JSON data from untrusted sources. A malicious JSON string may cause the decoder to consume considerable CPU and memory resources. Limiting the size of data to be parsed is recommended.
pt_pt: Tenha cuidado ao analisar dados JSON de fontes não confiáveis. Uma string JSON maliciosa pode fazer com que o descodificador consuma recursos significativos de CPU e memória. Recomenda-se limitar o tamanho dos dados a serem analisados.

source: This module exposes an API familiar to users of the standard library :mod:`marshal` and :mod:`pickle` modules.
pt_pt: Este módulo expõe uma API familiar aos utilizadores dos módulos da biblioteca padrão :mod:`marshal` e :mod:`pickle`.

source: Encoding basic Python object hierarchies::
pt_pt: Codificação de hierarquias básicas de objetos Python::

source: Compact encoding::
pt_pt: Codificação compacta::

source: Pretty printing::
pt_pt: Impressão formatada::

source: Customizing JSON object encoding::
pt_pt: Personalização da codificação de objetos JSON::

source: >>> import json >>> def custom_json(obj): ... if isinstance(obj, complex): ... return {'__complex__': True, 'real': obj.real, 'imag': obj.imag} ... raise TypeError(f'Cannot serialize object of {type(obj)}') ... >>> json.dumps(1 + 2j, default=custom_json) '{"__complex__": true, "real": 1.0, "imag": 2.0}'
pt_pt: >>> import json >>> def custom_json(obj): ... if isinstance(obj, complex): ... return {'__complex__': True, 'real': obj.real, 'imag': obj.imag} ... raise TypeError(f'Não é possível serializar objeto do tipo {type(obj)}') ... >>> json.dumps(1 + 2j, default=custom_json) '{"__complex__": true, "real": 1.0, "imag": 2.0}'

source: Decoding JSON::
pt_pt: Descodificação de JSON::

source: Customizing JSON object decoding::
pt_pt: Personalização da descodificação de objetos JSON::

source: Extending :class:`JSONEncoder`::
pt_pt: Estender a classe :class:`JSONEncoder`::

source: >>> import json >>> class ComplexEncoder(json.JSONEncoder): ... def default(self, obj): ... if isinstance(obj, complex): ... return [obj.real, obj.imag] ... # Let the base class default method raise the TypeError ... return super().default(obj) ... >>> json.dumps(2 + 1j, cls=ComplexEncoder) '[2.0, 1.0]' >>> ComplexEncoder().encode(2 + 1j) '[2.0, 1.0]' >>> list(ComplexEncoder().iterencode(2 + 1j)) ['[2.0', ', 1.0', ']']
pt_pt: >>> import json >>> class ComplexEncoder(json.JSONEncoder): ... def default(self, obj): ... if isinstance(obj, complex): ... return [obj.real, obj.imag] ... # Deixar o método default da classe base lançar o TypeError ... return super().default(obj) ... >>> json.dumps(2 + 1j, cls=ComplexEncoder) '[2.0, 1.0]' >>> ComplexEncoder().encode(2 + 1j) '[2.0, 1.0]' >>> list(ComplexEncoder().iterencode(2 + 1j)) ['[2.0', ', 1.0', ']']

source: $ echo '{"json":"obj"}' | python -m json { "json": "obj" } $ echo '{1.2:3.4}' | python -m json Expecting property name enclosed in double quotes: line 1 column 2 (char 1)
pt_pt: $ echo '{"json":"obj"}' | python -m json { "json": "obj" } $ echo '{1.2:3.4}' | python -m json Esperado nome de propriedade entre aspas duplas: linha 1 coluna 2 (caractere 1)

source: See :ref:`json-commandline` for detailed documentation.
pt_pt: Consulte :ref:`json-commandline` para documentação detalhada.

source: JSON is a subset of `YAML <https://yaml.org/>`_ 1.2. The JSON produced by this module's default settings (in particular, the default *separators* value) is also a subset of YAML 1.0 and 1.1. This module can thus also be used as a YAML serializer.
pt_pt: JSON é um subconjunto de `YAML <https://yaml.org/>`_ 1.2. O JSON produzido pelas definições predefinidas deste módulo (em particular, o valor predefinido de *separators*) também é um subconjunto de YAML 1.0 e 1.1. Este módulo pode, portanto, ser também utilizado como um serializador YAML.

source: This module's encoders and decoders preserve input and output order by default. Order is only lost if the underlying containers are unordered.
pt_pt: Os codificadores e descodificadores deste módulo preservam a ordem de entrada e saída por predefinição. A ordem só é perdida se os contentores subjacentes não forem ordenados.

source: Basic Usage
pt_pt: Utilização Básica

source: Serialize *obj* as a JSON formatted stream to *fp* (a ``.write()``-supporting :term:`file-like object`) using this :ref:`Python-to-JSON conversion table <py-to-json-table>`.
pt_pt: Serializar *obj* como um fluxo formatado em JSON para *fp* (um objeto semelhante a ficheiro que suporta ``.write()``) utilizando esta :ref:`tabela de conversão Python para JSON <py-to-json-table>`.

source: Unlike :mod:`pickle` and :mod:`marshal`, JSON is not a framed protocol, so trying to serialize multiple objects with repeated calls to :func:`dump` using the same *fp* will result in an invalid JSON file.
pt_pt: Ao contrário de :mod:`pickle` e :mod:`marshal`, JSON não é um protocolo enquadrado, portanto, tentar serializar vários objetos com chamadas repetidas a :func:`dump` usando o mesmo *fp* resultará num ficheiro JSON inválido.

source: Parameters
pt_pt: Parâmetros

source: The Python object to be serialized.
pt_pt: O objeto Python a ser serializado.

source: The file-like object *obj* will be serialized to. The :mod:`!json` module always produces :class:`str` objects, not :class:`bytes` objects, therefore ``fp.write()`` must support :class:`str` input.
pt_pt: O objeto semelhante a ficheiro *obj* para o qual será feita a serialização. O módulo :mod:`!json` produz sempre objetos :class:`str`, não objetos :class:`bytes`, portanto, ``fp.write()`` deve suportar entrada :class:`str`.

source: If ``True``, keys that are not of a basic type (:class:`str`, :class:`int`, :class:`float`, :class:`bool`, ``None``) will be skipped instead of raising a :exc:`TypeError`. Default ``False``.
pt_pt: Se ``True``, as chaves que não sejam de um tipo básico (:class:`str`, :class:`int`, :class:`float`, :class:`bool`, ``None``) serão ignoradas em vez de lançar um :exc:`TypeError`. Predefinição: ``False``.

source: If ``True`` (the default), the output is guaranteed to have all incoming non-ASCII and non-printable characters escaped. If ``False``, all characters will be outputted as-is, except for the characters that must be escaped: quotation mark, reverse solidus, and the control characters U+0000 through U+001F.
pt_pt: Se ``True`` (predefinição), a saída terá todos os caracteres não-ASCII e não-imprimíveis escapados. Se ``False``, todos os caracteres serão apresentados como estão, exceto os caracteres que devem ser escapados: aspas, barra invertida e os caracteres de controlo U+0000 a U+001F.

source: If ``False``, the circular reference check for container types is skipped and a circular reference will result in a :exc:`RecursionError` (or worse). Default ``True``.
pt_pt: Se ``False``, a verificação de referências circulares para tipos de contentores é ignorada e uma referência circular resultará num :exc:`RecursionError` (ou pior). Predefinição: ``True``.

source: If ``False``, serialization of out-of-range :class:`float` values (``nan``, ``inf``, ``-inf``) will result in a :exc:`ValueError`, in strict compliance with the JSON specification. If ``True`` (the default), their JavaScript equivalents (``NaN``, ``Infinity``, ``-Infinity``) are used.
pt_pt: Se ``False``, a serialização de valores :class:`float` fora do intervalo (``nan``, ``inf``, ``-inf``) resultará num :exc:`ValueError`, em estrita conformidade com a especificação JSON. Se ``True`` (predefinição), são usados os equivalentes JavaScript (``NaN``, ``Infinity``, ``-Infinity``).

source: If set, a custom JSON encoder with the :meth:`~JSONEncoder.default` method overridden, for serializing into custom datatypes. If ``None`` (the default), :class:`!JSONEncoder` is used.
pt_pt: Se definido, um codificador JSON personalizado com o método :meth:`~JSONEncoder.default` substituído, para serialização em tipos de dados personalizados. Se ``None`` (predefinição), é usado :class:`!JSONEncoder`.

source: If a positive integer or string, JSON array elements and object members will be pretty-printed with that indent level. A positive integer indents that many spaces per level; a string (such as ``"\t"``) is used to indent each level. If zero, negative, or ``""`` (the empty string), only newlines are inserted. If ``None`` (the default), the most compact representation is used.
pt_pt: Se for um número inteiro positivo ou uma string, os elementos de arrays JSON e os membros de objetos serão apresentados com esse nível de indentação. Um número inteiro positivo indenta esse número de espaços por nível; uma string (como ``"\t"``) é usada para indentar cada nível. Se for zero, negativo ou ``""`` (string vazia), apenas quebras de linha são inseridas. Se for ``None`` (predefinição), é usada a representação mais compacta.

source: A two-tuple: ``(item_separator, key_separator)``. If ``None`` (the default), *separators* defaults to ``(', ', ': ')`` if *indent* is ``None``, and ``(',', ': ')`` otherwise. For the most compact JSON, specify ``(',', ':')`` to eliminate whitespace.
pt_pt: Um tuplo de dois elementos: ``(item_separator, key_separator)``. Se ``None`` (predefinição), *separators* assume ``(', ', ': ')`` se *indent* for ``None``, e ``(',', ': ')`` caso contrário. Para o JSON mais compacto, especifique ``(',', ':')`` para eliminar espaços em branco.

source: A function that is called for objects that can't otherwise be serialized. It should return a JSON encodable version of the object or raise a :exc:`TypeError`. If ``None`` (the default), :exc:`!TypeError` is raised.
pt_pt: Uma função que é chamada para objetos que não podem ser serializados de outra forma. Deve retornar uma versão do objeto que possa ser codificada em JSON ou lançar um :exc:`TypeError`. Se ``None`` (predefinição), é lançado um :exc:`!TypeError`.

source: If ``True``, dictionaries will be outputted sorted by key. Default ``False``.
pt_pt: Se ``True``, os dicionários serão apresentados ordenados por chave. Predefinição: ``False``.

source: Allow strings for *indent* in addition to integers.
pt_pt: Permitir strings para *indent* além de números inteiros.

source: Use ``(',', ': ')`` as default if *indent* is not ``None``.
pt_pt: Usar ``(',', ': ')`` como predefinição se *indent* não for ``None``.

source: All optional parameters are now :ref:`keyword-only <keyword-only_parameter>`.
pt_pt: Todos os parâmetros opcionais são agora :ref:`apenas por palavra-chave <keyword-only_parameter>`.

source: Serialize *obj* to a JSON formatted :class:`str` using this :ref:`conversion table <py-to-json-table>`. The arguments have the same meaning as in :func:`dump`.
pt_pt: Serializar *obj* para uma string :class:`str` formatada em JSON usando esta :ref:`tabela de conversão <py-to-json-table>`. Os argumentos têm o mesmo significado que em :func:`dump`.

source: Keys in key/value pairs of JSON are always of the type :class:`str`. When a dictionary is converted into JSON, all the keys of the dictionary are coerced to strings. As a result of this, if a dictionary is converted into JSON and then back into a dictionary, the dictionary may not equal the original one. That is, ``loads(dumps(x)) != x`` if x has non-string keys.
pt_pt: As chaves em pares chave/valor de JSON são sempre do tipo :class:`str`. Quando um dicionário é convertido em JSON, todas as chaves do dicionário são convertidas para strings. Como resultado, se um dicionário for convertido em JSON e depois de volta para um dicionário, o dicionário resultante pode não ser igual ao original. Ou seja, ``loads(dumps(x)) != x`` se x tiver chaves não-string.

source: Deserialize *fp* to a Python object using the :ref:`JSON-to-Python conversion table <json-to-py-table>`.
pt_pt: Descodificar *fp* para um objeto Python usando a :ref:`tabela de conversão JSON para Python <json-to-py-table>`.

source: A ``.read()``-supporting :term:`text file` or :term:`binary file` containing the JSON document to be deserialized.
pt_pt: Um :term:`ficheiro de texto` ou :term:`ficheiro binário` que suporte ``.read()`` e contenha o documento JSON a ser descodificado.

source: If set, a custom JSON decoder. Additional keyword arguments to :func:`!load` will be passed to the constructor of *cls*. If ``None`` (the default), :class:`!JSONDecoder` is used.
pt_pt: Se definido, um descodificador JSON personalizado. Argumentos adicionais por palavra-chave para :func:`!load` serão passados ao construtor de *cls*. Se ``None`` (predefinição), é usado :class:`!JSONDecoder`.

source: If set, a function that is called with the result of any JSON object literal decoded (a :class:`dict`). The return value of this function will be used instead of the :class:`dict`. This feature can be used to implement custom decoders, for example `JSON-RPC <https://www.jsonrpc.org>`_ class hinting. Default ``None``.
pt_pt: Se definido, uma função que é chamada com o resultado de qualquer literal de objeto JSON descodificado (um :class:`dict`). O valor de retorno desta função será usado em vez do :class:`dict`. Esta funcionalidade pode ser usada para implementar descodificadores personalizados, por exemplo, dicas de classe `JSON-RPC <https://www.jsonrpc.org>`_. Predefinição: ``None``.

source: If set, a function that is called with the result of any JSON object literal decoded with an ordered list of pairs. The return value of this function will be used instead of the :class:`dict`. This feature can be used to implement custom decoders. If *object_hook* is also set, *object_pairs_hook* takes priority. Default ``None``.
pt_pt: Se definido, uma função que é chamada com o resultado de qualquer literal de objeto JSON descodificado com uma lista ordenada de pares. O valor de retorno desta função será usado em vez do :class:`dict`. Esta funcionalidade pode ser usada para implementar descodificadores personalizados. Se *object_hook* também estiver definido, *object_pairs_hook* tem prioridade. Predefinição: ``None``.

source: If set, a function that is called with the string of every JSON float to be decoded. If ``None`` (the default), it is equivalent to ``float(num_str)``. This can be used to parse JSON floats into custom datatypes, for example :class:`decimal.Decimal`.
pt_pt: Se definido, uma função que é chamada com a string de cada float JSON a ser descodificado. Se ``None`` (predefinição), é equivalente a ``float(num_str)``. Isto pode ser usado para analisar floats JSON em tipos de dados personalizados, por exemplo, :class:`decimal.Decimal`.

source: If set, a function that is called with the string of every JSON int to be decoded. If ``None`` (the default), it is equivalent to ``int(num_str)``. This can be used to parse JSON integers into custom datatypes, for example :class:`float`.
pt_pt: Se definido, uma função que é chamada com a string de cada inteiro JSON a ser descodificado. Se ``None`` (predefinição), é equivalente a ``int(num_str)``. Isto pode ser usado para analisar inteiros JSON em tipos de dados personalizados, por exemplo, :class:`float`.

source: If set, a function that is called with one of the following strings: ``'-Infinity'``, ``'Infinity'``, or ``'NaN'``. This can be used to raise an exception if invalid JSON numbers are encountered. Default ``None``.
pt_pt: Se definido, uma função que é chamada com uma das seguintes strings: ``'-Infinity'``, ``'Infinity'`` ou ``'NaN'``. Isto pode ser usado para lançar uma exceção se forem encontrados números JSON inválidos. Predefinição: ``None``.

source: Raises
pt_pt: Lança

source: When the data being deserialized is not a valid JSON document.
pt_pt: Quando os dados a serem descodificados não são um documento JSON válido.

source: When the data being deserialized does not contain UTF-8, UTF-16 or UTF-32 encoded data.
pt_pt: Quando os dados a serem descodificados não contêm dados codificados em UTF-8, UTF-16 ou UTF-32.

source: Added the optional *object_pairs_hook* parameter.
pt_pt: Adicionado o parâmetro opcional *object_pairs_hook*.

source: *parse_constant* doesn't get called on 'null', 'true', 'false' anymore.
pt_pt: *parse_constant* já não é chamado para 'null', 'true' ou 'false'.

source: *fp* can now be a :term:`binary file`. The input encoding should be UTF-8, UTF-16 or UTF-32.
pt_pt: *fp* pode agora ser um :term:`ficheiro binário`. A codificação de entrada deve ser UTF-8, UTF-16 ou UTF-32.

source: The default *parse_int* of :func:`int` now limits the maximum length of the integer string via the interpreter's :ref:`integer string conversion length limitation <int_max_str_digits>` to help avoid denial of service attacks.
pt_pt: O *parse_int* predefinido de :func:`int` agora limita o comprimento máximo da string de inteiro através da :ref:`limitação de comprimento de conversão de string de inteiro do interpretador <int_max_str_digits>` para ajudar a evitar ataques de negação de serviço.

source: Identical to :func:`load`, but instead of a file-like object, deserialize *s* (a :class:`str`, :class:`bytes` or :class:`bytearray` instance containing a JSON document) to a Python object using this :ref:`conversion table <json-to-py-table>`.
pt_pt: Idêntico a :func:`load`, mas em vez de um objeto semelhante a ficheiro, descodifica *s* (uma instância :class:`str`, :class:`bytes` ou :class:`bytearray` que contenha um documento JSON) para um objeto Python usando esta :ref:`tabela de conversão <json-to-py-table>`.

source: *s* can now be of type :class:`bytes` or :class:`bytearray`. The input encoding should be UTF-8, UTF-16 or UTF-32.
pt_pt: *s* pode agora ser do tipo :class:`bytes` ou :class:`bytearray`. A codificação de entrada deve ser UTF-8, UTF-16 ou UTF-32.

source: The keyword argument *encoding* has been removed.
pt_pt: O argumento por palavra-chave *encoding* foi removido.

source: Encoders and Decoders
pt_pt: Codificadores e Descodificadores

source: Simple JSON decoder.
pt_pt: Descodificador JSON simples.

source: Performs the following translations in decoding by default:
pt_pt: Realiza as seguintes traduções na descodificação por predefinição:

source: object
pt_pt: objeto

source: dict
pt_pt: dicionário

source: list
pt_pt: lista

source: number (int)
pt_pt: número (inteiro)

source: number (real)
pt_pt: número (real)

source: true
pt_pt: verdadeiro

source: false
pt_pt: falso

source: null
pt_pt: nulo

source: It also understands ``NaN``, ``Infinity``, and ``-Infinity`` as their corresponding ``float`` values, which is outside the JSON spec.
pt_pt: Também reconhece ``NaN``, ``Infinity`` e ``-Infinity`` como os seus valores ``float`` correspondentes, o que está fora da especificação JSON.

source: *object_hook* is an optional function that will be called with the result of every JSON object decoded and its return value will be used in place of the given :class:`dict`. This can be used to provide custom deserializations (e.g. to support `JSON-RPC <https://www.jsonrpc.org>`_ class hinting).
pt_pt: *object_hook* é uma função opcional que será chamada com o resultado de cada objeto JSON descodificado, e o seu valor de retorno será usado em vez do :class:`dict` fornecido. Isto pode ser usado para fornecer desserializações personalizadas (por exemplo, para suportar dicas de classe `JSON-RPC <https://www.jsonrpc.org>`_).

source: *object_pairs_hook* is an optional function that will be called with the result of every JSON object decoded with an ordered list of pairs. The return value of *object_pairs_hook* will be used instead of the :class:`dict`. This feature can be used to implement custom decoders. If *object_hook* is also defined, the *object_pairs_hook* takes priority.
pt_pt: *object_pairs_hook* é uma função opcional que será chamada com o resultado de cada objeto JSON descodificado com uma lista ordenada de pares. O valor de retorno de *object_pairs_hook* será usado em vez do :class:`dict`. Esta funcionalidade pode ser usada para implementar descodificadores personalizados. Se *object_hook* também estiver definido, *object_pairs_hook* tem prioridade.

source: Added support for *object_pairs_hook*.
pt_pt: Adicionado suporte para *object_pairs_hook*.

source: *parse_float* is an optional function that will be called with the string of every JSON float to be decoded. By default, this is equivalent to ``float(num_str)``. This can be used to use another datatype or parser for JSON floats (e.g. :class:`decimal.Decimal`).
pt_pt: *parse_float* é uma função opcional que será chamada com a string de cada float JSON a ser descodificado. Por predefinição, isto é equivalente a ``float(num_str)``. Isto pode ser usado para utilizar outro tipo de dados ou analisador para floats JSON (por exemplo, :class:`decimal.Decimal`).

source: *parse_int* is an optional function that will be called with the string of every JSON int to be decoded. By default, this is equivalent to ``int(num_str)``. This can be used to use another datatype or parser for JSON integers (e.g. :class:`float`).
pt_pt: *parse_int* é uma função opcional que será chamada com a string de cada inteiro JSON a ser descodificado. Por predefinição, isto é equivalente a ``int(num_str)``. Isto pode ser usado para utilizar outro tipo de dados ou analisador para inteiros JSON (por exemplo, :class:`float`).

source: *parse_constant* is an optional function that will be called with one of the following strings: ``'-Infinity'``, ``'Infinity'``, ``'NaN'``. This can be used to raise an exception if invalid JSON numbers are encountered.
pt_pt: *parse_constant* é uma função opcional que será chamada com uma das seguintes strings: ``'-Infinity'``, ``'Infinity'``, ``'NaN'``. Isto pode ser usado para lançar uma exceção se forem encontrados números JSON inválidos.

source: If *strict* is false (``True`` is the default), then control characters will be allowed inside strings. Control characters in this context are those with character codes in the 0--31 range, including ``'\t'`` (tab), ``'\n'``, ``'\r'`` and ``'\0'``.
pt_pt: Se *strict* for falso (``True`` é a predefinição), então os caracteres de controlo serão permitidos dentro de strings. Os caracteres de controlo neste contexto são aqueles com códigos de caracteres na gama 0-31, incluindo ``'\t'`` (tabulação), ``'\n'``, ``'\r'`` e ``'\0'``.
