Repository: NyaPuma/python-docs-pt
Catalog: library/numbers.po
Languages: pt_pt

source: :mod:`!numbers` --- Numeric abstract base classes
pt_pt: :mod:`!numbers` --- Classes de base abstratas numéricas

source: **Source code:** :source:`Lib/numbers.py`
pt_pt: **Código-fonte:** :source:`Lib/numbers.py`

source: The :mod:`!numbers` module (:pep:`3141`) defines a hierarchy of numeric :term:`abstract base classes <abstract base class>` which progressively define more operations. None of the types defined in this module are intended to be instantiated.
pt_pt: O módulo :mod:`!numbers` (:pep:`3141`) define uma hierarquia de :term:`classes de base abstratas <abstract base class>` numéricas que definem progressivamente mais operações. Nenhum dos tipos definidos neste módulo se destina a ser instanciado.

source: The root of the numeric hierarchy. If you just want to check if an argument *x* is a number, without caring what kind, use ``isinstance(x, Number)``.
pt_pt: A raiz da hierarquia numérica. Se apenas pretender verificar se um argumento *x* é um número, sem se preocupar com o tipo, utilize ``isinstance(x, Number)``.

source: The numeric tower
pt_pt: A torre numérica

source: Subclasses of this type describe complex numbers and include the operations that work on the built-in :class:`complex` type. These are: conversions to :class:`complex` and :class:`bool`, :attr:`.real`, :attr:`.imag`, ``+``, ``-``, ``*``, ``/``, ``**``, :func:`abs`, :meth:`conjugate`, ``==``, and ``!=``. All except ``-`` and ``!=`` are abstract.
pt_pt: As subclasses deste tipo descrevem números complexos e incluem as operações que funcionam no tipo embutido :class:`complex`. Estas são: conversões para :class:`complex` e :class:`bool`, :attr:`.real`, :attr:`.imag`, ``+``, ``-``, ``*``, ``/``, ``**``, :func:`abs`, :meth:`conjugate`, ``==`` e ``!=``. Todas, exceto ``-`` e ``!=``, são abstratas.

source: Abstract. Retrieves the real component of this number.
pt_pt: Abstrato. Obtém a componente real deste número.

source: Abstract. Retrieves the imaginary component of this number.
pt_pt: Abstrato. Obtém a componente imaginária deste número.

source: Abstract. Returns the complex conjugate. For example, ``(1+3j).conjugate() == (1-3j)``.
pt_pt: Abstrato. Retorna o conjugado complexo. Por exemplo, ``(1+3j).conjugate() == (1-3j)``.

source: To :class:`Complex`, :class:`!Real` adds the operations that work on real numbers.
pt_pt: A partir de :class:`Complex`, a classe :class:`!Real` adiciona as operações que funcionam em números reais.

source: In short, those are: a conversion to :class:`float`, :func:`math.trunc`, :func:`round`, :func:`math.floor`, :func:`math.ceil`, :func:`divmod`, ``//``, ``%``, ``<``, ``<=``, ``>``, and ``>=``.
pt_pt: Em suma, estas são: conversão para :class:`float`, :func:`math.trunc`, :func:`round`, :func:`math.floor`, :func:`math.ceil`, :func:`divmod`, ``//``, ``%``, ``<``, ``<=``, ``>`` e ``>=``.

source: Real also provides defaults for :func:`complex`, :attr:`~Complex.real`, :attr:`~Complex.imag`, and :meth:`~Complex.conjugate`.
pt_pt: Real também fornece implementações padrão para :func:`complex`, :attr:`~Complex.real`, :attr:`~Complex.imag` e :meth:`~Complex.conjugate`.

source: Subtypes :class:`Real` and adds :attr:`~Rational.numerator` and :attr:`~Rational.denominator` properties. It also provides a default for :func:`float`.
pt_pt: Subtipo de :class:`Real` que adiciona as propriedades :attr:`~Rational.numerator` e :attr:`~Rational.denominator`. Também fornece um padrão para :func:`float`.

source: The :attr:`~Rational.numerator` and :attr:`~Rational.denominator` values should be instances of :class:`Integral` and should be in lowest terms with :attr:`~Rational.denominator` positive.
pt_pt: Os valores de :attr:`~Rational.numerator` e :attr:`~Rational.denominator` devem ser instâncias de :class:`Integral` e devem estar na forma irredutível com :attr:`~Rational.denominator` positivo.

source: Abstract. The numerator of this rational number.
pt_pt: Abstrato. O numerador deste número racional.

source: Abstract. The denominator of this rational number.
pt_pt: Abstrato. O denominador deste número racional.

source: Subtypes :class:`Rational` and adds a conversion to :class:`int`. Provides defaults for :func:`float`, :attr:`~Rational.numerator`, and :attr:`~Rational.denominator`. Adds abstract methods for :func:`pow` with modulus and bit-string operations: ``<<``, ``>>``, ``&``, ``^``, ``|``, ``~``.
pt_pt: Subtipo de :class:`Rational` que adiciona uma conversão para :class:`int`. Fornece padrões para :func:`float`, :attr:`~Rational.numerator` e :attr:`~Rational.denominator`. Adiciona métodos abstratos para :func:`pow` com módulo e operações de strings de bits: ``<<``, ``>>``, ``&``, ``^``, ``|``, ``~``.

source: Notes for type implementers
pt_pt: Notas para implementadores de tipos

source: Implementers should be careful to make equal numbers equal and hash them to the same values. This may be subtle if there are two different extensions of the real numbers. For example, :class:`fractions.Fraction` implements :func:`hash` as follows::
pt_pt: Os implementadores devem ter o cuidado de garantir que números iguais sejam considerados iguais e que gerem o mesmo valor de hash. Isto pode ser subtil se existirem duas extensões diferentes dos números reais. Por exemplo, :class:`fractions.Fraction` implementa :func:`hash` da seguinte forma::

source: Adding More Numeric ABCs
pt_pt: Adicionar mais ABCs Numéricas

source: There are, of course, more possible ABCs for numbers, and this would be a poor hierarchy if it precluded the possibility of adding those. You can add ``MyFoo`` between :class:`Complex` and :class:`Real` with::
pt_pt: Existem, naturalmente, mais ABCs possíveis para números, e esta seria uma hierarquia pobre se impossibilitasse a adição das mesmas. Pode adicionar ``MyFoo`` entre :class:`Complex` e :class:`Real` com::

source: Implementing the arithmetic operations
pt_pt: Implementar as operações aritméticas

source: We want to implement the arithmetic operations so that mixed-mode operations either call an implementation whose author knew about the types of both arguments, or convert both to the nearest built in type and do the operation there. For subtypes of :class:`Integral`, this means that :meth:`~object.__add__` and :meth:`~object.__radd__` should be defined as::
pt_pt: Queremos implementar as operações aritméticas de modo a que as operações de modo misto ou chamem uma implementação cujo autor conheça os tipos de ambos os argumentos, ou convertam ambos para o tipo embutido mais próximo e realizem a operação aí. Para subtipos de :class:`Integral`, isto significa que :meth:`~object.__add__` e :meth:`~object.__radd__` devem ser definidos como::

source: There are 5 different cases for a mixed-type operation on subclasses of :class:`Complex`. I'll refer to all of the above code that doesn't refer to ``MyIntegral`` and ``OtherTypeIKnowAbout`` as "boilerplate". ``a`` will be an instance of ``A``, which is a subtype of :class:`Complex` (``a : A <: Complex``), and ``b : B <: Complex``. I'll consider ``a + b``:
pt_pt: Existem 5 casos diferentes para uma operação de tipos mistos em subclasses de :class:`Complex`. Referir-me-ei a todo o código acima que não mencione ``MyIntegral`` e ``OtherTypeIKnowAbout`` como "boilerplate". ``a`` será uma instância de ``A``, que é um subtipo de :class:`Complex` (``a : A <: Complex``), e ``b : B <: Complex``. Considerarei ``a + b``:

source: If ``A`` defines an :meth:`~object.__add__` which accepts ``b``, all is well.
pt_pt: Se ``A`` definir um :meth:`~object.__add__` que aceite ``b``, tudo está bem.

source: If ``A`` falls back to the boilerplate code, and it were to return a value from :meth:`~object.__add__`, we'd miss the possibility that ``B`` defines a more intelligent :meth:`~object.__radd__`, so the boilerplate should return :data:`NotImplemented` from :meth:`!__add__`. (Or ``A`` may not implement :meth:`!__add__` at all.)
pt_pt: Se ``A`` recorrer ao código "boilerplate", e este retornasse um valor de :meth:`~object.__add__`, perderíamos a possibilidade de ``B`` definir um :meth:`~object.__radd__` mais inteligente, pelo que o boilerplate deve retornar :data:`NotImplemented` a partir de :meth:`!__add__`. (Ou ``A`` pode nem sequer implementar :meth:`!__add__`.)

source: Then ``B``'s :meth:`~object.__radd__` gets a chance. If it accepts ``a``, all is well.
pt_pt: Em seguida, o :meth:`~object.__radd__` de ``B`` tem a sua oportunidade. Se aceitar ``a``, tudo está bem.

source: If it falls back to the boilerplate, there are no more possible methods to try, so this is where the default implementation should live.
pt_pt: Se este recorrer ao boilerplate, não existem mais métodos possíveis para tentar, pelo que é aqui que a implementação padrão deve residir.

source: If ``B <: A``, Python tries ``B.__radd__`` before ``A.__add__``. This is ok, because it was implemented with knowledge of ``A``, so it can handle those instances before delegating to :class:`Complex`.
pt_pt: Se ``B <: A``, o Python tenta ``B.__radd__`` antes de ``A.__add__``. Isto é aceitável, porque foi implementado com conhecimento de ``A``, podendo lidar com essas instâncias antes de delegar para :class:`Complex`.

source: If ``A <: Complex`` and ``B <: Real`` without sharing any other knowledge, then the appropriate shared operation is the one involving the built in :class:`complex`, and both :meth:`~object.__radd__` s land there, so ``a+b == b+a``.
pt_pt: Se ``A <: Complex`` e ``B <: Real`` sem partilharem qualquer outro conhecimento, então a operação partilhada apropriada é a que envolve o :class:`complex` embutido, e ambos os :meth:`~object.__radd__` terminam aí, pelo que ``a+b == b+a``.

source: Because most of the operations on any given type will be very similar, it can be useful to define a helper function which generates the forward and reverse instances of any given operator. For example, :class:`fractions.Fraction` uses::
pt_pt: Uma vez que a maioria das operações num determinado tipo será muito semelhante, pode ser útil definir uma função auxiliar que gere as instâncias direta (forward) e inversa (reverse) de um determinado operador. Por exemplo, :class:`fractions.Fraction` utiliza::
