Repository: NyaPuma/python-docs-pt
Catalog: library/pprint.po
Languages: pt_pt

source: :mod:`!pprint` --- Data pretty printer
pt_pt: :mod:`!pprint` --- Impressão formatada de dados (pretty printer)

source: **Source code:** :source:`Lib/pprint.py`
pt_pt: **Código-fonte:** :source:`Lib/pprint.py`

source: The :mod:`pprint` module provides a capability to "pretty-print" arbitrary Python data structures in a form which can be used as input to the interpreter. If the formatted structures include objects which are not fundamental Python types, the representation may not be loadable. This may be the case if objects such as files, sockets or classes are included, as well as many other objects which are not representable as Python literals.
pt_pt: O módulo :mod:`pprint` fornece a capacidade de imprimir de forma formatada ("pretty-print") estruturas de dados Python arbitrárias num formato que pode ser usado como entrada para o intérprete. Se as estruturas formatadas incluírem objetos que não são tipos fundamentais do Python, a representação poderá não ser carregável. Isto pode acontecer se forem incluídos objetos como ficheiros, sockets ou classes, bem como muitos outros objetos que não são representáveis como literais Python.

source: The formatted representation keeps objects on a single line if it can, and breaks them onto multiple lines if they don't fit within the allowed width, adjustable by the *width* parameter defaulting to 80 characters.
pt_pt: A representação formatada mantém os objetos numa única linha, se possível, e divide-os em várias linhas se não couberem na largura permitida, ajustável pelo parâmetro *width* que, por omissão, é de 80 caracteres.

source: Added support for pretty-printing :class:`types.SimpleNamespace`.
pt_pt: Adicionado suporte para a impressão formatada de :class:`types.SimpleNamespace`.

source: Added support for pretty-printing :class:`dataclasses.dataclass`.
pt_pt: Adicionado suporte para a impressão formatada de :class:`dataclasses.dataclass`.

source: Functions
pt_pt: Funções

source: Prints the formatted representation of *object*, followed by a newline. This function may be used in the interactive interpreter instead of the :func:`print` function for inspecting values. Tip: you can reassign ``print = pprint.pp`` for use within a scope.
pt_pt: Imprime a representação formatada de *object*, seguida de uma nova linha. Esta função pode ser usada no intérprete interativo em vez da função :func:`print` para inspecionar valores. Dica: pode reatribuir ``print = pprint.pp`` para uso dentro de um determinado escopo.

source: Parameters
pt_pt: Parâmetros

source: The object to be printed.
pt_pt: O objeto a ser impresso.

source: A file-like object to which the output will be written by calling its :meth:`!write` method. If ``None`` (the default), :data:`sys.stdout` is used.
pt_pt: Um objeto do tipo ficheiro (file-like) no qual a saída será escrita através da chamada do seu método :meth:`!write`. Se for ``None`` (o valor por omissão), é utilizado o :data:`sys.stdout`.

source: The amount of indentation added for each nesting level.
pt_pt: A quantidade de indentação adicionada para cada nível de aninhamento.

source: The desired maximum number of characters per line in the output. If a structure cannot be formatted within the width constraint, a best effort will be made.
pt_pt: O número máximo desejado de caracteres por linha na saída. Se uma estrutura não puder ser formatada dentro da restrição de largura, será feito o melhor esforço possível.

source: The number of nesting levels which may be printed. If the data structure being printed is too deep, the next contained level is replaced by ``...``. If ``None`` (the default), there is no constraint on the depth of the objects being formatted.
pt_pt: O número de níveis de aninhamento que podem ser impressos. Se a estrutura de dados a ser impressa for demasiado profunda, o nível seguinte contido é substituído por ``...``. Se for ``None`` (o valor por omissão), não existe restrição quanto à profundidade dos objetos a serem formatados.

source: Control the way long :term:`sequences <sequence>` are formatted. If ``False`` (the default), each item of a sequence will be formatted on a separate line, otherwise as many items as will fit within the *width* will be formatted on each output line.
pt_pt: Controla a forma como as :term:`sequências <sequence>` longas são formatadas. Se for ``False`` (o valor por omissão), cada item de uma sequência será formatado numa linha separada, caso contrário, tantos itens quantos couberem na largura (*width*) serão formatados em cada linha de saída.

source: If ``True``, dictionaries will be formatted with their keys sorted, otherwise they will be displayed in insertion order (the default).
pt_pt: Se for ``True``, os dicionários serão formatados com as suas chaves ordenadas, caso contrário, serão exibidos na ordem de inserção (o valor por omissão).

source: If ``True``, integers will be formatted with the ``_`` character for a thousands separator, otherwise underscores are not displayed (the default).
pt_pt: Se for ``True``, os números inteiros serão formatados com o carácter ``_`` como separador de milhares, caso contrário, os underscores não são exibidos (o valor por omissão).

source: Alias for :func:`~pprint.pp` with *sort_dicts* set to ``True`` by default, which would automatically sort the dictionaries' keys, you might want to use :func:`~pprint.pp` instead where it is ``False`` by default.
pt_pt: Alias para :func:`~pprint.pp` com *sort_dicts* definido como ``True`` por omissão, o que ordenaria automaticamente as chaves dos dicionários; poderá preferir usar :func:`~pprint.pp` em casos onde o valor por omissão é ``False``.

source: Return the formatted representation of *object* as a string. *indent*, *width*, *depth*, *compact*, *sort_dicts* and *underscore_numbers* are passed to the :class:`PrettyPrinter` constructor as formatting parameters and their meanings are as described in the documentation above.
pt_pt: Devolve a representação formatada de *object* como uma string. *indent*, *width*, *depth*, *compact*, *sort_dicts* e *underscore_numbers* são passados ao construtor de :class:`PrettyPrinter` como parâmetros de formatação e os seus significados são os descritos na documentação acima.

source: Determine if the formatted representation of *object* is "readable", or can be used to reconstruct the value using :func:`eval`. This always returns ``False`` for recursive objects.
pt_pt: Determina se a representação formatada de *object* é "legível", ou se pode ser usada para reconstruir o valor utilizando :func:`eval`. Devolve sempre ``False`` para objetos recursivos.

source: Determine if *object* requires a recursive representation. This function is subject to the same limitations as noted in :func:`saferepr` below and may raise an :exc:`RecursionError` if it fails to detect a recursive object.
pt_pt: Determina se *object* requer uma representação recursiva. Esta função está sujeita às mesmas limitações mencionadas em :func:`saferepr` abaixo e pode levantar um :exc:`RecursionError` se falhar ao detetar um objeto recursivo.

source: Return a string representation of *object*, protected against recursion in some common data structures, namely instances of :class:`dict`, :class:`list` and :class:`tuple` or subclasses whose ``__repr__`` has not been overridden. If the representation of object exposes a recursive entry, the recursive reference will be represented as ``<Recursion on typename with id=number>``. The representation is not otherwise formatted.
pt_pt: Devolve uma representação em string de *object*, protegida contra recursividade em algumas estruturas de dados comuns, nomeadamente instâncias de :class:`dict`, :class:`list` e :class:`tuple` ou subclasses cujo ``__repr__`` não tenha sido sobreposto. Se a representação do objeto expuser uma entrada recursiva, a referência recursiva será representada como ``<Recursion on typename with id=number>``. A representação não é formatada de outra forma.

source: PrettyPrinter Objects
pt_pt: Objetos PrettyPrinter

source: Construct a :class:`PrettyPrinter` instance.
pt_pt: Constrói uma instância de :class:`PrettyPrinter`.

source: Arguments have the same meaning as for :func:`~pprint.pp`. Note that they are in a different order, and that *sort_dicts* defaults to ``True``.
pt_pt: Os argumentos têm o mesmo significado que em :func:`~pprint.pp`. Nota que estão numa ordem diferente, e que *sort_dicts* tem como valor por omissão ``True``.

source: Added the *compact* parameter.
pt_pt: Adicionado o parâmetro *compact*.

source: Added the *sort_dicts* parameter.
pt_pt: Adicionado o parâmetro *sort_dicts*.

source: Added the *underscore_numbers* parameter.
pt_pt: Adicionado o parâmetro *underscore_numbers*.

source: No longer attempts to write to :data:`!sys.stdout` if it is ``None``.
pt_pt: Deixou de tentar escrever em :data:`!sys.stdout` se este for ``None``.

source: :class:`PrettyPrinter` instances have the following methods:
pt_pt: As instâncias de :class:`PrettyPrinter` têm os seguintes métodos:

source: Return the formatted representation of *object*. This takes into account the options passed to the :class:`PrettyPrinter` constructor.
pt_pt: Devolve a representação formatada de *object*. Isto tem em conta as opções passadas ao construtor de :class:`PrettyPrinter`.

source: Print the formatted representation of *object* on the configured stream, followed by a newline.
pt_pt: Imprime a representação formatada de *object* no fluxo (stream) configurado, seguida de uma nova linha.

source: The following methods provide the implementations for the corresponding functions of the same names. Using these methods on an instance is slightly more efficient since new :class:`PrettyPrinter` objects don't need to be created.
pt_pt: Os métodos seguintes fornecem as implementações para as funções correspondentes com os mesmos nomes. Utilizar estes métodos numa instância é ligeiramente mais eficiente, uma vez que não é necessária a criação de novos objetos :class:`PrettyPrinter`.

source: Determine if the formatted representation of the object is "readable," or can be used to reconstruct the value using :func:`eval`. Note that this returns ``False`` for recursive objects. If the *depth* parameter of the :class:`PrettyPrinter` is set and the object is deeper than allowed, this returns ``False``.
pt_pt: Determina se a representação formatada do objeto é "legível", ou se pode ser usada para reconstruir o valor utilizando :func:`eval`. Nota que devolve ``False`` para objetos recursivos. Se o parâmetro *depth* do :class:`PrettyPrinter` estiver definido e o objeto for mais profundo do que o permitido, devolve ``False``.

source: Determine if the object requires a recursive representation.
pt_pt: Determina se o objeto requer uma representação recursiva.

source: This method is provided as a hook to allow subclasses to modify the way objects are converted to strings. The default implementation uses the internals of the :func:`saferepr` implementation.
pt_pt: Este método é fornecido como um gancho (hook) para permitir que subclasses modifiquem a forma como os objetos são convertidos para strings. A implementação por omissão utiliza os componentes internos da implementação de :func:`saferepr`.

source: Returns three values: the formatted version of *object* as a string, a flag indicating whether the result is readable, and a flag indicating whether recursion was detected. The first argument is the object to be presented. The second is a dictionary which contains the :func:`id` of objects that are part of the current presentation context (direct and indirect containers for *object* that are affecting the presentation) as the keys; if an object needs to be presented which is already represented in *context*, the third return value should be ``True``. Recursive calls to the :meth:`.format` method should add additional entries for containers to this dictionary. The third argument, *maxlevels*, gives the requested limit to recursion; this will be ``0`` if there is no requested limit. This argument should be passed unmodified to recursive calls. The fourth argument, *level*, gives the current level; recursive calls should be passed a value less than that of the current call.
pt_pt: Devolve três valores: a versão formatada de *object* como uma string, uma flag indicando se o resultado é legível, e uma flag indicando se foi detetada recursividade. O primeiro argumento é o objeto a ser apresentado. O segundo é um dicionário que contém o :func:`id` de objetos que fazem parte do contexto de apresentação atual (contentores diretos e indiretos para *object* que estão a afetar a apresentação) como chaves; se for necessário apresentar um objeto que já está representado em *context*, o terceiro valor de retorno deve ser ``True``. Chamadas recursivas ao método :meth:`.format` devem adicionar entradas adicionais para contentores a este dicionário. O terceiro argumento, *maxlevels*, indica o limite solicitado para a recursividade; será ``0`` se não houver limite. Este argumento deve ser passado sem modificações para chamadas recursivas. O quarto argumento, *level*, indica o nível atual; às chamadas recursivas deve ser passado um valor inferior ao da chamada atual.

source: Example
pt_pt: Exemplo

source: To demonstrate several uses of the :func:`~pprint.pp` function and its parameters, let's fetch information about a project from `PyPI <https://pypi.org>`_::
pt_pt: Para demonstrar várias utilizações da função :func:`~pprint.pp` e dos seus parâmetros, vamos obter informações sobre um projeto do `PyPI <https://pypi.org>`_::

source: In its basic form, :func:`~pprint.pp` shows the whole object::
pt_pt: Na sua forma básica, :func:`~pprint.pp` mostra o objeto completo::

source: The result can be limited to a certain *depth* (ellipsis is used for deeper contents)::
pt_pt: O resultado pode ser limitado a uma certa profundidade (*depth*) (são usadas reticências para conteúdos mais profundos)::

source: Additionally, maximum character *width* can be suggested. If a long object cannot be split, the specified width will be exceeded::
pt_pt: Adicionalmente, pode ser sugerida uma largura (*width*) máxima de caracteres. Se um objeto longo não puder ser dividido, a largura especificada será excedida::

source: built-in function
pt_pt: função incorporada

source: placeholder
pt_pt: marcador (placeholder)
