Repository: NyaPuma/python-docs-pt
Catalog: library/readline.po
Languages: pt_pt

source: :mod:`!readline` --- GNU readline interface
pt_pt: :mod:`!readline` --- Interface GNU readline

source: The :mod:`readline` module defines a number of functions to facilitate completion and reading/writing of history files from the Python interpreter. This module can be used directly, or via the :mod:`rlcompleter` module, which supports completion of Python identifiers at the interactive prompt. Settings made using this module affect the behaviour of both the interpreter's interactive prompt and the prompts offered by the built-in :func:`input` function.
pt_pt: O módulo :mod:`readline` define uma série de funções para facilitar a conclusão (*completion*) e a leitura/escrita de ficheiros de histórico do interpretador Python. Este módulo pode ser utilizado diretamente, ou através do módulo :mod:`rlcompleter`, que suporta a conclusão de identificadores Python na linha de comandos interativa. As configurações feitas através deste módulo afetam o comportamento tanto da linha de comandos interativa do interpretador como das solicitações oferecidas pela função incorporada :func:`input`.

source: Readline keybindings may be configured via an initialization file, typically ``.inputrc`` in your home directory. See `Readline Init File <https://tiswww.cwru.edu/php/chet/readline/rluserman.html#Readline-Init-File>`_ in the GNU Readline manual for information about the format and allowable constructs of that file, and the capabilities of the Readline library in general.
pt_pt: As associações de teclas (*keybindings*) do Readline podem ser configuradas através de um ficheiro de inicialização, tipicamente ``.inputrc`` na sua diretoria pessoal. Consulte `Readline Init File <https://tiswww.cwru.edu/php/chet/readline/rluserman.html#Readline-Init-File>`_ no manual do GNU Readline para informações sobre o formato e construções permitidas desse ficheiro, e as capacidades da biblioteca Readline em geral.

source: Availability
pt_pt: Disponibilidade

source: This module is not supported on :ref:`mobile platforms <mobile-availability>` or :ref:`WebAssembly platforms <wasm-availability>`.
pt_pt: Este módulo não é suportado em :ref:`plataformas móveis <mobile-availability>` ou :ref:`plataformas WebAssembly <wasm-availability>`.

source: This is an :term:`optional module`. If it is missing from your copy of CPython, look for documentation from your distributor (that is, whoever provided Python to you). If you are the distributor, see :ref:`optional-module-requirements`.
pt_pt: Este é um :term:`módulo opcional`. Se estiver em falta na sua cópia do CPython, procure documentação junto do seu distribuidor (ou seja, quem lhe forneceu o Python). Se for o distribuidor, veja :ref:`optional-module-requirements`.

source: The underlying Readline library API may be implemented by the ``editline`` (``libedit``) library instead of GNU readline. On macOS the :mod:`readline` module detects which library is being used at run time.
pt_pt: A API da biblioteca Readline subjacente pode ser implementada pela biblioteca ``editline`` (``libedit``) em vez da GNU readline. No macOS, o módulo :mod:`readline` deteta qual a biblioteca que está a ser utilizada em tempo de execução.

source: The configuration file for ``editline`` is different from that of GNU readline. If you programmatically load configuration strings you can use :data:`backend` to determine which library is being used.
pt_pt: O ficheiro de configuração para o ``editline`` é diferente do GNU readline. Se carregar strings de configuração programaticamente, pode usar :data:`backend` para determinar qual a biblioteca que está a ser usada.

source: If you use ``editline``/``libedit`` readline emulation on macOS, the initialization file located in your home directory is named ``.editrc``. For example, the following content in ``~/.editrc`` will turn ON *vi* keybindings and TAB completion::
pt_pt: Se usar a emulação readline ``editline``/``libedit`` no macOS, o ficheiro de inicialização localizado na sua diretoria pessoal chama-se ``.editrc``. Por exemplo, o seguinte conteúdo em ``~/.editrc`` ativará as associações de teclas *vi* e a conclusão com TAB::

source: The name of the underlying Readline library being used, either ``"readline"`` or ``"editline"``.
pt_pt: O nome da biblioteca Readline subjacente que está a ser utilizada, quer seja ``"readline"`` ou ``"editline"``.

source: Init file
pt_pt: Ficheiro de inicialização

source: The following functions relate to the init file and user configuration:
pt_pt: As seguintes funções relacionam-se com o ficheiro de inicialização e a configuração do utilizador:

source: Execute the init line provided in the *string* argument. This calls :c:func:`!rl_parse_and_bind` in the underlying library.
pt_pt: Executa a linha de inicialização fornecida no argumento *string*. Isto chama :c:func:`!rl_parse_and_bind` na biblioteca subjacente.

source: Execute a readline initialization file. The default filename is the last filename used. This calls :c:func:`!rl_read_init_file` in the underlying library. It raises an :ref:`auditing event <auditing>` ``open`` with the file name if given, and :code:`"<readline_init_file>"` otherwise, regardless of which file the library resolves.
pt_pt: Executa um ficheiro de inicialização do readline. O nome de ficheiro padrão é o último nome utilizado. Isto chama :c:func:`!rl_read_init_file` na biblioteca subjacente. Levanta um :ref:`evento de auditoria <auditing>` ``open`` com o nome do ficheiro, se fornecido, e :code:`"<readline_init_file>"` caso contrário.

source: Line buffer
pt_pt: Buffer de linha

source: The following functions operate on the line buffer:
pt_pt: As seguintes funções operam sobre o buffer de linha:

source: Return the current contents of the line buffer (:c:data:`!rl_line_buffer` in the underlying library).
pt_pt: Retorna o conteúdo atual do buffer de linha (:c:data:`!rl_line_buffer` na biblioteca subjacente).

source: Insert text into the line buffer at the cursor position. This calls :c:func:`!rl_insert_text` in the underlying library, but ignores the return value.
pt_pt: Insere texto no buffer de linha na posição do cursor. Isto chama :c:func:`!rl_insert_text` na biblioteca subjacente, mas ignora o valor de retorno.

source: Change what's displayed on the screen to reflect the current contents of the line buffer. This calls :c:func:`!rl_redisplay` in the underlying library.
pt_pt: Altera o que é exibido no ecrã para refletir o conteúdo atual do buffer de linha. Isto chama :c:func:`!rl_redisplay` na biblioteca subjacente.

source: History file
pt_pt: Ficheiro de histórico

source: The following functions operate on a history file:
pt_pt: As seguintes funções operam sobre um ficheiro de histórico:

source: Load a readline history file, and append it to the history list. The default filename is :file:`~/.history`. This calls :c:func:`!read_history` in the underlying library and raises an :ref:`auditing event <auditing>` ``open`` with the file name if given and :code:`"~/.history"` otherwise.
pt_pt: Carrega um ficheiro de histórico do readline e anexa-o à lista de histórico. O nome de ficheiro padrão é :file:`~/.history`. Isto chama :c:func:`!read_history` na biblioteca subjacente.

source: Save the history list to a readline history file, overwriting any existing file. The default filename is :file:`~/.history`. This calls :c:func:`!write_history` in the underlying library and raises an :ref:`auditing event <auditing>` ``open`` with the file name if given and :code:`"~/.history"` otherwise.
pt_pt: Guarda a lista de histórico num ficheiro de histórico do readline, sobrescrevendo qualquer ficheiro existente. O nome de ficheiro padrão é :file:`~/.history`. Isto chama :c:func:`!write_history` na biblioteca subjacente.

source: Set or return the desired number of lines to save in the history file. The :func:`write_history_file` function uses this value to truncate the history file, by calling :c:func:`!history_truncate_file` in the underlying library. Negative values imply unlimited history file size.
pt_pt: Define ou retorna o número desejado de linhas a guardar no ficheiro de histórico. A função :func:`write_history_file` utiliza este valor para truncar o ficheiro, chamando :c:func:`!history_truncate_file` na biblioteca subjacente. Valores negativos implicam um tamanho de ficheiro ilimitado.

source: History list
pt_pt: Lista de histórico

source: The following functions operate on a global history list:
pt_pt: As seguintes funções operam sobre uma lista de histórico global:

source: Clear the current history. This calls :c:func:`!clear_history` in the underlying library. The Python function only exists if Python was compiled for a version of the library that supports it.
pt_pt: Limpa o histórico atual. Isto chama :c:func:`!clear_history` na biblioteca subjacente.

source: Return the number of items currently in the history. (This is different from :func:`get_history_length`, which returns the maximum number of lines that will be written to a history file.)
pt_pt: Retorna o número de itens atualmente no histórico. (Isto é diferente de :func:`get_history_length`, que retorna o número máximo de linhas que serão escritas num ficheiro de histórico.)

source: Return the current contents of history item at *index*. The item index is one-based. This calls :c:func:`!history_get` in the underlying library.
pt_pt: Retorna o conteúdo atual do item de histórico no *index*. O índice do item começa em um. Isto chama :c:func:`!history_get` na biblioteca subjacente.

source: Remove history item specified by its position from the history. The position is zero-based. This calls :c:func:`!remove_history` in the underlying library.
pt_pt: Remove o item de histórico especificado pela sua posição. A posição começa em zero. Isto chama :c:func:`!remove_history` na biblioteca subjacente.

source: Append *line* to the history buffer, as if it was the last line typed. This calls :c:func:`!add_history` in the underlying library.
pt_pt: Anexa *line* ao buffer de histórico, como se fosse a última linha digitada. Isto chama :c:func:`!add_history` na biblioteca subjacente.

source: Enable or disable automatic calls to :c:func:`!add_history` when reading input via readline. The *enabled* argument should be a Boolean value that when true, enables auto history, and that when false, disables auto history.
pt_pt: Ativa ou desativa chamadas automáticas a :c:func:`!add_history` ao ler entrada via readline. O argumento *enabled* deve ser um valor Booleano.

source: Startup hooks
pt_pt: Ganchos (*hooks*) de arranque

source: Completion
pt_pt: Conclusão (*Completion*)

source: The following functions relate to implementing a custom word completion function. This is typically operated by the Tab key, and can suggest and automatically complete a word being typed. By default, Readline is set up to be used by :mod:`rlcompleter` to complete Python identifiers for the interactive interpreter. If the :mod:`readline` module is to be used with a custom completer, a different set of word delimiters should be set.
pt_pt: As seguintes funções relacionam-se com a implementação de uma função personalizada de conclusão de palavras. Esta é tipicamente operada pela tecla Tab. Por omissão, o Readline está configurado para ser usado pelo :mod:`rlcompleter` para completar identificadores Python.

source: Set or remove the completer function. If *function* is specified, it will be used as the new completer function; if omitted or ``None``, any completer function already installed is removed. The completer function is called as ``function(text, state)``, for *state* in ``0``, ``1``, ``2``, ..., until it returns a non-string value. It should return the next possible completion starting with *text*.
pt_pt: Define ou remove a função de conclusão. Se *function* for especificada, será usada como a nova função; se omitida ou ``None``, qualquer função instalada é removida. A função é chamada como ``function(text, state)``.

source: Example
pt_pt: Exemplo

source: The new :term:`REPL` introduced in version 3.13 doesn't support readline. However, readline can still be used by setting the :envvar:`PYTHON_BASIC_REPL` environment variable.
pt_pt: O novo :term:`REPL` introduzido na versão 3.13 não suporta readline. No entanto, o readline ainda pode ser usado definindo a variável de ambiente :envvar:`PYTHON_BASIC_REPL`.
