Repository: NyaPuma/python-docs-pt
Catalog: library/secrets.po
Languages: pt_pt

source: :mod:`!secrets` --- Generate secure random numbers for managing secrets
pt_pt: :mod:`!secrets` --- Gerar números aleatórios seguros para gerir segredos

source: **Source code:** :source:`Lib/secrets.py`
pt_pt: **Código-fonte:** :source:`Lib/secrets.py`

source: The :mod:`!secrets` module is used for generating cryptographically strong random numbers suitable for managing data such as passwords, account authentication, security tokens, and related secrets.
pt_pt: O módulo :mod:`!secrets` é utilizado para gerar números aleatórios criptograficamente fortes, adequados para gerir dados como palavras-passe, autenticação de contas, tokens de segurança e segredos relacionados.

source: In particular, :mod:`!secrets` should be used in preference to the default pseudo-random number generator in the :mod:`random` module, which is designed for modelling and simulation, not security or cryptography.
pt_pt: Em particular, o :mod:`!secrets` deve ser utilizado preferencialmente em relação ao gerador de números pseudo-aleatórios padrão do módulo :mod:`random`, que é projetado para modelagem e simulação, e não para segurança ou criptografia.

source: Random numbers
pt_pt: Números aleatórios

source: The :mod:`!secrets` module provides access to the most secure source of randomness that your operating system provides.
pt_pt: O módulo :mod:`!secrets` fornece acesso à fonte de aleatoriedade mais segura que o seu sistema operativo disponibiliza.

source: A class for generating random numbers using the highest-quality sources provided by the operating system. See :class:`random.SystemRandom` for additional details.
pt_pt: Uma classe para gerar números aleatórios utilizando as fontes de maior qualidade fornecidas pelo sistema operativo. Consulte :class:`random.SystemRandom` para detalhes adicionais.

source: Return a randomly chosen element from a non-empty sequence.
pt_pt: Retorna um elemento escolhido aleatoriamente de uma sequência não vazia.

source: Return a random int in the range [0, *exclusive_upper_bound*).
pt_pt: Retorna um inteiro aleatório no intervalo [0, *exclusive_upper_bound*).

source: Return a non-negative int with *k* random bits.
pt_pt: Retorna um inteiro não negativo com *k* bits aleatórios.

source: Generating tokens
pt_pt: Gerar tokens

source: The :mod:`!secrets` module provides functions for generating secure tokens, suitable for applications such as password resets, hard-to-guess URLs, and similar.
pt_pt: O módulo :mod:`!secrets` fornece funções para gerar tokens seguros, adequados para aplicações como redefinição de palavras-passe, URLs difíceis de adivinhar e semelhantes.

source: Return a random byte string containing *nbytes* number of bytes. If *nbytes* is ``None`` or not supplied, a reasonable default is used.
pt_pt: Retorna uma string de bytes aleatória contendo *nbytes* número de bytes. Se *nbytes* for ``None`` ou não for fornecido, é utilizado um valor padrão razoável.

source: Return a random text string, in hexadecimal. The string has *nbytes* random bytes, each byte converted to two hex digits. If *nbytes* is ``None`` or not supplied, a reasonable default is used.
pt_pt: Retorna uma string de texto aleatória, em hexadecimal. A string possui *nbytes* bytes aleatórios, sendo cada byte convertido em dois dígitos hexadecimais. Se *nbytes* for ``None`` ou não for fornecido, é utilizado um valor padrão razoável.

source: Return a random URL-safe text string, containing *nbytes* random bytes. The text is Base64 encoded, so on average each byte results in approximately 1.3 characters. If *nbytes* is ``None`` or not supplied, a reasonable default is used.
pt_pt: Retorna uma string de texto aleatória segura para URLs (URL-safe), contendo *nbytes* bytes aleatórios. O texto é codificado em Base64, pelo que, em média, cada byte resulta em aproximadamente 1,3 caracteres. Se *nbytes* for ``None`` ou não for fornecido, é utilizado um valor padrão razoável.

source: How many bytes should tokens use?
pt_pt: Quantos bytes devem os tokens utilizar?

source: To be secure against `brute-force attacks <https://en.wikipedia.org/wiki/Brute-force_attack>`_, tokens need to have sufficient randomness. Unfortunately, what is considered sufficient will necessarily increase as computers get more powerful and able to make more guesses in a shorter period. As of 2015, it is believed that 32 bytes (256 bits) of randomness is sufficient for the typical use-case expected for the :mod:`!secrets` module.
pt_pt: Para serem seguros contra `ataques de força bruta <https://pt.wikipedia.org/wiki/Ataque_de_for%C3%A7a_bruta>`_, os tokens precisam de ter aleatoriedade suficiente. Infelizmente, o que é considerado suficiente aumentará necessariamente à medida que os computadores se tornam mais potentes e capazes de realizar mais tentativas num período mais curto. Desde 2015, acredita-se que 32 bytes (256 bits) de aleatoriedade sejam suficientes para o caso de utilização típico esperado para o módulo :mod:`!secrets`.

source: For those who want to manage their own token length, you can explicitly specify how much randomness is used for tokens by giving an :class:`int` argument to the various ``token_*`` functions. That argument is taken as the number of bytes of randomness to use.
pt_pt: Para quem deseja gerir o comprimento do seu próprio token, pode especificar explicitamente quanta aleatoriedade é utilizada para os tokens, fornecendo um argumento :class:`int` às várias funções ``token_*``. Esse argumento é considerado como o número de bytes de aleatoriedade a utilizar.

source: Otherwise, if no argument is provided, or if the argument is ``None``, the ``token_*`` functions will use a reasonable default instead.
pt_pt: Caso contrário, se nenhum argumento for fornecido, ou se o argumento for ``None``, as funções ``token_*`` utilizarão um valor padrão razoável.

source: That default is subject to change at any time, including during maintenance releases.
pt_pt: Esse valor padrão está sujeito a alterações a qualquer momento, inclusive durante lançamentos de manutenção.

source: Other functions
pt_pt: Outras funções

source: Return ``True`` if strings or :term:`bytes-like objects <bytes-like object>` *a* and *b* are equal, otherwise ``False``, using a "constant-time compare" to reduce the risk of `timing attacks <https://codahale.com/a-lesson-in-timing-attacks/>`_. See :func:`hmac.compare_digest` for additional details.
pt_pt: Retorna ``True`` se as strings ou :term:`objetos do tipo bytes <bytes-like object>` *a* e *b* forem iguais, caso contrário ``False``, utilizando uma "comparação em tempo constante" para reduzir o risco de `ataques de temporização <https://codahale.com/a-lesson-in-timing-attacks/>`_. Consulte :func:`hmac.compare_digest` para detalhes adicionais.

source: Recipes and best practices
pt_pt: Receitas e boas práticas

source: This section shows recipes and best practices for using :mod:`!secrets` to manage a basic level of security.
pt_pt: Esta secção mostra receitas e boas práticas para utilizar o :mod:`!secrets` para gerir um nível básico de segurança.

source: Generate an eight-character alphanumeric password:
pt_pt: Gerar uma palavra-passe alfanumérica de oito caracteres:

source: Applications should not :cwe:`store passwords in a recoverable format <257>`, whether plain text or encrypted. They should be salted and hashed using a cryptographically strong one-way (irreversible) hash function.
pt_pt: As aplicações não devem :cwe:`armazenar palavras-passe num formato recuperável <257>`, seja em texto simples ou encriptado. Elas devem ser alvo de "salting" e convertidas em hash utilizando uma função de hash unidirecional (irreversível) criptograficamente forte.

source: Generate a ten-character alphanumeric password with at least one lowercase character, at least one uppercase character, and at least three digits:
pt_pt: Gerar uma palavra-passe alfanumérica de dez caracteres com pelo menos um caractere minúsculo, pelo menos um caractere maiúsculo e pelo menos três dígitos:

source: Generate an `XKCD-style passphrase <https://xkcd.com/936/>`_:
pt_pt: Gerar uma `passphrase ao estilo XKCD <https://xkcd.com/936/>`_:

source: Generate a hard-to-guess temporary URL containing a security token suitable for password recovery applications:
pt_pt: Gerar um URL temporário difícil de adivinhar contendo um token de segurança adequado para aplicações de recuperação de palavra-passe:
