Repository: NyaPuma/python-docs-pt
Catalog: library/shlex.po
Languages: pt_pt

source: Enclosing characters in quotes which are not part of :attr:`~shlex.escapedquotes` (e.g. ``"'"``) preserve the literal value of all characters within the quotes;
pt_pt: Colocar caracteres entre aspas que não fazem parte de :attr:`~shlex.escapedquotes` (ex: ``"'"``) preserva o valor literal de todos os caracteres dentro das aspas;

source: Enclosing characters in quotes which are part of :attr:`~shlex.escapedquotes` (e.g. ``'"'``) preserves the literal value of all characters within the quotes, with the exception of the characters mentioned in :attr:`~shlex.escape`. The escape characters retain its special meaning only when followed by the quote in use, or the escape character itself. Otherwise the escape character will be considered a normal character.
pt_pt: Colocar caracteres entre aspas que fazem parte de :attr:`~shlex.escapedquotes` (ex: ``'"'``) preserva o valor literal de todos os caracteres dentro das aspas, com exceção dos caracteres mencionados em :attr:`~shlex.escape`. Os caracteres de escape mantêm o seu significado especial apenas quando seguidos pela aspa em uso, ou pelo próprio carácter de escape. Caso contrário, o carácter de escape será considerado um carácter normal.

source: EOF is signaled with a :const:`None` value;
pt_pt: O EOF é sinalizado com um valor :const:`None`;

source: Quoted empty strings (``''``) are allowed.
pt_pt: Strings vazias entre aspas (``''``) são permitidas.

source: Improved Compatibility with Shells
pt_pt: Compatibilidade Melhorada com Shells

source: The :class:`shlex` class provides compatibility with the parsing performed by common Unix shells like ``bash``, ``dash``, and ``sh``. To take advantage of this compatibility, specify the ``punctuation_chars`` argument in the constructor. This defaults to ``False``, which preserves pre-3.6 behaviour. However, if it is set to ``True``, then parsing of the characters ``();<>|&`` is changed: any run of these characters is returned as a single token. While this is short of a full parser for shells (which would be out of scope for the standard library, given the multiplicity of shells out there), it does allow you to perform processing of command lines more easily than you could otherwise. To illustrate, you can see the difference in the following snippet:
pt_pt: A classe :class:`shlex` fornece compatibilidade com a análise efetuada por shells Unix comuns como ``bash``, ``dash`` e ``sh``. Para tirar partido desta compatibilidade, especifique o argumento ``punctuation_chars`` no construtor. O valor padrão é ``False``, o que preserva o comportamento anterior à versão 3.6. No entanto, se for definido como ``True``, a análise dos caracteres ``();<>|&`` é alterada: qualquer sequência destes caracteres é devolvida como um único token. Embora isto não seja um analisador completo de shells (o que estaria fora do âmbito da biblioteca padrão, dada a multiplicidade de shells existentes), permite-lhe processar linhas de comando mais facilmente do que de outra forma. Para ilustrar, pode ver a diferença no seguinte trecho:

source: Of course, tokens will be returned which are not valid for shells, and you'll need to implement your own error checks on the returned tokens.
pt_pt: Naturalmente, serão devolvidos tokens que não são válidos para as shells, e precisará de implementar as suas próprias verificações de erro nos tokens devolvidos.

source: Instead of passing ``True`` as the value for the punctuation_chars parameter, you can pass a string with specific characters, which will be used to determine which characters constitute punctuation. For example::
pt_pt: Em vez de passar ``True`` como valor para o parâmetro punctuation_chars, pode passar uma string com caracteres específicos, que será usada para determinar quais os caracteres que constituem a pontuação. Por exemplo::

source: When ``punctuation_chars`` is specified, the :attr:`~shlex.wordchars` attribute is augmented with the characters ``~-./*?=``. That is because these characters can appear in file names (including wildcards) and command-line arguments (e.g. ``--color=auto``). Hence::
pt_pt: Quando ``punctuation_chars`` é especificado, o atributo :attr:`~shlex.wordchars` é aumentado com os caracteres ``~-./*?=``. Isto acontece porque estes caracteres podem aparecer em nomes de ficheiros (incluindo wildcards) e argumentos de linha de comandos (ex: ``--color=auto``). Assim::

source: However, to match the shell as closely as possible, it is recommended to always use ``posix`` and :attr:`~shlex.whitespace_split` when using :attr:`~shlex.punctuation_chars`, which will negate :attr:`~shlex.wordchars` entirely.
pt_pt: No entanto, para corresponder à shell o mais fielmente possível, recomenda-se utilizar sempre ``posix`` e :attr:`~shlex.whitespace_split` ao usar :attr:`~shlex.punctuation_chars`, o que anulará inteiramente o :attr:`~shlex.wordchars`.

source: For best effect, ``punctuation_chars`` should be set in conjunction with ``posix=True``. (Note that ``posix=False`` is the default for :class:`~shlex.shlex`.)
pt_pt: Para melhor efeito, ``punctuation_chars`` deve ser definido em conjunto com ``posix=True``. (Note que ``posix=False`` é o padrão para :class:`~shlex.shlex`.)
