Repository: NyaPuma/python-docs-pt
Catalog: library/shlex.po
Languages: pt_pt

source: :mod:`!shlex` --- Simple lexical analysis
pt_pt: :mod:`!shlex` --- Análise lexical simples

source: **Source code:** :source:`Lib/shlex.py`
pt_pt: **Código-fonte:** :source:`Lib/shlex.py`

source: The :class:`~shlex.shlex` class makes it easy to write lexical analyzers for simple syntaxes resembling that of the Unix shell. This will often be useful for writing minilanguages, (for example, in run control files for Python applications) or for parsing quoted strings.
pt_pt: A classe :class:`~shlex.shlex` facilita a escrita de analisadores lexicais para sintaxes simples que se assemelham à shell do Unix. Isto será frequentemente útil para escrever minilinguagens (por exemplo, em ficheiros de controlo de execução para aplicações Python) ou para analisar strings entre aspas.

source: Split the string *s* using shell-like syntax. If *comments* is :const:`False` (the default), the parsing of comments in the given string will be disabled (setting the :attr:`~shlex.commenters` attribute of the :class:`~shlex.shlex` instance to the empty string). This function operates in POSIX mode by default, but uses non-POSIX mode if the *posix* argument is false.
pt_pt: Divide a string *s* usando uma sintaxe semelhante à da shell. Se *comments* for :const:`False` (o padrão), a análise de comentários na string fornecida será desativada (definindo o atributo :attr:`~shlex.commenters` da instância :class:`~shlex.shlex` para uma string vazia). Esta função opera no modo POSIX por predefinição, mas utiliza o modo não-POSIX se o argumento *posix* for falso.

source: Passing ``None`` for *s* argument now raises an exception, rather than reading :data:`sys.stdin`.
pt_pt: Passar ``None`` no argumento *s* agora levanta uma exceção, em vez de ler de :data:`sys.stdin`.

source: Concatenate the tokens of the list *split_command* and return a string. This function is the inverse of :func:`split`.
pt_pt: Concatena os tokens da lista *split_command* e devolve uma string. Esta função é o inverso de :func:`split`.

source: The returned value is shell-escaped to protect against injection vulnerabilities (see :func:`quote`).
pt_pt: O valor devolvido é escapado para a shell para proteger contra vulnerabilidades de injeção (consulte :func:`quote`).

source: Return a shell-escaped version of the string *s*. The returned value is a string that can safely be used as one token in a shell command line, for cases where you cannot use a list.
pt_pt: Devolve uma versão da string *s* escapada para a shell. O valor devolvido é uma string que pode ser utilizada com segurança como um token numa linha de comandos da shell, para casos em que não possa utilizar uma lista.

source: The ``shlex`` module is **only designed for Unix shells**.
pt_pt: O módulo ``shlex`` foi **apenas desenhado para shells Unix**.

source: The :func:`quote` function is not guaranteed to be correct on non-POSIX compliant shells or shells from other operating systems such as Windows. Executing commands quoted by this module on such shells can open up the possibility of a command injection vulnerability.
pt_pt: Não há garantia de que a função :func:`quote` esteja correta em shells não compatíveis com POSIX ou shells de outros sistemas operativos como o Windows. A execução de comandos citados por este módulo nessas shells pode abrir a possibilidade de uma vulnerabilidade de injeção de comandos.

source: Consider using functions that pass command arguments with lists such as :func:`subprocess.run` with ``shell=False``.
pt_pt: Considere utilizar funções que passam argumentos de comando com listas, tais como :func:`subprocess.run` com ``shell=False``.

source: This idiom would be unsafe:
pt_pt: Este idioma seria inseguro:

source: :func:`quote` lets you plug the security hole:
pt_pt: :func:`quote` permite-lhe tapar a falha de segurança:

source: The quoting is compatible with UNIX shells and with :func:`split`:
pt_pt: A citação é compatível com as shells UNIX e com :func:`split`:

source: A :class:`~shlex.shlex` instance or subclass instance is a lexical analyzer object. The initialization argument, if present, specifies where to read characters from. It must be a file-/stream-like object with :meth:`~io.TextIOBase.read` and :meth:`~io.TextIOBase.readline` methods, or a string. If no argument is given, input will be taken from ``sys.stdin``. The second optional argument is a filename string, which sets the initial value of the :attr:`~shlex.infile` attribute. If the *instream* argument is omitted or equal to ``sys.stdin``, this second argument defaults to "stdin". The *posix* argument defines the operational mode: when *posix* is not true (default), the :class:`~shlex.shlex` instance will operate in compatibility mode. When operating in POSIX mode, :class:`~shlex.shlex` will try to be as close as possible to the POSIX shell parsing rules. The *punctuation_chars* argument provides a way to make the behaviour even closer to how real shells parse. This can take a number of values: the default value, ``False``, preserves the behaviour seen under Python 3.5 and earlier. If set to ``True``, then parsing of the characters ``();<>|&`` is changed: any run of these characters (considered punctuation characters) is returned as a single token. If set to a non-empty string of characters, those characters will be used as the punctuation characters. Any characters in the :attr:`wordchars` attribute that appear in *punctuation_chars* will be removed from :attr:`wordchars`. See :ref:`improved-shell-compatibility` for more information. *punctuation_chars* can be set only upon :class:`~shlex.shlex` instance creation and can't be modified later.
pt_pt: Uma instância de :class:`~shlex.shlex` ou de uma subclasse é um objeto analisador lexical. O argumento de inicialização, se presente, especifica de onde ler os caracteres. Deve ser um objeto do tipo ficheiro/stream com os métodos :meth:`~io.TextIOBase.read` e :meth:`~io.TextIOBase.readline`, ou uma string. Se nenhum argumento for fornecido, a entrada será obtida de ``sys.stdin``. O segundo argumento opcional é uma string com o nome do ficheiro, que define o valor inicial do atributo :attr:`~shlex.infile`. Se o argumento *instream* for omitido ou igual a ``sys.stdin``, este segundo argumento assume por defeito "stdin". O argumento *posix* define o modo operacional: quando *posix* não é verdadeiro (padrão), a instância :class:`~shlex.shlex` operará em modo de compatibilidade. Ao operar no modo POSIX, :class:`~shlex.shlex` tentará ser o mais fiel possível às regras de análise da shell POSIX. O argumento *punctuation_chars* oferece uma forma de tornar o comportamento ainda mais próximo da análise das shells reais. Pode assumir vários valores: o valor padrão, ``False``, preserva o comportamento visto no Python 3.5 e anteriores. Se definido como ``True``, a análise dos caracteres ``();<>|&`` é alterada: qualquer sequência destes caracteres (considerados caracteres de pontuação) é devolvida como um único token. Se definido para uma string de caracteres não vazia, esses caracteres serão usados como caracteres de pontuação. Quaisquer caracteres no atributo :attr:`wordchars` que apareçam em *punctuation_chars* serão removidos de :attr:`wordchars`. Consulte :ref:`improved-shell-compatibility` para mais informações. *punctuation_chars* só pode ser definido na criação da instância :class:`~shlex.shlex` e não pode ser modificado posteriormente.

source: The *punctuation_chars* parameter was added.
pt_pt: O parâmetro *punctuation_chars* foi adicionado.

source: Module :mod:`configparser`
pt_pt: Módulo :mod:`configparser`

source: Parser for configuration files similar to the Windows :file:`.ini` files.
pt_pt: Analisador (parser) para ficheiros de configuração semelhantes aos ficheiros :file:`.ini` do Windows.

source: shlex Objects
pt_pt: Objetos shlex

source: A :class:`~shlex.shlex` instance has the following methods:
pt_pt: Uma instância de :class:`~shlex.shlex` possui os seguintes métodos:

source: Return a token. If tokens have been stacked using :meth:`push_token`, pop a token off the stack. Otherwise, read one from the input stream. If reading encounters an immediate end-of-file, :attr:`eof` is returned (the empty string (``''``) in non-POSIX mode, and ``None`` in POSIX mode).
pt_pt: Devolve um token. Se tokens tiverem sido empilhados usando :meth:`push_token`, retira (pop) um token da stack. Caso contrário, lê um do stream de entrada. Se a leitura encontrar um fim de ficheiro (EOF) imediato, :attr:`eof` é devolvido (a string vazia (``''``) em modo não-POSIX, e ``None`` em modo POSIX).

source: Push the argument onto the token stack.
pt_pt: Coloca (push) o argumento na stack de tokens.

source: Read a raw token. Ignore the pushback stack, and do not interpret source requests. (This is not ordinarily a useful entry point, and is documented here only for the sake of completeness.)
pt_pt: Lê um token bruto. Ignora a stack de pushback e não interpreta solicitações de origem (source). (Normalmente, este não é um ponto de entrada útil e está aqui documentado apenas para fins de exaustividade.)

source: When :class:`~shlex.shlex` detects a source request (see :attr:`source` below) this method is given the following token as argument, and expected to return a tuple consisting of a filename and an open file-like object.
pt_pt: Quando :class:`~shlex.shlex` deteta uma solicitação de origem (consulte :attr:`source` abaixo), este método recebe o seguinte token como argumento e espera-se que devolva um tuplo constituído por um nome de ficheiro e um objeto do tipo ficheiro aberto.

source: Normally, this method first strips any quotes off the argument. If the result is an absolute pathname, or there was no previous source request in effect, or the previous source was a stream (such as ``sys.stdin``), the result is left alone. Otherwise, if the result is a relative pathname, the directory part of the name of the file immediately before it on the source inclusion stack is prepended (this behavior is like the way the C preprocessor handles ``#include "file.h"``).
pt_pt: Normalmente, este método começa por remover as aspas do argumento. Se o resultado for um caminho absoluto, ou se não houver nenhuma solicitação de origem anterior em vigor, ou se a origem anterior for um stream (como ``sys.stdin``), o resultado não é alterado. Caso contrário, se o resultado for um caminho relativo, o diretório do ficheiro imediatamente anterior na stack de inclusão é prefixado (este comportamento é semelhante à forma como o pré-processador de C lida com ``#include "file.h"``).

source: The result of the manipulations is treated as a filename, and returned as the first component of the tuple, with :func:`open` called on it to yield the second component. (Note: this is the reverse of the order of arguments in instance initialization!)
pt_pt: O resultado das manipulações é tratado como um nome de ficheiro e devolvido como o primeiro componente do tuplo, sendo :func:`open` chamado sobre ele para produzir o segundo componente. (Nota: esta é a ordem inversa dos argumentos na inicialização da instância!)

source: This hook is exposed so that you can use it to implement directory search paths, addition of file extensions, and other namespace hacks. There is no corresponding 'close' hook, but a shlex instance will call the :meth:`~io.IOBase.close` method of the sourced input stream when it returns EOF.
pt_pt: Este hook é exposto para que possa ser usado na implementação de caminhos de pesquisa de diretórios, adição de extensões de ficheiro e outros truques de namespace. Não existe um hook 'close' correspondente, mas uma instância shlex chamará o método :meth:`~io.IOBase.close` do stream de entrada de origem quando devolver EOF.

source: For more explicit control of source stacking, use the :meth:`push_source` and :meth:`pop_source` methods.
pt_pt: Para um controlo mais explícito do empilhamento de origens, utilize os métodos :meth:`push_source` e :meth:`pop_source`.

source: Push an input source stream onto the input stack. If the filename argument is specified it will later be available for use in error messages. This is the same method used internally by the :meth:`sourcehook` method.
pt_pt: Coloca um stream de origem de entrada na stack de entrada. Se o argumento do nome de ficheiro for especificado, ele estará disponível mais tarde para uso em mensagens de erro. Este é o mesmo método usado internamente pelo método :meth:`sourcehook`.

source: Pop the last-pushed input source from the input stack. This is the same method used internally when the lexer reaches EOF on a stacked input stream.
pt_pt: Retira a última origem de entrada colocada na stack de entrada. Este é o mesmo método usado internamente quando o analisador atinge o EOF num stream de entrada empilhado.

source: This method generates an error message leader in the format of a Unix C compiler error label; the format is ``'"%s", line %d: '``, where the ``%s`` is replaced with the name of the current source file and the ``%d`` with the current input line number (the optional arguments can be used to override these).
pt_pt: Este método gera um cabeçalho de mensagem de erro no formato de uma etiqueta de erro do compilador C de Unix; o formato é ``'"%s", line %d: '``, onde o ``%s`` é substituído pelo nome do ficheiro de origem atual e o ``%d`` pelo número da linha de entrada atual (os argumentos opcionais podem ser usados para substituir estes valores).

source: Instances of :class:`~shlex.shlex` subclasses have some public instance variables which either control lexical analysis or can be used for debugging:
pt_pt: Instâncias de subclasses de :class:`~shlex.shlex` têm algumas variáveis de instância públicas que controlam a análise lexical ou podem ser usadas para depuração:

source: The string of characters that are recognized as comment beginners. All characters from the comment beginner to end of line are ignored. Includes just ``'#'`` by default.
pt_pt: A string de caracteres que são reconhecidos como iniciadores de comentários. Todos os caracteres desde o iniciador de comentário até ao fim da linha são ignorados. Inclui apenas ``'#'`` por predefinição.

source: The string of characters that will accumulate into multi-character tokens. By default, includes all ASCII alphanumerics and underscore. In POSIX mode, the accented characters in the Latin-1 set are also included. If :attr:`punctuation_chars` is not empty, the characters ``~-./*?=``, which can appear in filename specifications and command line parameters, will also be included in this attribute, and any characters which appear in ``punctuation_chars`` will be removed from ``wordchars`` if they are present there. If :attr:`whitespace_split` is set to ``True``, this will have no effect.
pt_pt: A string de caracteres que se acumularão em tokens de múltiplos caracteres. Por predefinição, inclui todos os alfanuméricos ASCII e o sublinhado. No modo POSIX, os caracteres acentuados do conjunto Latin-1 também são incluídos. Se :attr:`punctuation_chars` não estiver vazio, os caracteres ``~-./*?=``, que podem aparecer em especificações de nomes de ficheiro e parâmetros de linha de comandos, também serão incluídos neste atributo, e quaisquer caracteres que apareçam em ``punctuation_chars`` serão removidos de ``wordchars`` caso lá estejam presentes. Se :attr:`whitespace_split` estiver definido como ``True``, isto não terá efeito.

source: Characters that will be considered whitespace and skipped. Whitespace bounds tokens. By default, includes space, tab, linefeed and carriage-return.
pt_pt: Caracteres que serão considerados espaços em branco (whitespace) e ignorados. O espaço em branco delimita tokens. Por predefinição, inclui espaço, tab, linefeed e carriage-return.

source: Characters that will be considered as escape. This will be only used in POSIX mode, and includes just ``'\'`` by default.
pt_pt: Caracteres que serão considerados como escape. Isto apenas será usado no modo POSIX e inclui apenas ``'\'`` por predefinição.

source: Characters that will be considered string quotes. The token accumulates until the same quote is encountered again (thus, different quote types protect each other as in the shell.) By default, includes ASCII single and double quotes.
pt_pt: Caracteres que serão considerados aspas de string. O token acumula-se até que a mesma aspa seja encontrada novamente (assim, diferentes tipos de aspas protegem-se uns aos outros como na shell). Por predefinição, inclui aspas simples e duplas ASCII.

source: Characters in :attr:`quotes` that will interpret escape characters defined in :attr:`escape`. This is only used in POSIX mode, and includes just ``'"'`` by default.
pt_pt: Caracteres em :attr:`quotes` que interpretarão caracteres de escape definidos em :attr:`escape`. Isto é apenas usado no modo POSIX e inclui apenas ``'"'`` por predefinição.

source: If ``True``, tokens will only be split in whitespaces. This is useful, for example, for parsing command lines with :class:`~shlex.shlex`, getting tokens in a similar way to shell arguments. When used in combination with :attr:`punctuation_chars`, tokens will be split on whitespace in addition to those characters.
pt_pt: Se for ``True``, os tokens só serão divididos nos espaços em branco. Isto é útil, por exemplo, para analisar linhas de comando com :class:`~shlex.shlex`, obtendo tokens de forma semelhante aos argumentos da shell. Quando usado em combinação com :attr:`punctuation_chars`, os tokens serão divididos no espaço em branco além desses caracteres.

source: The :attr:`punctuation_chars` attribute was made compatible with the :attr:`whitespace_split` attribute.
pt_pt: O atributo :attr:`punctuation_chars` foi tornado compatível com o atributo :attr:`whitespace_split`.

source: The name of the current input file, as initially set at class instantiation time or stacked by later source requests. It may be useful to examine this when constructing error messages.
pt_pt: O nome do ficheiro de entrada atual, conforme definido inicialmente no momento da instanciação da classe ou empilhado por solicitações de origem posteriores. Pode ser útil examinar isto ao construir mensagens de erro.

source: The input stream from which this :class:`~shlex.shlex` instance is reading characters.
pt_pt: O stream de entrada do qual esta instância :class:`~shlex.shlex` está a ler caracteres.

source: This attribute is ``None`` by default. If you assign a string to it, that string will be recognized as a lexical-level inclusion request similar to the ``source`` keyword in various shells. That is, the immediately following token will be opened as a filename and input will be taken from that stream until EOF, at which point the :meth:`~io.IOBase.close` method of that stream will be called and the input source will again become the original input stream. Source requests may be stacked any number of levels deep.
pt_pt: Este atributo é ``None`` por predefinição. Se lhe atribuir uma string, essa string será reconhecida como um pedido de inclusão a nível lexical semelhante à palavra-chave ``source`` em várias shells. Ou seja, o token imediatamente seguinte será aberto como um nome de ficheiro e a entrada será obtida desse stream até ao EOF, ponto em que o método :meth:`~io.IOBase.close` desse stream será chamado e a origem de entrada voltará a ser o stream original. Os pedidos de origem podem ser empilhados em qualquer número de níveis.

source: If this attribute is numeric and ``1`` or more, a :class:`~shlex.shlex` instance will print verbose progress output on its behavior. If you need to use this, you can read the module source code to learn the details.
pt_pt: Se este atributo for numérico e igual a ``1`` ou mais, uma instância de :class:`~shlex.shlex` imprimirá uma saída detalhada (verbose) sobre o seu comportamento. Se precisar de usar isto, pode ler o código-fonte do módulo para conhecer os detalhes.

source: Source line number (count of newlines seen so far plus one).
pt_pt: Número da linha de origem (contagem de quebras de linha vistas até agora mais uma).

source: The token buffer. It may be useful to examine this when catching exceptions.
pt_pt: O buffer do token. Pode ser útil examinar isto ao capturar exceções.

source: Token used to determine end of file. This will be set to the empty string (``''``), in non-POSIX mode, and to ``None`` in POSIX mode.
pt_pt: Token usado para determinar o fim do ficheiro. Será definido como a string vazia (``''``) em modo não-POSIX, e como ``None`` em modo POSIX.

source: A read-only property. Characters that will be considered punctuation. Runs of punctuation characters will be returned as a single token. However, note that no semantic validity checking will be performed: for example, '>>>' could be returned as a token, even though it may not be recognised as such by shells.
pt_pt: Uma propriedade de apenas leitura. Caracteres que serão considerados pontuação. Sequências de caracteres de pontuação serão devolvidas como um único token. No entanto, note que não será realizada qualquer verificação de validade semântica: por exemplo, '>>>' poderia ser devolvido como um token, embora possa não ser reconhecido como tal pelas shells.

source: Parsing Rules
pt_pt: Regras de Análise (Parsing)

source: When operating in non-POSIX mode, :class:`~shlex.shlex` will try to obey to the following rules.
pt_pt: Ao operar em modo não-POSIX, o :class:`~shlex.shlex` tentará obedecer às seguintes regras.

source: Quote characters are not recognized within words (``Do"Not"Separate`` is parsed as the single word ``Do"Not"Separate``);
pt_pt: Os caracteres de aspas não são reconhecidos dentro de palavras (``Do"Not"Separate`` é analisado como a palavra única ``Do"Not"Separate``);

source: Escape characters are not recognized;
pt_pt: Os caracteres de escape não são reconhecidos;

source: Enclosing characters in quotes preserve the literal value of all characters within the quotes;
pt_pt: Colocar caracteres entre aspas preserva o valor literal de todos os caracteres dentro das aspas;

source: Closing quotes separate words (``"Do"Separate`` is parsed as ``"Do"`` and ``Separate``);
pt_pt: As aspas de fecho separam palavras (``"Do"Separate`` é analisado como ``"Do"`` e ``Separate``);

source: If :attr:`~shlex.whitespace_split` is ``False``, any character not declared to be a word character, whitespace, or a quote will be returned as a single-character token. If it is ``True``, :class:`~shlex.shlex` will only split words in whitespaces;
pt_pt: Se :attr:`~shlex.whitespace_split` for ``False``, qualquer carácter não declarado como carácter de palavra, espaço em branco ou aspa será devolvido como um token de carácter único. Se for ``True``, o :class:`~shlex.shlex` apenas dividirá palavras nos espaços em branco;

source: EOF is signaled with an empty string (``''``);
pt_pt: O EOF é sinalizado com uma string vazia (``''``);

source: It's not possible to parse empty strings, even if quoted.
pt_pt: Não é possível analisar strings vazias, mesmo que entre aspas.

source: When operating in POSIX mode, :class:`~shlex.shlex` will try to obey to the following parsing rules.
pt_pt: Ao operar em modo POSIX, o :class:`~shlex.shlex` tentará obedecer às seguintes regras de análise.

source: Quotes are stripped out, and do not separate words (``"Do"Not"Separate"`` is parsed as the single word ``DoNotSeparate``);
pt_pt: As aspas são removidas e não separam palavras (``"Do"Not"Separate"`` é analisado como a palavra única ``DoNotSeparate``);

source: Non-quoted escape characters (e.g. ``'\'``) preserve the literal value of the next character that follows;
pt_pt: Caracteres de escape não citados (ex: ``'\'``) preservam o valor literal do carácter seguinte;
