Repository: NyaPuma/python-docs-pt
Catalog: library/site.po
Languages: pt_pt

source: :mod:`!site` --- Site-specific configuration hook
pt_pt: :mod:`!site` --- Gancho de configuração específico do site

source: **Source code:** :source:`Lib/site.py`
pt_pt: **Código-fonte:** :source:`Lib/site.py`

source: **This module is automatically imported during initialization.** The automatic import can be suppressed using the interpreter's :option:`-S` option.
pt_pt: **Este módulo é importado automaticamente durante a inicialização.** A importação automática pode ser suprimida utilizando a opção :option:`-S` do intérprete.

source: Importing this module normally appends site-specific paths to the module search path and adds :ref:`callables <site-consts>`, including :func:`help` to the built-in namespace. However, Python startup option :option:`-S` blocks this and this module can be safely imported with no automatic modifications to the module search path or additions to the builtins. To explicitly trigger the usual site-specific additions, call the :func:`main` function.
pt_pt: A importação deste módulo normalmente anexa caminhos específicos do site ao caminho de pesquisa de módulos e adiciona :ref:`chamáveis <site-consts>`, incluindo :func:`help`, ao espaço de nomes built-in. No entanto, a opção de inicialização do Python :option:`-S` bloqueia isto, e este módulo pode ser importado em segurança sem modificações automáticas ao caminho de pesquisa de módulos ou adições aos builtins. Para acionar explicitamente as adições habituais específicas do site, chame a função :func:`main`.

source: Importing the module used to trigger paths manipulation even when using :option:`-S`.
pt_pt: A importação do módulo costumava acionar a manipulação de caminhos mesmo ao utilizar :option:`-S`.

source: It starts by constructing up to four directories from a head and a tail part. For the head part, it uses ``sys.prefix`` and ``sys.exec_prefix``; empty heads are skipped. For the tail part, it uses the empty string and then :file:`lib/site-packages` (on Windows) or :file:`lib/python{X.Y[t]}/site-packages` (on Unix and macOS). (The optional suffix "t" indicates the :term:`free-threaded build`, and is appended if ``"t"`` is present in the :data:`sys.abiflags` constant.) For each of the distinct head-tail combinations, it sees if it refers to an existing directory, and if so, adds it to ``sys.path`` and also inspects the newly added path for configuration files.
pt_pt: Começa por construir até quatro diretórios a partir de uma parte inicial (head) e uma parte final (tail). Para a parte inicial, utiliza ``sys.prefix`` e ``sys.exec_prefix``; cabeças vazias são ignoradas. Para a parte final, utiliza a string vazia e depois :file:`lib/site-packages` (em Windows) ou :file:`lib/python{X.Y[t]}/site-packages` (em Unix e macOS). (O sufixo opcional "t" indica a :term:`free-threaded build`, e é anexado se ``"t"`` estiver presente na constante :data:`sys.abiflags`.) Para cada uma das combinações distintas de head-tail, verifica se se referem a um diretório existente e, em caso afirmativo, adiciona-o a ``sys.path`` e inspeciona também o caminho recém-adicionado à procura de ficheiros de configuração.

source: Support for the "site-python" directory has been removed.
pt_pt: O suporte para o diretório "site-python" foi removido.

source: On Unix, :term:`Free threading <free threading>` Python installations are identified by the "t" suffix in the version-specific directory name, such as :file:`lib/python3.13t/`.
pt_pt: Em Unix, as instalações de Python :term:`Free threading <free threading>` são identificadas pelo sufixo "t" no nome do diretório específico da versão, como :file:`lib/python3.13t/`.

source: :mod:`site` is no longer responsible for updating :data:`sys.prefix` and :data:`sys.exec_prefix` on :ref:`sys-path-init-virtual-environments`. This is now done during the :ref:`path initialization <sys-path-init>`. As a result, under :ref:`sys-path-init-virtual-environments`, :data:`sys.prefix` and :data:`sys.exec_prefix` no longer depend on the :mod:`site` initialization, and are therefore unaffected by :option:`-S`.
pt_pt: O :mod:`site` já não é responsável por atualizar :data:`sys.prefix` e :data:`sys.exec_prefix` em :ref:`sys-path-init-virtual-environments`. Isto é agora feito durante a :ref:`inicialização do caminho <sys-path-init>`. Como resultado, sob :ref:`sys-path-init-virtual-environments`, :data:`sys.prefix` e :data:`sys.exec_prefix` já não dependem da inicialização do :mod:`site` e, portanto, não são afetados por :option:`-S`.

source: When running under a :ref:`virtual environment <sys-path-init-virtual-environments>`, the ``pyvenv.cfg`` file in :data:`sys.prefix` is checked for site-specific configurations. If the ``include-system-site-packages`` key exists and is set to ``true`` (case-insensitive), the system-level prefixes will be searched for site-packages, otherwise they won't.
pt_pt: Ao correr sob um :ref:`ambiente virtual <sys-path-init-virtual-environments>`, o ficheiro ``pyvenv.cfg`` em :data:`sys.prefix` é verificado para configurações específicas do site. Se a chave ``include-system-site-packages`` existir e estiver definida como ``true`` (insensível a maiúsculas/minúsculas), os prefixos ao nível do sistema serão pesquisados por site-packages; caso contrário, não serão.

source: A path configuration file is a file whose name has the form :file:`{name}.pth` and exists in one of the four directories mentioned above; its contents are additional items (one per line) to be added to ``sys.path``. Non-existing items are never added to ``sys.path``, and no check is made that the item refers to a directory rather than a file. No item is added to ``sys.path`` more than once. Blank lines and lines beginning with ``#`` are skipped. Lines starting with ``import`` (followed by space or tab) are executed.
pt_pt: Um ficheiro de configuração de caminho é um ficheiro cujo nome tem a forma :file:`{nome}.pth` e existe num dos quatro diretórios acima mencionados; o seu conteúdo são itens adicionais (um por linha) a serem adicionados ao ``sys.path``. Itens que não existam nunca são adicionados ao ``sys.path``, e não é feita qualquer verificação se o item se refere a um diretório em vez de um ficheiro. Nenhum item é adicionado ao ``sys.path`` mais do que uma vez. Linhas em branco e linhas que comecem com ``#`` são ignoradas. Linhas que comecem com ``import`` (seguido de espaço ou tabulação) são executadas.

source: An executable line in a :file:`.pth` file is run at every Python startup, regardless of whether a particular module is actually going to be used. Its impact should thus be kept to a minimum. The primary intended purpose of executable lines is to make the corresponding module(s) importable (load 3rd-party import hooks, adjust :envvar:`PATH` etc). Any other initialization is supposed to be done upon a module's actual import, if and when it happens. Limiting a code chunk to a single line is a deliberate measure to discourage putting anything more complex here.
pt_pt: Uma linha executável num ficheiro :file:`.pth` corre em cada inicialização do Python, independentemente de um módulo específico vir a ser efetivamente utilizado. O seu impacto deve, portanto, ser reduzido ao mínimo. O propósito principal das linhas executáveis é tornar o(s) módulo(s) correspondente(s) importáveis (carregar ganchos de importação de terceiros, ajustar a :envvar:`PATH`, etc.). Qualquer outra inicialização deve ser feita aquando da importação real do módulo, se e quando esta ocorrer. Limitar um bloco de código a uma única linha é uma medida deliberada para desencorajar a colocação de algo mais complexo aqui.

source: The :file:`.pth` files are now decoded by UTF-8 at first and then by the :term:`locale encoding` if it fails.
pt_pt: Os ficheiros :file:`.pth` são agora descodificados primeiro por UTF-8 e depois pela :term:`codificação do local <locale encoding>` se a primeira falhar.

source: For example, suppose ``sys.prefix`` and ``sys.exec_prefix`` are set to :file:`/usr/local`. The Python X.Y library is then installed in :file:`/usr/local/lib/python{X.Y}`. Suppose this has a subdirectory :file:`/usr/local/lib/python{X.Y}/site-packages` with three subsubdirectories, :file:`foo`, :file:`bar` and :file:`spam`, and two path configuration files, :file:`foo.pth` and :file:`bar.pth`. Assume :file:`foo.pth` contains the following::
pt_pt: Por exemplo, suponha que ``sys.prefix`` e ``sys.exec_prefix`` estão definidos como :file:`/usr/local`. A biblioteca Python X.Y é então instalada em :file:`/usr/local/lib/python{X.Y}`. Suponha que esta tem um subdiretório :file:`/usr/local/lib/python{X.Y}/site-packages` com três sub-subdiretórios, :file:`foo`, :file:`bar` e :file:`spam`, e dois ficheiros de configuração de caminho, :file:`foo.pth` e :file:`bar.pth`. Assuma que o :file:`foo.pth` contém o seguinte::

source: # foo package configuration foo bar bletch
pt_pt: # configuração do pacote foo foo bar bletch

source: and :file:`bar.pth` contains::
pt_pt: e o :file:`bar.pth` contém::

source: # bar package configuration bar
pt_pt: # configuração do pacote bar bar

source: Then the following version-specific directories are added to ``sys.path``, in this order::
pt_pt: Então, os seguintes diretórios específicos da versão são adicionados ao ``sys.path``, por esta ordem::

source: Note that :file:`bletch` is omitted because it doesn't exist; the :file:`bar` directory precedes the :file:`foo` directory because :file:`bar.pth` comes alphabetically before :file:`foo.pth`; and :file:`spam` is omitted because it is not mentioned in either path configuration file.
pt_pt: Note que :file:`bletch` é omitido porque não existe; o diretório :file:`bar` precede o diretório :file:`foo` porque :file:`bar.pth` vem antes de :file:`foo.pth` por ordem alfabética; e :file:`spam` é omitido porque não é mencionado em nenhum ficheiro de configuração de caminho.

source: After these path manipulations, an attempt is made to import a module named :mod:`sitecustomize`, which can perform arbitrary site-specific customizations. It is typically created by a system administrator in the site-packages directory. If this import fails with an :exc:`ImportError` or its subclass exception, and the exception's :attr:`~ImportError.name` attribute equals to ``'sitecustomize'``, it is silently ignored. If Python is started without output streams available, as with :file:`pythonw.exe` on Windows (which is used by default to start IDLE), attempted output from :mod:`sitecustomize` is ignored. Any other exception causes a silent and perhaps mysterious failure of the process.
pt_pt: Após estas manipulações de caminho, é feita uma tentativa de importar um módulo chamado :mod:`sitecustomize`, que pode realizar personalizações arbitrárias específicas do site. É tipicamente criado por um administrador de sistema no diretório site-packages. Se esta importação falhar com uma :exc:`ImportError` ou uma exceção da sua subclasse, e o atributo :attr:`~ImportError.name` da exceção for igual a ``'sitecustomize'``, ela é silenciosamente ignorada. Se o Python for iniciado sem fluxos de saída disponíveis, como acontece com o :file:`pythonw.exe` em Windows (que é utilizado por defeito para iniciar o IDLE), qualquer tentativa de saída do :mod:`sitecustomize` é ignorada. Qualquer outra exceção causa uma falha silenciosa e talvez misteriosa do processo.

source: After this, an attempt is made to import a module named :mod:`usercustomize`, which can perform arbitrary user-specific customizations, if :data:`~site.ENABLE_USER_SITE` is true. This file is intended to be created in the user site-packages directory (see below), which is part of ``sys.path`` unless disabled by :option:`-s`. If this import fails with an :exc:`ImportError` or its subclass exception, and the exception's :attr:`~ImportError.name` attribute equals to ``'usercustomize'``, it is silently ignored.
pt_pt: Depois disto, é feita uma tentativa de importar um módulo chamado :mod:`usercustomize`, que pode realizar personalizações arbitrárias específicas do utilizador, se :data:`~site.ENABLE_USER_SITE` for verdadeiro. Este ficheiro destina-se a ser criado no diretório site-packages do utilizador (ver abaixo), que faz parte do ``sys.path`` exceto se desativado por :option:`-s`. Se esta importação falhar com uma :exc:`ImportError` ou uma exceção da sua subclasse, e o atributo :attr:`~ImportError.name` da exceção for igual a ``'usercustomize'``, é silenciosamente ignorada.

source: Note that for some non-Unix systems, ``sys.prefix`` and ``sys.exec_prefix`` are empty, and the path manipulations are skipped; however the import of :mod:`sitecustomize` and :mod:`usercustomize` is still attempted.
pt_pt: Note que, para alguns sistemas não-Unix, ``sys.prefix`` e ``sys.exec_prefix`` estão vazios, e as manipulações de caminho são ignoradas; no entanto, a tentativa de importação de :mod:`sitecustomize` e :mod:`usercustomize` é ainda realizada.

source: Readline configuration
pt_pt: Configuração do Readline

source: On systems that support :mod:`readline`, this module will also import and configure the :mod:`rlcompleter` module, if Python is started in :ref:`interactive mode <tut-interactive>` and without the :option:`-S` option. The default behavior is enable tab-completion and to use :file:`~/.python_history` as the history save file. To disable it, delete (or override) the :data:`sys.__interactivehook__` attribute in your :mod:`sitecustomize` or :mod:`usercustomize` module or your :envvar:`PYTHONSTARTUP` file.
pt_pt: Em sistemas que suportem :mod:`readline`, este módulo também irá importar e configurar o módulo :mod:`rlcompleter`, se o Python for iniciado em :ref:`modo interativo <tut-interactive>` e sem a opção :option:`-S`. O comportamento por defeito é ativar a conclusão por tabulação (tab-completion) e utilizar o :file:`~/.python_history` como ficheiro de gravação do histórico. Para o desativar, apague (ou substitua) o atributo :data:`sys.__interactivehook__` no seu módulo :mod:`sitecustomize` ou :mod:`usercustomize`, ou no seu ficheiro :envvar:`PYTHONSTARTUP`.

source: Activation of rlcompleter and history was made automatic.
pt_pt: A ativação do rlcompleter e do histórico passou a ser automática.

source: Module contents
pt_pt: Conteúdos do módulo

source: A list of prefixes for site-packages directories.
pt_pt: Uma lista de prefixos para diretórios site-packages.

source: Flag showing the status of the user site-packages directory. ``True`` means that it is enabled and was added to ``sys.path``. ``False`` means that it was disabled by user request (with :option:`-s` or :envvar:`PYTHONNOUSERSITE`). ``None`` means it was disabled for security reasons (mismatch between user or group id and effective id) or by an administrator.
pt_pt: Sinalizador que mostra o estado do diretório site-packages do utilizador. ``True`` significa que está ativado e foi adicionado ao ``sys.path``. ``False`` significa que foi desativado a pedido do utilizador (com :option:`-s` ou :envvar:`PYTHONNOUSERSITE`). ``None`` significa que foi desativado por razões de segurança (desajuste entre o ID de utilizador ou grupo e o ID efetivo) ou por um administrador.

source: Path to the user site-packages for the running Python. Can be ``None`` if :func:`getusersitepackages` hasn't been called yet. Default value is :file:`~/.local/lib/python{X.Y}[t]/site-packages` for UNIX and non-framework macOS builds, :file:`~/Library/Python/{X.Y}/lib/python/site-packages` for macOS framework builds, and :file:`{%APPDATA%}\\Python\\Python{XY}\\site-packages` on Windows. The optional "t" indicates the free-threaded build. This directory is a site directory, which means that :file:`.pth` files in it will be processed.
pt_pt: Caminho para o site-packages do utilizador para o Python em execução. Pode ser ``None`` se :func:`getusersitepackages` ainda não tiver sido chamado. O valor por defeito é :file:`~/.local/lib/python{X.Y}[t]/site-packages` para UNIX e builds de macOS que não sejam framework, :file:`~/Library/Python/{X.Y}/lib/python/site-packages` para builds de framework macOS, e :file:`{%APPDATA%}\\Python\\Python{XY}\\site-packages` em Windows. O "t" opcional indica a free-threaded build. Este diretório é um diretório de site, o que significa que os ficheiros :file:`.pth` nele contidos serão processados.

source: Path to the base directory for the user site-packages. Can be ``None`` if :func:`getuserbase` hasn't been called yet. Default value is :file:`~/.local` for UNIX and macOS non-framework builds, :file:`~/Library/Python/{X.Y}` for macOS framework builds, and :file:`{%APPDATA%}\\Python` for Windows. This value is used to compute the installation directories for scripts, data files, Python modules, etc. for the :ref:`user installation scheme <sysconfig-user-scheme>`. See also :envvar:`PYTHONUSERBASE`.
pt_pt: Caminho para o diretório base para o site-packages do utilizador. Pode ser ``None`` se :func:`getuserbase` ainda não tiver sido chamado. O valor por defeito é :file:`~/.local` para UNIX e builds de macOS que não sejam framework, :file:`~/Library/Python/{X.Y}` para builds de framework macOS, e :file:`{%APPDATA%}\\Python` para Windows. Este valor é utilizado para calcular os diretórios de instalação de scripts, ficheiros de dados, módulos Python, etc., para o :ref:`esquema de instalação do utilizador <sysconfig-user-scheme>`. Consulte também :envvar:`PYTHONUSERBASE`.

source: Adds all the standard site-specific directories to the module search path. This function is called automatically when this module is imported, unless the Python interpreter was started with the :option:`-S` flag.
pt_pt: Adiciona todos os diretórios padrão específicos do site ao caminho de pesquisa de módulos. Esta função é chamada automaticamente quando este módulo é importado, a menos que o intérprete Python tenha sido iniciado com a flag :option:`-S`.

source: This function used to be called unconditionally.
pt_pt: Esta função costumava ser chamada incondicionalmente.

source: Add a directory to sys.path and process its :file:`.pth` files. Typically used in :mod:`sitecustomize` or :mod:`usercustomize` (see above).
pt_pt: Adiciona um diretório ao sys.path e processa os seus ficheiros :file:`.pth`. Tipicamente utilizado no :mod:`sitecustomize` ou :mod:`usercustomize` (ver acima).

source: Return a list containing all global site-packages directories.
pt_pt: Devolve uma lista contendo todos os diretórios site-packages globais.

source: Return the path of the user base directory, :data:`USER_BASE`. If it is not initialized yet, this function will also set it, respecting :envvar:`PYTHONUSERBASE`.
pt_pt: Devolve o caminho do diretório base do utilizador, :data:`USER_BASE`. Se ainda não estiver inicializado, esta função também o irá definir, respeitando a :envvar:`PYTHONUSERBASE`.

source: Return the path of the user-specific site-packages directory, :data:`USER_SITE`. If it is not initialized yet, this function will also set it, respecting :data:`USER_BASE`. To determine if the user-specific site-packages was added to ``sys.path`` :data:`ENABLE_USER_SITE` should be used.
pt_pt: Devolve o caminho do diretório site-packages específico do utilizador, :data:`USER_SITE`. Se ainda não estiver inicializado, esta função também o irá definir, respeitando a :data:`USER_BASE`. Para determinar se o site-packages específico do utilizador foi adicionado ao ``sys.path``, deve ser utilizado o :data:`ENABLE_USER_SITE`.

source: Command-line interface
pt_pt: Interface de linha de comandos

source: The :mod:`site` module also provides a way to get the user directories from the command line:
pt_pt: O módulo :mod:`site` também fornece uma forma de obter os diretórios do utilizador a partir da linha de comandos:

source: If it is called without arguments, it will print the contents of :data:`sys.path` on the standard output, followed by the value of :data:`USER_BASE` and whether the directory exists, then the same thing for :data:`USER_SITE`, and finally the value of :data:`ENABLE_USER_SITE`.
pt_pt: Se for chamado sem argumentos, imprimirá o conteúdo do :data:`sys.path` na saída padrão, seguido do valor de :data:`USER_BASE` e se o diretório existe, depois o mesmo para :data:`USER_SITE` e, finalmente, o valor de :data:`ENABLE_USER_SITE`.

source: Print the path to the user base directory.
pt_pt: Imprime o caminho para o diretório base do utilizador.

source: Print the path to the user site-packages directory.
pt_pt: Imprime o caminho para o diretório site-packages do utilizador.

source: If both options are given, user base and user site will be printed (always in this order), separated by :data:`os.pathsep`.
pt_pt: Se ambas as opções forem fornecidas, a base do utilizador e o site do utilizador serão impressos (sempre por esta ordem), separados por :data:`os.pathsep`.

source: If any option is given, the script will exit with one of these values: ``0`` if the user site-packages directory is enabled, ``1`` if it was disabled by the user, ``2`` if it is disabled for security reasons or by an administrator, and a value greater than 2 if there is an error.
pt_pt: Se qualquer opção for fornecida, o script sairá com um destes valores: ``0`` se o diretório site-packages do utilizador estiver ativado, ``1`` se tiver sido desativado pelo utilizador, ``2`` se estiver desativado por razões de segurança ou por um administrador, e um valor superior a 2 se ocorrer um erro.

source: :pep:`370` -- Per user site-packages directory
pt_pt: :pep:`370` — Diretório site-packages por utilizador

source: :ref:`sys-path-init` -- The initialization of :data:`sys.path`.
pt_pt: :ref:`sys-path-init` — A inicialização do :data:`sys.path`.

source: module
pt_pt: módulo

source: search
pt_pt: pesquisa

source: path
pt_pt: caminho

source: directory
pt_pt: diretório

source: # (hash)
pt_pt: # (cardinal)

source: comment
pt_pt: comentário

source: statement
pt_pt: instrução

source: import
pt_pt: importação

source: package
pt_pt: pacote

source: configuration
pt_pt: configuração

source: file
pt_pt: ficheiro
