Repository: NyaPuma/python-docs-pt
Catalog: library/string.templatelib.po
Languages: pt_pt

source: :mod:`!string.templatelib` --- Support for template string literals
pt_pt: :mod:`!string.templatelib` --- Suporte para literais de string de modelo (template)

source: **Source code:** :source:`Lib/string/templatelib.py`
pt_pt: **Código-fonte:** :source:`Lib/string/templatelib.py`

source: :ref:`Format strings <f-strings>`
pt_pt: :ref:`Strings de formatação <f-strings>`

source: :ref:`Template string literal (t-string) syntax <t-strings>`
pt_pt: :ref:`Sintaxe de literais de string de modelo (t-string) <t-strings>`

source: Template strings
pt_pt: Strings de modelo (Template strings)

source: Template strings are a mechanism for custom string processing. They have the full flexibility of Python's :ref:`f-strings`, but return a :class:`Template` instance that gives access to the static and interpolated (in curly brackets) parts of a string *before* they are combined.
pt_pt: As strings de modelo são um mecanismo para processamento personalizado de strings. Possuem toda a flexibilidade das :ref:`f-strings` do Python, mas devolvem uma instância de :class:`Template` que permite o acesso às partes estáticas e interpoladas (em chavetas) de uma string *antes* de estas serem combinadas.

source: To write a t-string, use a ``'t'`` prefix instead of an ``'f'``, like so:
pt_pt: Para escrever uma t-string, utilize o prefixo ``'t'`` em vez de ``'f'``, desta forma:

source: Types
pt_pt: Tipos

source: The :class:`!Template` class describes the contents of a template string. It is immutable, meaning that attributes of a template cannot be reassigned.
pt_pt: A classe :class:`!Template` descreve o conteúdo de uma string de modelo. É imutável, o que significa que os atributos de um modelo não podem ser reatribuídos.

source: The most common way to create a :class:`!Template` instance is to use the :ref:`template string literal syntax <t-strings>`. This syntax is identical to that of :ref:`f-strings <f-strings>`, except that it uses a ``t`` prefix in place of an ``f``:
pt_pt: A forma mais comum de criar uma instância de :class:`!Template` é usar a :ref:`sintaxe de literal de string de modelo <t-strings>`. Esta sintaxe é idêntica à das :ref:`f-strings <f-strings>`, exceto pelo facto de usar o prefixo ``t`` em vez de ``f``:

source: Templates are stored as sequences of literal :attr:`~Template.strings` and dynamic :attr:`~Template.interpolations`. A :attr:`~Template.values` attribute holds the values of the interpolations:
pt_pt: Os modelos são armazenados como sequências de literais :attr:`~Template.strings` e :attr:`~Template.interpolations` dinâmicas. Um atributo :attr:`~Template.values` guarda os valores das interpolações:

source: The :attr:`!strings` tuple has one more element than :attr:`!interpolations` and :attr:`!values`; the interpolations “belong” between the strings. This may be easier to understand when tuples are aligned
pt_pt: O tuplo :attr:`!strings` tem mais um elemento do que :attr:`!interpolations` e :attr:`!values`; as interpolações "pertencem" ao espaço entre as strings. Isto pode ser mais fácil de entender quando os tuplos estão alinhados

source: Attributes
pt_pt: Atributos

source: A :class:`tuple` of the static strings in the template.
pt_pt: Um :class:`tuple` das strings estáticas no modelo.

source: Empty strings *are* included in the tuple:
pt_pt: Strings vazias *são* incluídas no tuplo:

source: The ``strings`` tuple is never empty, and always contains one more string than the ``interpolations`` and ``values`` tuples:
pt_pt: O tuplo ``strings`` nunca está vazio e contém sempre mais uma string do que os tuplos ``interpolations`` e ``values``:

source: A :class:`tuple` of the interpolations in the template.
pt_pt: Um :class:`tuple` das interpolações no modelo.

source: The ``interpolations`` tuple may be empty and always contains one fewer values than the ``strings`` tuple:
pt_pt: O tuplo ``interpolations`` pode estar vazio e contém sempre menos um valor do que o tuplo ``strings``:

source: A tuple of all interpolated values in the template.
pt_pt: Um tuplo de todos os valores interpolados no modelo.

source: The ``values`` tuple always has the same length as the ``interpolations`` tuple. It is always equivalent to ``tuple(i.value for i in template.interpolations)``.
pt_pt: O tuplo ``values`` tem sempre o mesmo comprimento que o tuplo ``interpolations``. É sempre equivalente a ``tuple(i.value for i in template.interpolations)``.

source: Methods
pt_pt: Métodos

source: While literal syntax is the most common way to create a :class:`!Template`, it is also possible to create them directly using the constructor:
pt_pt: Embora a sintaxe literal seja a forma mais comum de criar um :class:`!Template`, também é possível criá-los diretamente usando o construtor:

source: If multiple strings are passed consecutively, they will be concatenated into a single value in the :attr:`~Template.strings` attribute. For example, the following code creates a :class:`Template` with a single final string:
pt_pt: Se forem passadas múltiplas strings consecutivamente, estas serão concatenadas num único valor no atributo :attr:`~Template.strings`. Por exemplo, o seguinte código cria um :class:`Template` com uma única string final:

source: If multiple interpolations are passed consecutively, they will be treated as separate interpolations and an empty string will be inserted between them. For example, the following code creates a template with empty placeholders in the :attr:`~Template.strings` attribute:
pt_pt: Se forem passadas múltiplas interpolações consecutivamente, estas serão tratadas como interpolações separadas e uma string vazia será inserida entre elas. Por exemplo, o seguinte código cria um modelo com placeholders vazios no atributo :attr:`~Template.strings`:

source: Iterate over the template, yielding each non-empty string and :class:`Interpolation` in the correct order:
pt_pt: Itera sobre o modelo, produzindo (yielding) cada string não vazia e :class:`Interpolation` na ordem correta:

source: Empty strings are **not** included in the iteration:
pt_pt: Strings vazias **não** são incluídas na iteração:

source: Concatenate this template with another, returning a new :class:`!Template` instance:
pt_pt: Concatena este modelo com outro, devolvendo uma nova instância de :class:`!Template`:

source: Concatenating a :class:`!Template` and a ``str`` is **not** supported. This is because it is unclear whether the string should be treated as a static string or an interpolation. If you want to concatenate a :class:`!Template` with a string, you should either wrap the string directly in a :class:`!Template` (to treat it as a static string) or use an :class:`!Interpolation` (to treat it as dynamic):
pt_pt: A concatenação de um :class:`!Template` e uma ``str`` **não** é suportada. Isto deve-se ao facto de não ser claro se a string deve ser tratada como uma string estática ou uma interpolação. Se desejar concatenar um :class:`!Template` com uma string, deve envolver a string diretamente num :class:`!Template` (para tratá-la como estática) ou usar uma :class:`!Interpolation` (para tratá-la como dinâmica):

source: The :class:`!Interpolation` type represents an expression inside a template string. It is immutable, meaning that attributes of an interpolation cannot be reassigned.
pt_pt: O tipo :class:`!Interpolation` representa uma expressão dentro de uma string de modelo. É imutável, o que significa que os atributos de uma interpolação não podem ser reatribuídos.

source: Interpolations support pattern matching, allowing you to match against their attributes with the :ref:`match statement <match>`:
pt_pt: As interpolações suportam correspondência de padrões (pattern matching), permitindo-lhe corresponder os seus atributos com a :ref:`instrução match <match>`:

source: The evaluated value of the interpolation.
pt_pt: O valor avaliado da interpolação.

source: For interpolations created by t-string literals, :attr:`!expression` is the expression text found inside the curly brackets (``{`` & ``}``), including any whitespace, excluding the curly brackets themselves, and ending before the first ``!``, ``:``, or ``=`` if any is present. For manually created interpolations, :attr:`!expression` is the arbitrary string provided when constructing the interpolation instance.
pt_pt: Para interpolações criadas por literais t-string, :attr:`!expression` é o texto da expressão encontrado dentro das chavetas (``{`` & ``}``), incluindo qualquer espaço em branco, excluindo as próprias chavetas, e terminando antes do primeiro ``!``, ``:``, ou ``=``, se presente. Para interpolações criadas manualmente, :attr:`!expression` é a string arbitrária fornecida ao construir a instância de interpolação.

source: We recommend using valid Python expressions or the empty string for the ``expression`` field of manually created :class:`!Interpolation` instances, although this is not enforced at runtime.
pt_pt: Recomendamos o uso de expressões Python válidas ou uma string vazia para o campo ``expression`` de instâncias de :class:`!Interpolation` criadas manualmente, embora isto não seja imposto em tempo de execução.

source: The conversion to apply to the value, or ``None``.
pt_pt: A conversão a aplicar ao valor, ou ``None``.

source: The :attr:`!conversion` is the optional conversion to apply to the value:
pt_pt: A :attr:`!conversion` é a conversão opcional a aplicar ao valor:

source: Unlike f-strings, where conversions are applied automatically, the expected behavior with t-strings is that code that *processes* the :class:`!Template` will decide how to interpret and whether to apply the :attr:`!conversion`. For convenience, the :func:`convert` function can be used to mimic f-string conversion semantics.
pt_pt: Ao contrário das f-strings, onde as conversões são aplicadas automaticamente, o comportamento esperado com t-strings é que o código que *processa* o :class:`!Template` decida como interpretar e se deve aplicar a :attr:`!conversion`. Por conveniência, a função :func:`convert` pode ser usada para imitar a semântica de conversão das f-strings.

source: The format specification to apply to the value.
pt_pt: A especificação de formato a aplicar ao valor.

source: The :attr:`!format_spec` is an optional, arbitrary string used as the format specification to present the value:
pt_pt: O :attr:`!format_spec` é uma string opcional e arbitrária usada como a especificação de formato para apresentar o valor:

source: Unlike f-strings, where format specifications are applied automatically via the :func:`format` protocol, the expected behavior with t-strings is that code that *processes* the interpolation will decide how to interpret and whether to apply the format specification. As a result, :attr:`!format_spec` values in interpolations can be arbitrary strings, including those that do not conform to the :func:`format` protocol.
pt_pt: Ao contrário das f-strings, onde as especificações de formato são aplicadas automaticamente através do protocolo :func:`format`, o comportamento esperado com t-strings é que o código que *processa* a interpolação decida como interpretar e se deve aplicar a especificação de formato. Como resultado, os valores de :attr:`!format_spec` em interpolações podem ser strings arbitrárias, incluindo aquelas que não estão em conformidade com o protocolo :func:`format`.

source: Create a new :class:`!Interpolation` object from component parts.
pt_pt: Cria um novo objeto :class:`!Interpolation` a partir das suas partes componentes.

source: Parameters
pt_pt: Parâmetros

source: The evaluated, in-scope result of the interpolation.
pt_pt: O resultado da interpolação, avaliado e dentro do âmbito (scope).

source: The text of a valid Python expression, or an empty string.
pt_pt: O texto de uma expressão Python válida, ou uma string vazia.

source: The :ref:`conversion <formatstrings>` to be used, one of ``None``, ``'a'``, ``'r'``, or ``'s'``.
pt_pt: A :ref:`conversão <formatstrings>` a ser utilizada, um de ``None``, ``'a'``, ``'r'``, ou ``'s'``.

source: An optional, arbitrary string used as the :ref:`format specification <formatspec>` to present the value.
pt_pt: Uma string opcional e arbitrária usada como a :ref:`especificação de formato <formatspec>` para apresentar o valor.

source: Helper functions
pt_pt: Funções auxiliares

source: Applies formatted string literal :ref:`conversion <formatstrings-conversion>` semantics to the given object *obj*. This is frequently useful for custom template string processing logic.
pt_pt: Aplica a semântica de :ref:`conversão <formatstrings-conversion>` de literais de string formatada ao objeto *obj* fornecido. Isto é frequentemente útil para lógica personalizada de processamento de strings de modelo.

source: Three conversion flags are currently supported:
pt_pt: Três flags de conversão são atualmente suportadas:

source: ``'s'`` which calls :func:`str` on the value (like ``!s``),
pt_pt: ``'s'`` que chama :func:`str` no valor (como ``!s``),

source: ``'r'`` which calls :func:`repr` (like ``!r``), and
pt_pt: ``'r'`` que chama :func:`repr` (como ``!r``), e

source: ``'a'`` which calls :func:`ascii` (like ``!a``).
pt_pt: ``'a'`` que chama :func:`ascii` (como ``!a``).

source: If the conversion flag is ``None``, *obj* is returned unchanged.
pt_pt: Se a flag de conversão for ``None``, *obj* é devolvido inalterado.
