Repository: NyaPuma/python-docs-pt
Catalog: library/tkinter.messagebox.po
Languages: pt_pt

source: :mod:`!tkinter.messagebox` --- Tkinter message prompts
pt_pt: :mod:`!tkinter.messagebox` --- Prompts de mensagem Tkinter

source: **Source code:** :source:`Lib/tkinter/messagebox.py`
pt_pt: **Código-fonte:** :source:`Lib/tkinter/messagebox.py`

source: Create a message window with an application-specified message, an icon and a set of buttons. Each of the buttons in the message window is identified by a unique symbolic name (see the *type* options).
pt_pt: Cria uma janela de mensagem com uma mensagem especificada pela aplicação, um ícone e um conjunto de botões. Cada um dos botões na janela de mensagem é identificado por um nome simbólico único (veja as opções *type*).

source: The following options are supported:
pt_pt: As seguintes opções são suportadas:

source: Specifies the function to invoke when the user closes the dialog. The name of the button clicked by the user to close the dialog is passed as argument. This is only available on macOS.
pt_pt: Especifica a função a invocar quando o utilizador fecha o diálogo. O nome do botão clicado pelo utilizador para fechar o diálogo é passado como argumento. Isto está apenas disponível em macOS.

source: Gives the :ref:`symbolic name <messagebox-buttons>` of the default button for this message window (:data:`OK`, :data:`CANCEL`, and so on). If this option is not specified, the first button in the dialog will be made the default.
pt_pt: Fornece o :ref:`nome simbólico <messagebox-buttons>` do botão predefinido para esta janela de mensagem (:data:`OK`, :data:`CANCEL`, e assim por diante). Se esta opção não for especificada, o primeiro botão no diálogo tornar-se-á o padrão.

source: Specifies an auxiliary message to the main message given by the *message* option. The message detail will be presented beneath the main message and, where supported by the OS, in a less emphasized font than the main message.
pt_pt: Especifica uma mensagem auxiliar à mensagem principal dada pela opção *message*. O detalhe da mensagem será apresentado por baixo da mensagem principal e, onde for suportado pelo SO, numa fonte com menos ênfase do que a mensagem principal.

source: Specifies an :ref:`icon <messagebox-icons>` to display. If this option is not specified, then the :data:`INFO` icon will be displayed.
pt_pt: Especifica um :ref:`ícone <messagebox-icons>` para exibir. Se esta opção não for especificada, o ícone :data:`INFO` será exibido.

source: Specifies the message to display in this message box. The default value is an empty string.
pt_pt: Especifica a mensagem a exibir nesta caixa de mensagem. O valor padrão é uma string vazia.

source: Makes the specified window the logical parent of the message box. The message box is displayed on top of its parent window.
pt_pt: Torna a janela especificada o pai lógico da caixa de mensagem. A caixa de mensagem é exibida por cima da sua janela pai.

source: Specifies a string to display as the title of the message box. This option is ignored on macOS, where platform guidelines forbid the use of a title on this kind of dialog.
pt_pt: Especifica uma string para exibir como o título da caixa de mensagem. Esta opção é ignorada no macOS, onde as diretrizes da plataforma proíbem o uso de um título neste tipo de diálogo.

source: Arranges for a :ref:`predefined set of buttons <messagebox-types>` to be displayed.
pt_pt: Configura a exibição de um :ref:`conjunto predefinido de botões <messagebox-types>`.

source: Display a message window and wait for the user to select one of the buttons. Then return the symbolic name of the selected button. Keyword arguments can override options specified in the constructor.
pt_pt: Exibe uma janela de mensagem e aguarda que o utilizador selecione um dos botões. De seguida, retorna o nome simbólico do botão selecionado. Argumentos nomeados (keywords) podem sobrepor opções especificadas no construtor.

source: **Information message box**
pt_pt: **Caixa de mensagem de informação**

source: Creates and displays an information message box with the specified title and message.
pt_pt: Cria e exibe uma caixa de mensagem de informação com o título e mensagem especificados.

source: **Warning message boxes**
pt_pt: **Caixas de mensagem de aviso**

source: Creates and displays a warning message box with the specified title and message.
pt_pt: Cria e exibe uma caixa de mensagem de aviso com o título e mensagem especificados.

source: Creates and displays an error message box with the specified title and message.
pt_pt: Cria e exibe uma caixa de mensagem de erro com o título e mensagem especificados.

source: **Question message boxes**
pt_pt: **Caixas de mensagem de pergunta**

source: Ask a question. By default shows buttons :data:`YES` and :data:`NO`. Returns the symbolic name of the selected button.
pt_pt: Faz uma pergunta. Por padrão mostra os botões :data:`YES` e :data:`NO`. Retorna o nome simbólico do botão selecionado.

source: Ask if operation should proceed. Shows buttons :data:`OK` and :data:`CANCEL`. Returns ``True`` if the answer is ok and ``False`` otherwise.
pt_pt: Pergunta se a operação deve prosseguir. Mostra os botões :data:`OK` e :data:`CANCEL`. Retorna ``True`` se a resposta for ok e ``False`` caso contrário.

source: Ask if operation should be retried. Shows buttons :data:`RETRY` and :data:`CANCEL`. Return ``True`` if the answer is yes and ``False`` otherwise.
pt_pt: Pergunta se a operação deve ser tentada novamente. Mostra os botões :data:`RETRY` e :data:`CANCEL`. Retorna ``True`` se a resposta for sim e ``False`` caso contrário.

source: Ask a question. Shows buttons :data:`YES` and :data:`NO`. Returns ``True`` if the answer is yes and ``False`` otherwise.
pt_pt: Faz uma pergunta. Mostra os botões :data:`YES` e :data:`NO`. Retorna ``True`` se a resposta for sim e ``False`` caso contrário.

source: Ask a question. Shows buttons :data:`YES`, :data:`NO` and :data:`CANCEL`. Return ``True`` if the answer is yes, ``None`` if cancelled, and ``False`` otherwise.
pt_pt: Faz uma pergunta. Mostra os botões :data:`YES`, :data:`NO` e :data:`CANCEL`. Retorna ``True`` se a resposta for sim, ``None`` se for cancelado, e ``False`` caso contrário.

source: Symbolic names of buttons:
pt_pt: Nomes simbólicos dos botões:

source: Predefined sets of buttons:
pt_pt: Conjuntos predefinidos de botões:

source: Displays three buttons whose symbolic names are :data:`ABORT`, :data:`RETRY` and :data:`IGNORE`.
pt_pt: Exibe três botões cujos nomes simbólicos são :data:`ABORT`, :data:`RETRY` e :data:`IGNORE`.

source: Displays one button whose symbolic name is :data:`OK`.
pt_pt: Exibe um botão cujo nome simbólico é :data:`OK`.

source: Displays two buttons whose symbolic names are :data:`OK` and :data:`CANCEL`.
pt_pt: Exibe dois botões cujos nomes simbólicos são :data:`OK` e :data:`CANCEL`.

source: Displays two buttons whose symbolic names are :data:`RETRY` and :data:`CANCEL`.
pt_pt: Exibe dois botões cujos nomes simbólicos são :data:`RETRY` e :data:`CANCEL`.

source: Displays two buttons whose symbolic names are :data:`YES` and :data:`NO`.
pt_pt: Exibe dois botões cujos nomes simbólicos são :data:`YES` e :data:`NO`.

source: Displays three buttons whose symbolic names are :data:`YES`, :data:`NO` and :data:`CANCEL`.
pt_pt: Exibe três botões cujos nomes simbólicos são :data:`YES`, :data:`NO` e :data:`CANCEL`.

source: Icon images:
pt_pt: Imagens de ícone:
