Repository: NyaPuma/python-docs-pt
Catalog: library/wave.po
Languages: pt_pt

source: :mod:`!wave` --- Read and write WAV files
pt_pt: :mod:`!wave` --- Ler e escrever ficheiros WAV

source: **Source code:** :source:`Lib/wave.py`
pt_pt: **Código-fonte:** :source:`Lib/wave.py`

source: The :mod:`wave` module provides a convenient interface to the Waveform Audio "WAVE" (or "WAV") file format. Only uncompressed PCM encoded wave files are supported.
pt_pt: O módulo :mod:`wave` fornece uma interface conveniente para o formato de ficheiro de áudio Waveform "WAVE" (ou "WAV"). Apenas são suportados ficheiros wave codificados em PCM sem compressão.

source: Support for ``WAVE_FORMAT_EXTENSIBLE`` headers was added, provided that the extended format is ``KSDATAFORMAT_SUBTYPE_PCM``.
pt_pt: Foi adicionado suporte para cabeçalhos ``WAVE_FORMAT_EXTENSIBLE``, desde que o formato estendido seja ``KSDATAFORMAT_SUBTYPE_PCM``.

source: The :mod:`wave` module defines the following function and exception:
pt_pt: O módulo :mod:`wave` define a seguinte função e exceção:

source: If *file* is a string, open the file by that name, otherwise treat it as a file-like object. *mode* can be:
pt_pt: Se *file* for uma string, abre o ficheiro com esse nome, caso contrário trata-o como um objeto do tipo ficheiro (*file-like*). O *mode* pode ser:

source: Read only mode.
pt_pt: Modo de apenas leitura.

source: Write only mode.
pt_pt: Modo de apenas escrita.

source: Note that it does not allow read/write WAV files.
pt_pt: Note que não é permitida a leitura/escrita simultânea de ficheiros WAV.

source: A *mode* of ``'rb'`` returns a :class:`Wave_read` object, while a *mode* of ``'wb'`` returns a :class:`Wave_write` object. If *mode* is omitted and a file-like object is passed as *file*, ``file.mode`` is used as the default value for *mode*.
pt_pt: Um *mode* de ``'rb'`` retorna um objeto :class:`Wave_read`, enquanto um *mode* de ``'wb'`` retorna um objeto :class:`Wave_write`. Se o *mode* for omitido e for passado um objeto do tipo ficheiro como *file*, ``file.mode`` será usado como o valor predefinido para *mode*.

source: If you pass in a file-like object, the wave object will not close it when its ``close()`` method is called; it is the caller's responsibility to close the file object.
pt_pt: Se passar um objeto do tipo ficheiro, o objeto wave não o fechará quando o seu método ``close()`` for chamado; é responsabilidade do utilizador fechar o objeto de ficheiro.

source: The :func:`.open` function may be used in a :keyword:`with` statement. When the :keyword:`!with` block completes, the :meth:`Wave_read.close` or :meth:`Wave_write.close` method is called.
pt_pt: A função :func:`.open` pode ser usada numa instrução :keyword:`with`. Quando o bloco :keyword:`!with` termina, o método :meth:`Wave_read.close` ou :meth:`Wave_write.close` é chamado.

source: Added support for unseekable files.
pt_pt: Adicionado suporte para ficheiros não pesquisáveis (*unseekable*).

source: An error raised when something is impossible because it violates the WAV specification or hits an implementation deficiency.
pt_pt: Um erro lançado quando algo é impossível por violar a especificação WAV ou por encontrar uma deficiência de implementação.

source: Wave_read Objects
pt_pt: Objetos Wave_read

source: Read a WAV file.
pt_pt: Ler um ficheiro WAV.

source: Wave_read objects, as returned by :func:`.open`, have the following methods:
pt_pt: Objetos Wave_read, conforme retornados por :func:`.open`, têm os seguintes métodos:

source: Close the stream if it was opened by :mod:`wave`, and make the instance unusable. This is called automatically on object collection.
pt_pt: Fecha o fluxo se este tiver sido aberto pelo :mod:`wave`, e torna a instância inutilizável. Isto é chamado automaticamente na recolha do objeto.

source: Returns number of audio channels (``1`` for mono, ``2`` for stereo).
pt_pt: Retorna o número de canais de áudio (``1`` para mono, ``2`` para estéreo).

source: Returns sample width in bytes.
pt_pt: Retorna a largura da amostra (*sample width*) em bytes.

source: Returns sampling frequency.
pt_pt: Retorna a frequência de amostragem.

source: Returns number of audio frames.
pt_pt: Retorna o número de tramas (*frames*) de áudio.

source: Returns compression type (``'NONE'`` is the only supported type).
pt_pt: Retorna o tipo de compressão (``'NONE'`` é o único tipo suportado).

source: Human-readable version of :meth:`getcomptype`. Usually ``'not compressed'`` parallels ``'NONE'``.
pt_pt: Versão legível para humanos de :meth:`getcomptype`. Geralmente ``'not compressed'`` corresponde a ``'NONE'``.

source: Returns a :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, equivalent to output of the ``get*()`` methods.
pt_pt: Retorna um :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, equivalente à saída dos métodos ``get*()``.

source: Reads and returns at most *n* frames of audio, as a :class:`bytes` object.
pt_pt: Lê e retorna no máximo *n* tramas de áudio, como um objeto :class:`bytes`.

source: Rewind the file pointer to the beginning of the audio stream.
pt_pt: Rebobina o ponteiro do ficheiro para o início do fluxo de áudio.

source: The following two methods are defined for compatibility with the old :mod:`!aifc` module, and don't do anything interesting.
pt_pt: Os dois métodos seguintes são definidos para compatibilidade com o antigo módulo :mod:`!aifc`, e não fazem nada de interessante.

source: Returns ``None``.
pt_pt: Retorna ``None``.

source: The method only existed for compatibility with the :mod:`!aifc` module which has been removed in Python 3.13.
pt_pt: O método apenas existia para compatibilidade com o módulo :mod:`!aifc` que foi removido no Python 3.13.

source: Raise an error.
pt_pt: Lança um erro.

source: The following two methods define a term "position" which is compatible between them, and is otherwise implementation dependent.
pt_pt: Os dois métodos seguintes definem um termo "posição" que é compatível entre eles, sendo de resto dependente da implementação.

source: Set the file pointer to the specified position.
pt_pt: Define o ponteiro do ficheiro para a posição especificada.

source: Return current file pointer position.
pt_pt: Retorna a posição atual do ponteiro do ficheiro.

source: Wave_write Objects
pt_pt: Objetos Wave_write

source: Write a WAV file.
pt_pt: Escrever um ficheiro WAV.

source: Wave_write objects, as returned by :func:`.open`.
pt_pt: Objetos Wave_write, conforme retornados por :func:`.open`.

source: For seekable output streams, the ``wave`` header will automatically be updated to reflect the number of frames actually written. For unseekable streams, the *nframes* value must be accurate when the first frame data is written. An accurate *nframes* value can be achieved either by calling :meth:`setnframes` or :meth:`setparams` with the number of frames that will be written before :meth:`close` is called and then using :meth:`writeframesraw` to write the frame data, or by calling :meth:`writeframes` with all of the frame data to be written. In the latter case :meth:`writeframes` will calculate the number of frames in the data and set *nframes* accordingly before writing the frame data.
pt_pt: Para fluxos de saída pesquisáveis (*seekable*), o cabeçalho ``wave`` será automaticamente atualizado para refletir o número de tramas realmente escritas. Para fluxos não pesquisáveis, o valor *nframes* deve ser preciso quando os primeiros dados da trama são escritos. Um valor de *nframes* preciso pode ser obtido chamando :meth:`setnframes` ou :meth:`setparams` com o número de tramas que serão escritas antes de :meth:`close` ser chamado e usando depois :meth:`writeframesraw` para escrever os dados, ou chamando :meth:`writeframes` com todos os dados a serem escritos. Neste último caso, :meth:`writeframes` calculará o número de tramas nos dados e definirá *nframes* adequadamente antes de escrever os dados.

source: Wave_write objects have the following methods:
pt_pt: Objetos Wave_write têm os seguintes métodos:

source: Make sure *nframes* is correct, and close the file if it was opened by :mod:`wave`. This method is called upon object collection. It will raise an exception if the output stream is not seekable and *nframes* does not match the number of frames actually written.
pt_pt: Garante que *nframes* está correto e fecha o ficheiro se este tiver sido aberto pelo :mod:`wave`. Este método é chamado na recolha do objeto. Lançará uma exceção se o fluxo de saída não for pesquisável e *nframes* não corresponder ao número de tramas realmente escritas.

source: Set the number of channels.
pt_pt: Define o número de canais.

source: Set the sample width to *n* bytes.
pt_pt: Define a largura da amostra para *n* bytes.

source: Set the frame rate to *n*.
pt_pt: Define a taxa de tramas (*frame rate*) para *n*.

source: A non-integral input to this method is rounded to the nearest integer.
pt_pt: Uma entrada não integral para este método é arredondada para o inteiro mais próximo.

source: Set the number of frames to *n*. This will be changed later if the number of frames actually written is different (this update attempt will raise an error if the output stream is not seekable).
pt_pt: Define o número de tramas para *n*. Isto será alterado mais tarde se o número de tramas realmente escritas for diferente (esta tentativa de atualização lançará um erro se o fluxo de saída não for pesquisável).

source: Set the compression type and description. At the moment, only compression type ``NONE`` is supported, meaning no compression.
pt_pt: Define o tipo de compressão e a descrição. De momento, apenas o tipo de compressão ``NONE`` é suportado, o que significa sem compressão.

source: The *tuple* should be ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, with values valid for the ``set*()`` methods. Sets all parameters.
pt_pt: O *tuple* deve ser ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, com valores válidos para os métodos ``set*()``. Define todos os parâmetros.

source: Return current position in the file, with the same disclaimer for the :meth:`Wave_read.tell` and :meth:`Wave_read.setpos` methods.
pt_pt: Retorna a posição atual no ficheiro, com a mesma ressalva dos métodos :meth:`Wave_read.tell` e :meth:`Wave_read.setpos`.

source: Write audio frames, without correcting *nframes*.
pt_pt: Escreve tramas de áudio, sem corrigir *nframes*.

source: Any :term:`bytes-like object` is now accepted.
pt_pt: Qualquer :term:`objeto tipo bytes` é agora aceite.

source: Write audio frames and make sure *nframes* is correct. It will raise an error if the output stream is not seekable and the total number of frames that have been written after *data* has been written does not match the previously set value for *nframes*.
pt_pt: Escreve tramas de áudio e garante que *nframes* está correto. Lançará um erro se o fluxo de saída não for pesquisável e o número total de tramas escritas após a escrita de *data* não corresponder ao valor definido anteriormente para *nframes*.

source: Note that it is invalid to set any parameters after calling :meth:`writeframes` or :meth:`writeframesraw`, and any attempt to do so will raise :exc:`wave.Error`.
pt_pt: Note que é inválido definir quaisquer parâmetros após chamar :meth:`writeframes` ou :meth:`writeframesraw`, e qualquer tentativa de o fazer lançará :exc:`wave.Error`.
