Repository: NyaPuma/python-docs-pt
Catalog: library/xml.dom.minidom.po
Languages: pt_pt

source: :mod:`!xml.dom.minidom` --- Minimal DOM implementation
pt_pt: :mod:`!xml.dom.minidom` --- Implementação mínima de DOM

source: **Source code:** :source:`Lib/xml/dom/minidom.py`
pt_pt: **Código-fonte:** :source:`Lib/xml/dom/minidom.py`

source: If you need to parse untrusted or unauthenticated data, see :ref:`xml-security`.
pt_pt: Se precisar de analisar dados não confiáveis ou não autenticados, consulte :ref:`xml-security`.

source: The :func:`parse` function can take either a filename or an open file object.
pt_pt: A função :func:`parse` pode receber um nome de ficheiro ou um objeto de ficheiro aberto.

source: Return a :class:`Document` from the given input. *filename_or_file* may be either a file name, or a file-like object. *parser*, if given, must be a SAX2 parser object. This function will change the document handler of the parser and activate namespace support; other parser configuration (like setting an entity resolver) must have been done in advance.
pt_pt: Retorna um :class:`Document` a partir da entrada fornecida. *filename_or_file* pode ser um nome de ficheiro ou um objeto do tipo ficheiro (*file-like*). *parser*, se fornecido, deve ser um objeto analisador SAX2. Esta função irá alterar o gestor de documentos do analisador e ativar o suporte a espaços de nomes (namespaces); outras configurações do analisador (como definir um resolutor de entidades) devem ter sido feitas previamente.

source: If you have XML in a string, you can use the :func:`parseString` function instead:
pt_pt: Se tiver XML numa string, pode usar a função :func:`parseString` em vez disso:

source: Return a :class:`Document` that represents the *string*. This method creates an :class:`io.StringIO` object for the string and passes that on to :func:`parse`.
pt_pt: Retorna um :class:`Document` que representa a *string*. Este método cria um objeto :class:`io.StringIO` para a string e passa-o para a função :func:`parse`.

source: Both functions return a :class:`Document` object representing the content of the document.
pt_pt: Ambas as funções retornam um objeto :class:`Document` que representa o conteúdo do documento.

source: What the :func:`parse` and :func:`parseString` functions do is connect an XML parser with a "DOM builder" that can accept parse events from any SAX parser and convert them into a DOM tree. The name of the functions are perhaps misleading, but are easy to grasp when learning the interfaces. The parsing of the document will be completed before these functions return; it's simply that these functions do not provide a parser implementation themselves.
pt_pt: O que as funções :func:`parse` e :func:`parseString` fazem é ligar um analisador XML a um "construtor DOM" que pode aceitar eventos de análise de qualquer analisador SAX e convertê-los numa árvore DOM. O nome das funções pode ser enganador, mas são fáceis de entender ao aprender as interfaces. A análise do documento será concluída antes de estas funções retornarem; simplesmente estas funções não fornecem elas próprias uma implementação de analisador.

source: Once you have a DOM document object, you can access the parts of your XML document through its properties and methods. These properties are defined in the DOM specification. The main property of the document object is the :attr:`documentElement` property. It gives you the main element in the XML document: the one that holds all others. Here is an example program::
pt_pt: Assim que tiver um objeto de documento DOM, pode aceder às partes do seu documento XML através das suas propriedades e métodos. Estas propriedades estão definidas na especificação DOM. A principal propriedade do objeto de documento é a :attr:`documentElement`. Ela fornece o elemento principal no documento XML: aquele que contém todos os outros. Aqui está um exemplo::

source: `Document Object Model (DOM) Level 1 Specification <https://www.w3.org/TR/REC-DOM-Level-1/>`_
pt_pt: `Especificação do Modelo de Objetos de Documento (DOM) Nível 1 <https://www.w3.org/TR/REC-DOM-Level-1/>`_

source: DOM Objects
pt_pt: Objetos DOM

source: Break internal references within the DOM so that it will be garbage collected on versions of Python without cyclic GC. Even when cyclic GC is available, using this can make large amounts of memory available sooner, so calling this on DOM objects as soon as they are no longer needed is good practice. This only needs to be called on the :class:`Document` object, but may be called on child nodes to discard children of that node.
pt_pt: Quebra as referências internas dentro do DOM para que este seja recolhido pelo coletor de lixo em versões do Python sem GC cíclico. Mesmo quando o GC cíclico está disponível, usar isto pode disponibilizar grandes quantidades de memória mais cedo, por isso chamar isto em objetos DOM assim que não forem necessários é uma boa prática. Isto só precisa de ser chamado no objeto :class:`Document`, mas pode ser chamado em nós filhos para descartar os filhos desse nó.

source: You can avoid calling this method explicitly by using the :keyword:`with` statement. The following code will automatically unlink *dom* when the :keyword:`!with` block is exited::
pt_pt: Pode evitar chamar este método explicitamente usando a instrução :keyword:`with`. O código seguinte irá automaticamente desligar (*unlink*) o *dom* quando o bloco :keyword:`!with` terminar::

source: Write XML to the writer object. The writer receives texts but not bytes as input, it should have a :meth:`write` method which matches that of the file object interface. The *indent* parameter is the indentation of the current node. The *addindent* parameter is the incremental indentation to use for subnodes of the current one. The *newl* parameter specifies the string to use to terminate newlines.
pt_pt: Escreve o XML para o objeto *writer*. O *writer* recebe texto mas não bytes como entrada, devendo possuir um método :meth:`write` que corresponda à interface de objeto de ficheiro. O parâmetro *indent* é a indentação do nó atual. O parâmetro *addindent* é a indentação incremental a usar para os sub-nós do atual. O parâmetro *newl* especifica a string a usar para terminar as quebras de linha.

source: For the :class:`Document` node, an additional keyword argument *encoding* can be used to specify the encoding field of the XML header.
pt_pt: Para o nó :class:`Document`, um argumento de palavra-chave adicional *encoding* pode ser usado para especificar o campo de codificação do cabeçalho XML.

source: Similarly, explicitly stating the *standalone* argument causes the standalone document declarations to be added to the prologue of the XML document. If the value is set to ``True``, ``standalone="yes"`` is added, otherwise it is set to ``"no"``. Not stating the argument will omit the declaration from the document.
pt_pt: Da mesma forma, declarar explicitamente o argumento *standalone* faz com que as declarações de documento autónomo sejam adicionadas ao prólogo do documento XML. Se o valor for definido como ``True``, ``standalone="yes"`` é adicionado, caso contrário é definido como ``"no"``. Não declarar o argumento omitirá a declaração do documento.

source: The :meth:`writexml` method now preserves the attribute order specified by the user.
pt_pt: O método :meth:`writexml` agora preserva a ordem dos atributos especificada pelo utilizador.

source: The *standalone* parameter was added.
pt_pt: O parâmetro *standalone* foi adicionado.

source: Return a string or byte string containing the XML represented by the DOM node.
pt_pt: Retorna uma string ou uma string de bytes contendo o XML representado pelo nó DOM.

source: With an explicit *encoding* [1]_ argument, the result is a byte string in the specified encoding. With no *encoding* argument, the result is a Unicode string, and the XML declaration in the resulting string does not specify an encoding. Encoding this string in an encoding other than UTF-8 is likely incorrect, since UTF-8 is the default encoding of XML.
pt_pt: Com um argumento *encoding* [1]_ explícito, o resultado é uma string de bytes na codificação especificada. Sem o argumento *encoding*, o resultado é uma string Unicode, e a declaração XML na string resultante não especifica uma codificação. Codificar esta string numa codificação diferente de UTF-8 será provavelmente incorreto, uma vez que o UTF-8 é a codificação padrão do XML.

source: The *standalone* argument behaves exactly as in :meth:`writexml`.
pt_pt: O argumento *standalone* comporta-se exatamente como em :meth:`writexml`.

source: The :meth:`toxml` method now preserves the attribute order specified by the user.
pt_pt: O método :meth:`toxml` agora preserva a ordem dos atributos especificada pelo utilizador.

source: Return a pretty-printed version of the document. *indent* specifies the indentation string and defaults to a tabulator; *newl* specifies the string emitted at the end of each line and defaults to ``\n``.
pt_pt: Retorna uma versão do documento com formatação visual (*pretty-printed*). *indent* especifica a string de indentação e assume por defeito um tabulador; *newl* especifica a string emitida ao fim de cada linha e assume por defeito ``\n``.

source: The *encoding* argument behaves like the corresponding argument of :meth:`toxml`.
pt_pt: O argumento *encoding* comporta-se como o argumento correspondente de :meth:`toxml`.

source: The :meth:`toprettyxml` method now preserves the attribute order specified by the user.
pt_pt: O método :meth:`toprettyxml` agora preserva a ordem dos atributos especificada pelo utilizador.

source: DOM Example
pt_pt: Exemplo de DOM

source: This example program is a fairly realistic example of a simple program. In this particular case, we do not take much advantage of the flexibility of the DOM.
pt_pt: Este programa de exemplo é um caso bastante realista de um programa simples. Neste caso particular, não tiramos grande partido da flexibilidade do DOM.

source: minidom and the DOM standard
pt_pt: minidom e o padrão DOM

source: Usage of the DOM interface in Python is straight-forward. The following mapping rules apply:
pt_pt: A utilização da interface DOM em Python é direta. Aplicam-se as seguintes regras de mapeamento:

source: Interfaces are accessed through instance objects. Applications should not instantiate the classes themselves; they should use the creator functions available on the :class:`Document` object. Derived interfaces support all operations (and attributes) from the base interfaces, plus any new operations.
pt_pt: As interfaces são acedidas através de objetos de instância. As aplicações não devem instanciar as classes por si mesmas; devem usar as funções de criação disponíveis no objeto :class:`Document`. As interfaces derivadas suportam todas as operações (e atributos) das interfaces base, mais quaisquer operações novas.

source: Operations are used as methods. Since the DOM uses only :keyword:`in` parameters, the arguments are passed in normal order (from left to right). There are no optional arguments. ``void`` operations return ``None``.
pt_pt: As operações são usadas como métodos. Como o DOM usa apenas parâmetros :keyword:`in`, os argumentos são passados na ordem normal (da esquerda para a direita). Não existem argumentos opcionais. Operações ``void`` retornam ``None``.

source: IDL attributes map to instance attributes. For compatibility with the OMG IDL language mapping for Python, an attribute ``foo`` can also be accessed through accessor methods :meth:`_get_foo` and :meth:`_set_foo`. ``readonly`` attributes must not be changed; this is not enforced at runtime.
pt_pt: Atributos IDL mapeiam para atributos de instância. Para compatibilidade com o mapeamento de linguagem OMG IDL para Python, um atributo ``foo`` também pode ser acedido através de métodos de acesso :meth:`_get_foo` e :meth:`_set_foo`. Atributos ``readonly`` não devem ser alterados; isto não é forçado em tempo de execução.

source: The types ``short int``, ``unsigned int``, ``unsigned long long``, and ``boolean`` all map to Python integer objects.
pt_pt: Os tipos ``short int``, ``unsigned int``, ``unsigned long long`` e ``boolean`` mapeiam todos para objetos inteiros de Python.

source: ``const`` declarations map to variables in their respective scope (e.g. ``xml.dom.minidom.Node.PROCESSING_INSTRUCTION_NODE``); they must not be changed.
pt_pt: Declarações ``const`` mapeiam para variáveis no seu respetivo âmbito (ex: ``xml.dom.minidom.Node.PROCESSING_INSTRUCTION_NODE``); não devem ser alteradas.

source: :class:`NodeList` objects are implemented using Python's built-in list type. These objects provide the interface defined in the DOM specification, but with earlier versions of Python they do not support the official API. They are, however, much more "Pythonic" than the interface defined in the W3C recommendations.
pt_pt: Objetos :class:`NodeList` são implementados usando o tipo de lista integrado do Python. Estes objetos fornecem a interface definida na especificação DOM, mas com versões anteriores do Python eles não suportavam a API oficial. No entanto, são muito mais "Pythonic" do que a interface definida nas recomendações do W3C.

source: Most of these reflect information in the XML document that is not of general utility to most DOM users.
pt_pt: A maioria destas reflete informação no documento XML que não tem utilidade geral para a maioria dos utilizadores de DOM.

source: Footnotes
pt_pt: Notas de rodapé

source: The encoding name included in the XML output should conform to the appropriate standards. For example, "UTF-8" is valid, but "UTF8" is not valid in an XML document's declaration, even though Python accepts it as an encoding name. See https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl and https://www.iana.org/assignments/character-sets/character-sets.xhtml.
pt_pt: O nome da codificação incluído na saída XML deve estar em conformidade com as normas apropriadas. Por exemplo, "UTF-8" é válido, mas "UTF8" não é válido numa declaração de documento XML, mesmo que o Python o aceite como um nome de codificação. Consulte https://www.w3.org/TR/2006/REC-xml11-20060816/#NT-EncodingDecl e https://www.iana.org/assignments/character-sets/character-sets.xhtml.
