Repository: NyaPuma/python-docs-pt
Catalog: using/unix.po
Languages: pt_pt

source: Using Python on Unix platforms
pt_pt: Utilizar o Python em plataformas Unix

source: Getting and installing the latest version of Python
pt_pt: Obter e instalar a versão mais recente do Python

source: On Linux
pt_pt: Em Linux

source: Python comes preinstalled on most Linux distributions, and is available as a package on all others. However there are certain features you might want to use that are not available on your distro's package. You can compile the latest version of Python from source.
pt_pt: O Python vem pré-instalado na maioria das distribuições Linux e está disponível como um pacote em todas as outras. No entanto, existem certas funcionalidades que pode querer utilizar e que não estão disponíveis no pacote da sua distribuição. Pode compilar a versão mais recente do Python a partir do código-fonte.

source: In the event that the latest version of Python doesn't come preinstalled and isn't in the repositories as well, you can make packages for your own distro. Have a look at the following links:
pt_pt: No caso de a versão mais recente do Python não vir pré-instalada e não estar também nos repositórios, pode criar pacotes para a sua própria distribuição. Dê uma vista de olhos nos seguintes links:

source: https://www.debian.org/doc/manuals/maint-guide/first.en.html
pt_pt: https://www.debian.org/doc/manuals/maint-guide/first.pt.html

source: for Debian users
pt_pt: para utilizadores Debian

source: for OpenSuse users
pt_pt: para utilizadores OpenSuse

source: for Fedora users
pt_pt: para utilizadores Fedora

source: for Slackware users
pt_pt: para utilizadores Slackware

source: Installing IDLE
pt_pt: Instalar o IDLE

source: In some cases, IDLE might not be included in your Python installation.
pt_pt: Em alguns casos, o IDLE pode não estar incluído na sua instalação do Python.

source: For Debian and Ubuntu users::
pt_pt: Para utilizadores Debian e Ubuntu::

source: For Fedora, RHEL, and CentOS users::
pt_pt: Para utilizadores Fedora, RHEL e CentOS::

source: For SUSE and OpenSUSE users::
pt_pt: Para utilizadores SUSE e OpenSUSE::

source: For Alpine Linux users::
pt_pt: Para utilizadores Alpine Linux::

source: On FreeBSD and OpenBSD
pt_pt: Em FreeBSD e OpenBSD

source: FreeBSD users, to add the package use::
pt_pt: Utilizadores FreeBSD, para adicionar o pacote utilizem::

source: OpenBSD users, to add the package use::
pt_pt: Utilizadores OpenBSD, para adicionar o pacote utilizem::

source: For example i386 users get the 2.5.1 version of Python using::
pt_pt: Por exemplo, utilizadores i386 obtêm a versão 2.5.1 do Python utilizando::

source: Building Python
pt_pt: Compilar o Python

source: If you want to contribute to CPython, refer to the `devguide <https://devguide.python.org/getting-started/setup-building/>`_, which includes build instructions and other tips on setting up environment.
pt_pt: Se pretender contribuir para o CPython, consulte o `devguide <https://devguide.python.org/getting-started/setup-building/>`_, que inclui instruções de compilação e outras dicas sobre a configuração do ambiente.

source: If you want to compile CPython yourself, first thing you should do is get the `source <https://www.python.org/downloads/source/>`_. You can download either the latest release's source or grab a fresh `clone <https://devguide.python.org/setup/#get-the-source-code>`_. You will also need to install the :ref:`build requirements <build-requirements>`.
pt_pt: Se quiser compilar o CPython você mesmo, a primeira coisa que deve fazer é obter o `código-fonte <https://www.python.org/downloads/source/>`_. Pode descarregar o código-fonte da última versão ou obter um `clone <https://devguide.python.org/setup/#get-the-source-code>`_ recente. Também precisará de instalar os :ref:`requisitos de compilação <build-requirements>`.

source: The build process consists of the usual commands::
pt_pt: O processo de compilação consiste nos comandos habituais::

source: :ref:`Configuration options <configure-options>` and caveats for specific Unix platforms are extensively documented in the :source:`README.rst` file in the root of the Python source tree.
pt_pt: As :ref:`opções de configuração <configure-options>` e avisos para plataformas Unix específicas estão extensamente documentados no ficheiro :source:`README.rst` na raiz da árvore de diretórios do código-fonte do Python.

source: ``make install`` can overwrite or masquerade the :file:`python3` binary. ``make altinstall`` is therefore recommended instead of ``make install`` since it only installs :file:`{exec_prefix}/bin/python{version}`.
pt_pt: ``make install`` pode sobrescrever ou mascarar o binário :file:`python3`. O comando ``make altinstall`` é, portanto, recomendado em vez de ``make install``, uma vez que apenas instala :file:`{exec_prefix}/bin/python{version}`.

source: Python-related paths and files
pt_pt: Caminhos e ficheiros relacionados com o Python

source: These are subject to difference depending on local installation conventions; :option:`prefix <--prefix>` and :option:`exec_prefix <--exec-prefix>` are installation-dependent and should be interpreted as for GNU software; they may be the same.
pt_pt: Estes estão sujeitos a diferenças dependendo das convenções de instalação locais; :option:`prefix <--prefix>` e :option:`exec_prefix <--exec-prefix>` dependem da instalação e devem ser interpretados como em software GNU; podem ser o mesmo.

source: For example, on most Linux systems, the default for both is :file:`/usr`.
pt_pt: Por exemplo, na maioria dos sistemas Linux, o valor por omissão para ambos é :file:`/usr`.

source: File/directory
pt_pt: Ficheiro/diretório

source: Meaning
pt_pt: Significado

source: Recommended location of the interpreter.
pt_pt: Localização recomendada do intérprete.

source: Recommended locations of the directories containing the standard modules.
pt_pt: Localizações recomendadas dos diretórios que contêm os módulos padrão.

source: Recommended locations of the directories containing the include files needed for developing Python extensions and embedding the interpreter.
pt_pt: Localizações recomendadas dos diretórios que contêm os ficheiros de inclusão (*include*) necessários para desenvolver extensões Python e incorporar o intérprete.

source: Miscellaneous
pt_pt: Diversos

source: To easily use Python scripts on Unix, you need to make them executable, e.g. with
pt_pt: Para utilizar facilmente scripts Python em Unix, precisa de os tornar executáveis, por exemplo, com

source: and put an appropriate Shebang line at the top of the script. A good choice is usually ::
pt_pt: e colocar uma linha Shebang apropriada no topo do script. Uma boa escolha é normalmente ::

source: which searches for the Python interpreter in the whole :envvar:`PATH`. However, some Unices may not have the :program:`env` command, so you may need to hardcode ``/usr/bin/python3`` as the interpreter path.
pt_pt: que procura o intérprete Python em todo o :envvar:`PATH`. No entanto, alguns Unix podem não ter o comando :program:`env`, pelo que poderá ser necessário codificar rigidamente (*hardcode*) ``/usr/bin/python3`` como o caminho do intérprete.

source: To use shell commands in your Python scripts, look at the :mod:`subprocess` module.
pt_pt: Para utilizar comandos da shell nos seus scripts Python, consulte o módulo :mod:`subprocess`.

source: Custom OpenSSL
pt_pt: OpenSSL Personalizado

source: To use your vendor's OpenSSL configuration and system trust store, locate the directory with ``openssl.cnf`` file or symlink in ``/etc``. On most distribution the file is either in ``/etc/ssl`` or ``/etc/pki/tls``. The directory should also contain a ``cert.pem`` file and/or a ``certs`` directory.
pt_pt: Para utilizar a configuração de OpenSSL do seu fornecedor e o repositório de confiança do sistema, localize o diretório com o ficheiro ``openssl.cnf`` ou o link simbólico em ``/etc``. Na maioria das distribuições, o ficheiro encontra-se em ``/etc/ssl`` ou ``/etc/pki/tls``. O diretório também deve conter um ficheiro ``cert.pem`` e/ou um diretório ``certs``.

source: Download, build, and install OpenSSL. Make sure you use ``install_sw`` and not ``install``. The ``install_sw`` target does not override ``openssl.cnf``.
pt_pt: Descarregue, compile e instale o OpenSSL. Certifique-se de que utiliza o alvo ``install_sw`` em vez de ``install``. O alvo ``install_sw`` não sobrescreve o ficheiro ``openssl.cnf``.

source: Build Python with custom OpenSSL (see the configure ``--with-openssl`` and ``--with-openssl-rpath`` options)
pt_pt: Compile o Python com o OpenSSL personalizado (veja as opções do configure ``--with-openssl`` e ``--with-openssl-rpath``)

source: Patch releases of OpenSSL have a backwards compatible ABI. You don't need to recompile Python to update OpenSSL. It's sufficient to replace the custom OpenSSL installation with a newer version.
pt_pt: As versões de correção (*patch releases*) do OpenSSL possuem uma ABI retrocompatível. Não precisa de recompilar o Python para atualizar o OpenSSL. Basta substituir a instalação personalizada do OpenSSL por uma versão mais recente.
