Repository: NyaPuma/python-docs-pt
Catalog: howto/argparse.po
Languages: pt_pt

source: import argparse parser = argparse.ArgumentParser() parser.add_argument("square", type=int, help="display a square of a given number") parser.add_argument("-v", "--verbosity", type=int, choices=[0, 1, 2], help="increase output verbosity") args = parser.parse_args() answer = args.square**2 if args.verbosity == 2: print(f"the square of {args.square} equals {answer}") elif args.verbosity == 1: print(f"{args.square}^2 == {answer}") else: print(answer)
pt_pt: import argparse parser = argparse.ArgumentParser() parser.add_argument("square", type=int, help="mostra o quadrado de um número dado") parser.add_argument("-v", "--verbosity", type=int, choices=[0, 1, 2], help="aumenta a verbosidade da saída") args = parser.parse_args() answer = args.square**2 if args.verbosity == 2: print(f"o quadrado de {args.square} é igual a {answer}") elif args.verbosity == 1: print(f"{args.square}^2 == {answer}") else: print(answer)

source: $ python prog.py 4 -v 3 usage: prog.py [-h] [-v {0,1,2}] square prog.py: error: argument -v/--verbosity: invalid choice: 3 (choose from 0, 1, 2) $ python prog.py 4 -h usage: prog.py [-h] [-v {0,1,2}] square positional arguments: square display a square of a given number options: -h, --help show this help message and exit -v, --verbosity {0,1,2} increase output verbosity
pt_pt: $ python prog.py 4 -v 3 uso: prog.py [-h] [-v {0,1,2}] square prog.py: erro: argumento -v/--verbosity: escolha inválida: 3 (escolha entre 0, 1, 2) $ python prog.py 4 -h uso: prog.py [-h] [-v {0,1,2}] square argumentos posicionais: square mostra o quadrado de um número dado opções: -h, --help mostra esta mensagem de ajuda e sai -v, --verbosity {0,1,2} aumenta a verbosidade da saída

source: Note that the change also reflects both in the error message as well as the help string.
pt_pt: Note que a alteração também se reflete tanto na mensagem de erro como na string de ajuda.

source: Now, let's use a different approach of playing with verbosity, which is pretty common. It also matches the way the CPython executable handles its own verbosity argument (check the output of ``python --help``)::
pt_pt: Agora, vamos usar uma abordagem diferente para lidar com a verbosidade, que é bastante comum. Também corresponde à forma como o executável CPython trata o seu próprio argumento de verbosidade (verifique a saída de ``python --help``):

source: import argparse parser = argparse.ArgumentParser() parser.add_argument("square", type=int, help="display the square of a given number") parser.add_argument("-v", "--verbosity", action="count", help="increase output verbosity") args = parser.parse_args() answer = args.square**2 if args.verbosity == 2: print(f"the square of {args.square} equals {answer}") elif args.verbosity == 1: print(f"{args.square}^2 == {answer}") else: print(answer)
pt_pt: import argparse parser = argparse.ArgumentParser() parser.add_argument("square", type=int, help="mostra o quadrado de um número dado") parser.add_argument("-v", "--verbosity", action="count", help="aumenta a verbosidade da saída") args = parser.parse_args() answer = args.square**2 if args.verbosity == 2: print(f"o quadrado de {args.square} é igual a {answer}") elif args.verbosity == 1: print(f"{args.square}^2 == {answer}") else: print(answer)

source: We have introduced another action, "count", to count the number of occurrences of specific options.
pt_pt: Introduzimos outra ação, "count", para contar o número de ocorrências de opções específicas.

source: $ python prog.py 4 16 $ python prog.py 4 -v 4^2 == 16 $ python prog.py 4 -vv the square of 4 equals 16 $ python prog.py 4 --verbosity --verbosity the square of 4 equals 16 $ python prog.py 4 -v 1 usage: prog.py [-h] [-v] square prog.py: error: unrecognized arguments: 1 $ python prog.py 4 -h usage: prog.py [-h] [-v] square positional arguments: square display a square of a given number options: -h, --help show this help message and exit -v, --verbosity increase output verbosity $ python prog.py 4 -vvv 16
pt_pt: $ python prog.py 4 16 $ python prog.py 4 -v 4^2 == 16 $ python prog.py 4 -vv o quadrado de 4 é igual a 16 $ python prog.py 4 --verbosity --verbosity o quadrado de 4 é igual a 16 $ python prog.py 4 -v 1 uso: prog.py [-h] [-v] square prog.py: erro: argumentos não reconhecidos: 1 $ python prog.py 4 -h uso: prog.py [-h] [-v] square argumentos posicionais: square mostra o quadrado de um número dado opções: -h, --help mostra esta mensagem de ajuda e sai -v, --verbosity aumenta a verbosidade da saída $ python prog.py 4 -vvv 16

source: Yes, it's now more of a flag (similar to ``action="store_true"``) in the previous version of our script. That should explain the complaint.
pt_pt: Sim, agora é mais uma flag (semelhante a ``action="store_true"``) na versão anterior do nosso script. Isso deve explicar a reclamação.

source: It also behaves similar to "store_true" action.
pt_pt: Também se comporta de forma semelhante à ação "store_true".

source: Now here's a demonstration of what the "count" action gives. You've probably seen this sort of usage before.
pt_pt: Aqui está uma demonstração do que a ação "count" oferece. Provavelmente já viu este tipo de uso antes.

source: And if you don't specify the ``-v`` flag, that flag is considered to have ``None`` value.
pt_pt: E se não especificar a flag ``-v``, essa flag é considerada como tendo o valor ``None``.

source: As should be expected, specifying the long form of the flag, we should get the same output.
pt_pt: Como seria de esperar, ao especificar a forma longa da flag, devemos obter a mesma saída.

source: Sadly, our help output isn't very informative on the new ability our script has acquired, but that can always be fixed by improving the documentation for our script (e.g. via the ``help`` keyword argument).
pt_pt: Infelizmente, a nossa saída de ajuda não é muito informativa sobre a nova capacidade que o nosso script adquiriu, mas isso pode sempre ser corrigido melhorando a documentação do nosso script (por exemplo, através do argumento ``help``).

source: That last output exposes a bug in our program.
pt_pt: A última saída expõe um bug no nosso programa.

source: Let's fix::
pt_pt: Vamos corrigir:

source: import argparse parser = argparse.ArgumentParser() parser.add_argument("square", type=int, help="display a square of a given number") parser.add_argument("-v", "--verbosity", action="count", help="increase output verbosity") args = parser.parse_args() answer = args.square**2 # bugfix: replace == with >= if args.verbosity >= 2: print(f"the square of {args.square} equals {answer}") elif args.verbosity >= 1: print(f"{args.square}^2 == {answer}") else: print(answer)
pt_pt: import argparse parser = argparse.ArgumentParser() parser.add_argument("square", type=int, help="mostra o quadrado de um número dado") parser.add_argument("-v", "--verbosity", action="count", help="aumenta a verbosidade da saída") args = parser.parse_args() answer = args.square**2 # correção: substituir == por >= if args.verbosity >= 2: print(f"o quadrado de {args.square} é igual a {answer}") elif args.verbosity >= 1: print(f"{args.square}^2 == {answer}") else: print(answer)

source: And this is what it gives:
pt_pt: E isto é o que produz:

source: $ python prog.py 4 -vvv the square of 4 equals 16 $ python prog.py 4 -vvvv the square of 4 equals 16 $ python prog.py 4 Traceback (most recent call last): File "prog.py", line 11, in <module> if args.verbosity >= 2: TypeError: '>=' not supported between instances of 'NoneType' and 'int'
pt_pt: $ python prog.py 4 -vvv o quadrado de 4 é igual a 16 $ python prog.py 4 -vvvv o quadrado de 4 é igual a 16 $ python prog.py 4 Traceback (most recent call last): File "prog.py", line 11, in <module> if args.verbosity >= 2: TypeError: '>=' não é suportado entre instâncias de 'NoneType' e 'int'

source: First output went well, and fixes the bug we had before. That is, we want any value >= 2 to be as verbose as possible.
pt_pt: A primeira saída correu bem e corrige o bug que tínhamos antes. Ou seja, queremos que qualquer valor >= 2 seja o mais verboso possível.

source: Third output not so good.
pt_pt: A terceira saída não está tão boa.

source: Let's fix that bug::
pt_pt: Vamos corrigir esse bug:

source: import argparse parser = argparse.ArgumentParser() parser.add_argument("square", type=int, help="display a square of a given number") parser.add_argument("-v", "--verbosity", action="count", default=0, help="increase output verbosity") args = parser.parse_args() answer = args.square**2 if args.verbosity >= 2: print(f"the square of {args.square} equals {answer}") elif args.verbosity >= 1: print(f"{args.square}^2 == {answer}") else: print(answer)
pt_pt: import argparse parser = argparse.ArgumentParser() parser.add_argument("square", type=int, help="mostra o quadrado de um número dado") parser.add_argument("-v", "--verbosity", action="count", default=0, help="aumenta a verbosidade da saída") args = parser.parse_args() answer = args.square**2 if args.verbosity >= 2: print(f"o quadrado de {args.square} é igual a {answer}") elif args.verbosity >= 1: print(f"{args.square}^2 == {answer}") else: print(answer)

source: We've just introduced yet another keyword, ``default``. We've set it to ``0`` in order to make it comparable to the other int values. Remember that by default, if an optional argument isn't specified, it gets the ``None`` value, and that cannot be compared to an int value (hence the :exc:`TypeError` exception).
pt_pt: Acabámos de introduzir mais uma palavra-chave, ``default``. Definimo-la para ``0`` para que seja comparável a outros valores inteiros. Lembre-se de que, por predefinição, se um argumento opcional não for especificado, recebe o valor ``None``, e isso não pode ser comparado a um valor inteiro (daí a exceção :exc:`TypeError`).

source: And:
pt_pt: E:

source: You can go quite far just with what we've learned so far, and we have only scratched the surface. The :mod:`argparse` module is very powerful, and we'll explore a bit more of it before we end this tutorial.
pt_pt: Pode ir bastante longe apenas com o que aprendemos até agora, e só arranhamos a superfície. O módulo :mod:`argparse` é muito poderoso, e vamos explorar um pouco mais antes de terminar este tutorial.

source: Getting a little more advanced
pt_pt: Avançando um pouco mais

source: What if we wanted to expand our tiny program to perform other powers, not just squares::
pt_pt: E se quiséssemos expandir o nosso pequeno programa para realizar outras potências, não apenas quadrados:

source: import argparse parser = argparse.ArgumentParser() parser.add_argument("x", type=int, help="the base") parser.add_argument("y", type=int, help="the exponent") parser.add_argument("-v", "--verbosity", action="count", default=0) args = parser.parse_args() answer = args.x**args.y if args.verbosity >= 2: print(f"{args.x} to the power {args.y} equals {answer}") elif args.verbosity >= 1: print(f"{args.x}^{args.y} == {answer}") else: print(answer)
pt_pt: import argparse parser = argparse.ArgumentParser() parser.add_argument("x", type=int, help="a base") parser.add_argument("y", type=int, help="o expoente") parser.add_argument("-v", "--verbosity", action="count", default=0) args = parser.parse_args() answer = args.x**args.y if args.verbosity >= 2: print(f"{args.x} elevado a {args.y} é igual a {answer}") elif args.verbosity >= 1: print(f"{args.x}^{args.y} == {answer}") else: print(answer)

source: Output:
pt_pt: Saída:

source: $ python prog.py usage: prog.py [-h] [-v] x y prog.py: error: the following arguments are required: x, y $ python prog.py -h usage: prog.py [-h] [-v] x y positional arguments: x the base y the exponent options: -h, --help show this help message and exit -v, --verbosity $ python prog.py 4 2 -v 4^2 == 16
pt_pt: $ python prog.py uso: prog.py [-h] [-v] x y prog.py: erro: os seguintes argumentos são obrigatórios: x, y $ python prog.py -h uso: prog.py [-h] [-v] x y argumentos posicionais: x a base y o expoente opções: -h, --help mostra esta mensagem de ajuda e sai -v, --verbosity $ python prog.py 4 2 -v 4^2 == 16

source: Notice that so far we've been using verbosity level to *change* the text that gets displayed. The following example instead uses verbosity level to display *more* text instead::
pt_pt: Note que até agora temos usado o nível de verbosidade para *alterar* o texto que é exibido. O exemplo seguinte usa o nível de verbosidade para exibir *mais* texto:

source: import argparse parser = argparse.ArgumentParser() parser.add_argument("x", type=int, help="the base") parser.add_argument("y", type=int, help="the exponent") parser.add_argument("-v", "--verbosity", action="count", default=0) args = parser.parse_args() answer = args.x**args.y if args.verbosity >= 2: print(f"Running '{__file__}'") if args.verbosity >= 1: print(f"{args.x}^{args.y} == ", end="") print(answer)
pt_pt: import argparse parser = argparse.ArgumentParser() parser.add_argument("x", type=int, help="a base") parser.add_argument("y", type=int, help="o expoente") parser.add_argument("-v", "--verbosity", action="count", default=0) args = parser.parse_args() answer = args.x**args.y if args.verbosity >= 2: print(f"A executar '{__file__}'") if args.verbosity >= 1: print(f"{args.x}^{args.y} == ", end="") print(answer)

source: $ python prog.py 4 2 16 $ python prog.py 4 2 -v 4^2 == 16 $ python prog.py 4 2 -vv Running 'prog.py' 4^2 == 16
pt_pt: $ python prog.py 4 2 16 $ python prog.py 4 2 -v 4^2 == 16 $ python prog.py 4 2 -vv A executar 'prog.py' 4^2 == 16

source: Specifying ambiguous arguments
pt_pt: Especificar argumentos ambíguos

source: When there is ambiguity in deciding whether an argument is positional or for an argument, ``--`` can be used to tell :meth:`~ArgumentParser.parse_args` that everything after that is a positional argument::
pt_pt: Quando há ambiguidade ao decidir se um argumento é posicional ou não, ``--`` pode ser usado para indicar ao :meth:`~ArgumentParser.parse_args` que tudo o que vem depois é um argumento posicional:

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-n', nargs='+') >>> parser.add_argument('args', nargs='*') >>> # ambiguous, so parse_args assumes it's an option >>> parser.parse_args(['-f']) usage: PROG [-h] [-n N [N ...]] [args ...] PROG: error: unrecognized arguments: -f >>> parser.parse_args(['--', '-f']) Namespace(args=['-f'], n=None) >>> # ambiguous, so the -n option greedily accepts arguments >>> parser.parse_args(['-n', '1', '2', '3']) Namespace(args=[], n=['1', '2', '3']) >>> parser.parse_args(['-n', '1', '--', '2', '3']) Namespace(args=['2', '3'], n=['1'])
pt_pt: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-n', nargs='+') >>> parser.add_argument('args', nargs='*') >>> # ambíguo, então parse_args assume que é uma opção >>> parser.parse_args(['-f']) uso: PROG [-h] [-n N [N ...]] [args ...] PROG: erro: argumentos não reconhecidos: -f >>> parser.parse_args(['--', '-f']) Namespace(args=['-f'], n=None) >>> # ambíguo, então a opção -n aceita avidamente argumentos >>> parser.parse_args(['-n', '1', '2', '3']) Namespace(args=[], n=['1', '2', '3']) >>> parser.parse_args(['-n', '1', '--', '2', '3']) Namespace(args=['2', '3'], n=['1'])

source: Conflicting options
pt_pt: Opções conflitantes

source: So far, we have been working with two methods of an :class:`argparse.ArgumentParser` instance. Let's introduce a third one, :meth:`~ArgumentParser.add_mutually_exclusive_group`. It allows for us to specify options that conflict with each other. Let's also change the rest of the program so that the new functionality makes more sense: we'll introduce the ``--quiet`` option, which will be the opposite of the ``--verbose`` one::
pt_pt: Até agora, temos vindo a trabalhar com dois métodos de uma instância :class:`argparse.ArgumentParser`. Vamos introduzir um terceiro, :meth:`~ArgumentParser.add_mutually_exclusive_group`. Ele permite-nos especificar opções que conflitam entre si. Vamos também alterar o resto do programa para que a nova funcionalidade faça mais sentido: vamos introduzir a opção ``--quiet``, que será o oposto da ``--verbose``:

source: import argparse parser = argparse.ArgumentParser() group = parser.add_mutually_exclusive_group() group.add_argument("-v", "--verbose", action="store_true") group.add_argument("-q", "--quiet", action="store_true") parser.add_argument("x", type=int, help="the base") parser.add_argument("y", type=int, help="the exponent") args = parser.parse_args() answer = args.x**args.y if args.quiet: print(answer) elif args.verbose: print(f"{args.x} to the power {args.y} equals {answer}") else: print(f"{args.x}^{args.y} == {answer}")
pt_pt: import argparse parser = argparse.ArgumentParser() group = parser.add_mutually_exclusive_group() group.add_argument("-v", "--verbose", action="store_true") group.add_argument("-q", "--quiet", action="store_true") parser.add_argument("x", type=int, help="a base") parser.add_argument("y", type=int, help="o expoente") args = parser.parse_args() answer = args.x**args.y if args.quiet: print(answer) elif args.verbose: print(f"{args.x} elevado a {args.y} é igual a {answer}") else: print(f"{args.x}^{args.y} == {answer}")

source: Our program is now simpler, and we've lost some functionality for the sake of demonstration. Anyways, here's the output:
pt_pt: O nosso programa é agora mais simples, e perdemos alguma funcionalidade em prol da demonstração. De qualquer forma, aqui está a saída:

source: $ python prog.py 4 2 4^2 == 16 $ python prog.py 4 2 -q 16 $ python prog.py 4 2 -v 4 to the power 2 equals 16 $ python prog.py 4 2 -vq usage: prog.py [-h] [-v | -q] x y prog.py: error: argument -q/--quiet: not allowed with argument -v/--verbose $ python prog.py 4 2 -v --quiet usage: prog.py [-h] [-v | -q] x y prog.py: error: argument -q/--quiet: not allowed with argument -v/--verbose
pt_pt: $ python prog.py 4 2 4^2 == 16 $ python prog.py 4 2 -q 16 $ python prog.py 4 2 -v 4 elevado a 2 é igual a 16 $ python prog.py 4 2 -vq uso: prog.py [-h] [-v | -q] x y prog.py: erro: argumento -q/--quiet: não permitido com argumento -v/--verbose $ python prog.py 4 2 -v --quiet uso: prog.py [-h] [-v | -q] x y prog.py: erro: argumento -q/--quiet: não permitido com argumento -v/--verbose

source: That should be easy to follow. I've added that last output so you can see the sort of flexibility you get, i.e. mixing long form options with short form ones.
pt_pt: Isso deve ser fácil de seguir. Adicionei essa última saída para que possa ver o tipo de flexibilidade que obtém, ou seja, misturar opções de forma longa com formas curtas.

source: Before we conclude, you probably want to tell your users the main purpose of your program, just in case they don't know::
pt_pt: Antes de concluirmos, provavelmente quer informar os seus utilizadores sobre o objetivo principal do seu programa, caso não saibam:

source: import argparse parser = argparse.ArgumentParser(description="calculate X to the power of Y") group = parser.add_mutually_exclusive_group() group.add_argument("-v", "--verbose", action="store_true") group.add_argument("-q", "--quiet", action="store_true") parser.add_argument("x", type=int, help="the base") parser.add_argument("y", type=int, help="the exponent") args = parser.parse_args() answer = args.x**args.y if args.quiet: print(answer) elif args.verbose: print(f"{args.x} to the power {args.y} equals {answer}") else: print(f"{args.x}^{args.y} == {answer}")
pt_pt: import argparse parser = argparse.ArgumentParser(description="calcular X elevado a Y") group = parser.add_mutually_exclusive_group() group.add_argument("-v", "--verbose", action="store_true") group.add_argument("-q", "--quiet", action="store_true") parser.add_argument("x", type=int, help="a base") parser.add_argument("y", type=int, help="o expoente") args = parser.parse_args() answer = args.x**args.y if args.quiet: print(answer) elif args.verbose: print(f"{args.x} elevado a {args.y} é igual a {answer}") else: print(f"{args.x}^{args.y} == {answer}")

source: Note that slight difference in the usage text. Note the ``[-v | -q]``, which tells us that we can either use ``-v`` or ``-q``, but not both at the same time:
pt_pt: Note a pequena diferença no texto de uso. Note o ``[-v | -q]``, que nos diz que podemos usar ``-v`` ou ``-q``, mas não ambos ao mesmo tempo:

source: $ python prog.py --help usage: prog.py [-h] [-v | -q] x y calculate X to the power of Y positional arguments: x the base y the exponent options: -h, --help show this help message and exit -v, --verbose -q, --quiet
pt_pt: $ python prog.py --help uso: prog.py [-h] [-v | -q] x y calcular X elevado a Y argumentos posicionais: x a base y o expoente opções: -h, --help mostra esta mensagem de ajuda e sai -v, --verbose -q, --quiet

source: How to translate the argparse output
pt_pt: Como traduzir a saída do argparse

source: The output of the :mod:`argparse` module such as its help text and error messages are all made translatable using the :mod:`gettext` module. This allows applications to easily localize messages produced by :mod:`argparse`. See also :ref:`i18n-howto`.
pt_pt: A saída do módulo :mod:`argparse`, como o seu texto de ajuda e mensagens de erro, são todas tornadas traduzíveis usando o módulo :mod:`gettext`. Isto permite que as aplicações localizem facilmente as mensagens produzidas pelo :mod:`argparse`. Veja também :ref:`i18n-howto`.

source: For instance, in this :mod:`argparse` output:
pt_pt: Por exemplo, nesta saída do :mod:`argparse`:

source: The strings ``usage:``, ``positional arguments:``, ``options:`` and ``show this help message and exit`` are all translatable.
pt_pt: As strings ``usage:``, ``positional arguments:``, ``options:`` e ``show this help message and exit`` são todas traduzíveis.

source: In order to translate these strings, they must first be extracted into a ``.po`` file. For example, using `Babel <https://babel.pocoo.org/>`__, run this command:
pt_pt: Para traduzir estas strings, elas devem primeiro ser extraídas para um ficheiro ``.po``. Por exemplo, usando o `Babel <https://babel.pocoo.org/>`__, execute este comando:

source: This command will extract all translatable strings from the :mod:`argparse` module and output them into a file named ``messages.po``. This command assumes that your Python installation is in ``/usr/lib``.
pt_pt: Este comando extrairá todas as strings traduzíveis do módulo :mod:`argparse` e colocá-las-á num ficheiro chamado ``messages.po``. Este comando assume que a sua instalação do Python está em ``/usr/lib``.

source: You can find out the location of the :mod:`argparse` module on your system using this script::
pt_pt: Pode descobrir a localização do módulo :mod:`argparse` no seu sistema usando este script:

source: Once the messages in the ``.po`` file are translated and the translations are installed using :mod:`gettext`, :mod:`argparse` will be able to display the translated messages.
pt_pt: Uma vez que as mensagens no ficheiro ``.po`` estejam traduzidas e as traduções estejam instaladas usando o :mod:`gettext`, o :mod:`argparse` será capaz de exibir as mensagens traduzidas.

source: To translate your own strings in the :mod:`argparse` output, use :mod:`gettext`.
pt_pt: Para traduzir as suas próprias strings na saída do :mod:`argparse`, use :mod:`gettext`.

source: Custom type converters
pt_pt: Conversores de tipo personalizados
