Repository: NyaPuma/python-docs-pt
Catalog: howto/argparse.po
Languages: pt_pt

source: Argparse Tutorial
pt_pt: Tutorial do Argparse

source: author
pt_pt: autor

source: This tutorial is intended to be a gentle introduction to :mod:`argparse`, the recommended command-line parsing module in the Python standard library.
pt_pt: Este tutorial destina-se a ser uma introdução suave ao :mod:`argparse`, o módulo recomendado para análise de linha de comandos na biblioteca padrão do Python.

source: The standard library includes two other libraries directly related to command-line parameter processing: the lower level :mod:`optparse` module (which may require more code to configure for a given application, but also allows an application to request behaviors that ``argparse`` doesn't support), and the very low level :mod:`getopt` (which specifically serves as an equivalent to the :c:func:`!getopt` family of functions available to C programmers). While neither of those modules is covered directly in this guide, many of the core concepts in ``argparse`` first originated in ``optparse``, so some aspects of this tutorial will also be relevant to ``optparse`` users.
pt_pt: A biblioteca padrão inclui outros dois módulos diretamente relacionados ao processamento de parâmetros de linha de comando: o módulo de nível inferior :mod:`optparse` (que pode exigir mais código para configurar uma aplicação, mas também permite que uma aplicação solicite comportamentos que o ``argparse`` não suporta) e o módulo de nível muito baixo :mod:`getopt` (que serve especificamente como equivalente à família de funções :c:func:`!getopt` disponíveis para programadores C). Embora nenhum desses módulos seja abordado diretamente neste guia, muitos dos conceitos principais do ``argparse`` tiveram origem no ``optparse``, por isso alguns aspetos deste tutorial também serão relevantes para os utilizadores do ``optparse``.

source: Concepts
pt_pt: Conceitos

source: Let's show the sort of functionality that we are going to explore in this introductory tutorial by making use of the :command:`ls` command:
pt_pt: Vamos mostrar o tipo de funcionalidade que vamos explorar neste tutorial introdutório utilizando o comando :command:`ls`:

source: $ ls cpython devguide prog.py pypy rm-unused-function.patch $ ls pypy ctypes_configure demo dotviewer include lib_pypy lib-python ... $ ls -l total 20 drwxr-xr-x 19 wena wena 4096 Feb 18 18:51 cpython drwxr-xr-x 4 wena wena 4096 Feb 8 12:04 devguide -rwxr-xr-x 1 wena wena 535 Feb 19 00:05 prog.py drwxr-xr-x 14 wena wena 4096 Feb 7 00:59 pypy -rw-r--r-- 1 wena wena 741 Feb 18 01:01 rm-unused-function.patch $ ls --help Usage: ls [OPTION]... [FILE]... List information about the FILEs (the current directory by default). Sort entries alphabetically if none of -cftuvSUX nor --sort is specified. ...
pt_pt: $ ls cpython devguide prog.py pypy rm-unused-function.patch $ ls pypy ctypes_configure demo dotviewer include lib_pypy lib-python ... $ ls -l total 20 drwxr-xr-x 19 wena wena 4096 Fev 18 18:51 cpython drwxr-xr-x 4 wena wena 4096 Fev 8 12:04 devguide -rwxr-xr-x 1 wena wena 535 Fev 19 00:05 prog.py drwxr-xr-x 14 wena wena 4096 Fev 7 00:59 pypy -rw-r--r-- 1 wena wena 741 Fev 18 01:01 rm-unused-function.patch $ ls --help Uso: ls [OPÇÃO]... [FICHEIRO]... Lista informações sobre os FICHEIROS (o diretório atual por predefinição). Ordena as entradas alfabéticamente se nenhuma das opções -cftuvSUX ou --sort for especificada. ...

source: A few concepts we can learn from the four commands:
pt_pt: Alguns conceitos que podemos aprender com os quatro comandos:

source: The :command:`ls` command is useful when run without any options at all. It defaults to displaying the contents of the current directory.
pt_pt: O comando :command:`ls` é útil quando executado sem quaisquer opções. Por predefinição, mostra o conteúdo do diretório atual.

source: If we want beyond what it provides by default, we tell it a bit more. In this case, we want it to display a different directory, ``pypy``. What we did is specify what is known as a positional argument. It's named so because the program should know what to do with the value, solely based on where it appears on the command line. This concept is more relevant to a command like :command:`cp`, whose most basic usage is ``cp SRC DEST``. The first position is *what you want copied,* and the second position is *where you want it copied to*.
pt_pt: Se quisermos ir além do que é fornecido por predefinição, temos de lhe dizer um pouco mais. Neste caso, queremos que mostre um diretório diferente, ``pypy``. O que fizemos foi especificar o que é conhecido como um argumento posicional. É chamado assim porque o programa deve saber o que fazer com o valor, com base apenas na posição em que aparece na linha de comandos. Este conceito é mais relevante para um comando como :command:`cp`, cujo uso mais básico é ``cp SRC DEST``. A primeira posição é *o que quer copiar*, e a segunda posição é *para onde quer copiar*.

source: Now, say we want to change behaviour of the program. In our example, we display more info for each file instead of just showing the file names. The ``-l`` in that case is known as an optional argument.
pt_pt: Agora, digamos que queremos alterar o comportamento do programa. No nosso exemplo, mostramos mais informações para cada ficheiro em vez de apenas mostrar os nomes dos ficheiros. O ``-l`` nesse caso é conhecido como um argumento opcional.

source: That's a snippet of the help text. It's very useful in that you can come across a program you have never used before, and can figure out how it works simply by reading its help text.
pt_pt: Este é um trecho do texto de ajuda. É muito útil, pois pode encontrar um programa que nunca usou antes e descobrir como funciona simplesmente lendo o seu texto de ajuda.

source: The basics
pt_pt: O básico

source: Let us start with a very simple example which does (almost) nothing::
pt_pt: Vamos começar com um exemplo muito simples que faz (quase) nada:

source: Following is a result of running the code:
pt_pt: Segue-se o resultado da execução do código:

source: $ python prog.py $ python prog.py --help usage: prog.py [-h] options: -h, --help show this help message and exit $ python prog.py --verbose usage: prog.py [-h] prog.py: error: unrecognized arguments: --verbose $ python prog.py foo usage: prog.py [-h] prog.py: error: unrecognized arguments: foo
pt_pt: $ python prog.py $ python prog.py --help uso: prog.py [-h] opções: -h, --help mostra esta mensagem de ajuda e sai $ python prog.py --verbose uso: prog.py [-h] prog.py: erro: argumentos não reconhecidos: --verbose $ python prog.py foo uso: prog.py [-h] prog.py: erro: argumentos não reconhecidos: foo

source: Here is what is happening:
pt_pt: Aqui está o que está a acontecer:

source: Running the script without any options results in nothing displayed to stdout. Not so useful.
pt_pt: Executar o script sem quaisquer opções não resulta em nada exibido no stdout. Não é muito útil.

source: The second one starts to display the usefulness of the :mod:`argparse` module. We have done almost nothing, but already we get a nice help message.
pt_pt: O segundo começa a mostrar a utilidade do módulo :mod:`argparse`. Não fizemos quase nada, mas já obtemos uma mensagem de ajuda agradável.

source: The ``--help`` option, which can also be shortened to ``-h``, is the only option we get for free (i.e. no need to specify it). Specifying anything else results in an error. But even then, we do get a useful usage message, also for free.
pt_pt: A opção ``--help``, que também pode ser abreviada para ``-h``, é a única opção que obtemos gratuitamente (ou seja, não é necessário especificá-la). Especificar qualquer outra coisa resulta em um erro. Mas mesmo assim, obtemos uma mensagem de uso útil, também gratuitamente.

source: Introducing Positional arguments
pt_pt: Introdução aos argumentos posicionais

source: An example::
pt_pt: Um exemplo:

source: And running the code:
pt_pt: E executando o código:

source: $ python prog.py usage: prog.py [-h] echo prog.py: error: the following arguments are required: echo $ python prog.py --help usage: prog.py [-h] echo positional arguments: echo options: -h, --help show this help message and exit $ python prog.py foo foo
pt_pt: $ python prog.py uso: prog.py [-h] echo prog.py: erro: os seguintes argumentos são obrigatórios: echo $ python prog.py --help uso: prog.py [-h] echo argumentos posicionais: echo opções: -h, --help mostra esta mensagem de ajuda e sai $ python prog.py foo foo

source: Here is what's happening:
pt_pt: Aqui está o que está a acontecer:

source: We've added the :meth:`~ArgumentParser.add_argument` method, which is what we use to specify which command-line options the program is willing to accept. In this case, I've named it ``echo`` so that it's in line with its function.
pt_pt: Adicionámos o método :meth:`~ArgumentParser.add_argument`, que usamos para especificar quais as opções de linha de comandos que o programa está disposto a aceitar. Neste caso, chamei-lhe ``echo`` para que esteja em linha com a sua função.

source: Calling our program now requires us to specify an option.
pt_pt: Chamar o nosso programa agora exige que especifiquemos uma opção.

source: The :meth:`~ArgumentParser.parse_args` method actually returns some data from the options specified, in this case, ``echo``.
pt_pt: O método :meth:`~ArgumentParser.parse_args` devolve alguns dados das opções especificadas, neste caso, ``echo``.

source: The variable is some form of 'magic' that :mod:`argparse` performs for free (i.e. no need to specify which variable that value is stored in). You will also notice that its name matches the string argument given to the method, ``echo``.
pt_pt: A variável é uma forma de 'magia' que o :mod:`argparse` realiza gratuitamente (ou seja, não é necessário especificar em que variável esse valor é armazenado). Também notará que o seu nome corresponde ao argumento de string dado ao método, ``echo``.

source: Note however that, although the help display looks nice and all, it currently is not as helpful as it can be. For example we see that we got ``echo`` as a positional argument, but we don't know what it does, other than by guessing or by reading the source code. So, let's make it a bit more useful::
pt_pt: Note, no entanto, que embora a exibição da ajuda pareça agradável, atualmente não é tão útil quanto poderia ser. Por exemplo, vemos que obtivemos ``echo`` como um argumento posicional, mas não sabemos o que faz, a não ser por adivinhação ou lendo o código-fonte. Vamos torná-lo um pouco mais útil:

source: import argparse parser = argparse.ArgumentParser() parser.add_argument("echo", help="echo the string you use here") args = parser.parse_args() print(args.echo)
pt_pt: import argparse parser = argparse.ArgumentParser() parser.add_argument("echo", help="repete a string que usar aqui") args = parser.parse_args() print(args.echo)

source: And we get:
pt_pt: E obtemos:

source: $ python prog.py -h usage: prog.py [-h] echo positional arguments: echo echo the string you use here options: -h, --help show this help message and exit
pt_pt: $ python prog.py -h uso: prog.py [-h] echo argumentos posicionais: echo repete a string que usar aqui opções: -h, --help mostra esta mensagem de ajuda e sai

source: Now, how about doing something even more useful::
pt_pt: Agora, que tal fazer algo ainda mais útil:

source: import argparse parser = argparse.ArgumentParser() parser.add_argument("square", help="display a square of a given number") args = parser.parse_args() print(args.square**2)
pt_pt: import argparse parser = argparse.ArgumentParser() parser.add_argument("square", help="mostra o quadrado de um número dado") args = parser.parse_args() print(args.square**2)

source: That didn't go so well. That's because :mod:`argparse` treats the options we give it as strings, unless we tell it otherwise. So, let's tell :mod:`argparse` to treat that input as an integer::
pt_pt: Isto não correu bem. Isso acontece porque o :mod:`argparse` trata as opções que lhe damos como strings, a menos que lhe digamos o contrário. Vamos dizer ao :mod:`argparse` para tratar essa entrada como um inteiro:

source: import argparse parser = argparse.ArgumentParser() parser.add_argument("square", help="display a square of a given number", type=int) args = parser.parse_args() print(args.square**2)
pt_pt: import argparse parser = argparse.ArgumentParser() parser.add_argument("square", help="mostra o quadrado de um número dado", type=int) args = parser.parse_args() print(args.square**2)

source: $ python prog.py 4 16 $ python prog.py four usage: prog.py [-h] square prog.py: error: argument square: invalid int value: 'four'
pt_pt: $ python prog.py 4 16 $ python prog.py four uso: prog.py [-h] square prog.py: erro: argumento square: valor int inválido: 'four'

source: That went well. The program now even helpfully quits on bad illegal input before proceeding.
pt_pt: Isso correu bem. O programa agora até termina de forma útil com entrada ilegal inválida antes de continuar.

source: Introducing Optional arguments
pt_pt: Introdução aos argumentos opcionais

source: So far we have been playing with positional arguments. Let us have a look on how to add optional ones::
pt_pt: Até agora temos vindo a trabalhar com argumentos posicionais. Vamos ver como adicionar argumentos opcionais:

source: import argparse parser = argparse.ArgumentParser() parser.add_argument("--verbosity", help="increase output verbosity") args = parser.parse_args() if args.verbosity: print("verbosity turned on")
pt_pt: import argparse parser = argparse.ArgumentParser() parser.add_argument("--verbosity", help="aumenta a verbosidade da saída") args = parser.parse_args() if args.verbosity: print("verbosidade ativada")

source: And the output:
pt_pt: E a saída:

source: $ python prog.py --verbosity 1 verbosity turned on $ python prog.py $ python prog.py --help usage: prog.py [-h] [--verbosity VERBOSITY] options: -h, --help show this help message and exit --verbosity VERBOSITY increase output verbosity $ python prog.py --verbosity usage: prog.py [-h] [--verbosity VERBOSITY] prog.py: error: argument --verbosity: expected one argument
pt_pt: $ python prog.py --verbosity 1 verbosidade ativada $ python prog.py $ python prog.py --help uso: prog.py [-h] [--verbosity VERBOSITY] opções: -h, --help mostra esta mensagem de ajuda e sai --verbosity VERBOSITY aumenta a verbosidade da saída $ python prog.py --verbosity uso: prog.py [-h] [--verbosity VERBOSITY] prog.py: erro: argumento --verbosity: esperado um argumento

source: The program is written so as to display something when ``--verbosity`` is specified and display nothing when not.
pt_pt: O programa está escrito para mostrar algo quando ``--verbosity`` é especificado e não mostrar nada quando não é.

source: To show that the option is actually optional, there is no error when running the program without it. Note that by default, if an optional argument isn't used, the relevant variable, in this case ``args.verbosity``, is given ``None`` as a value, which is the reason it fails the truth test of the :keyword:`if` statement.
pt_pt: Para mostrar que a opção é realmente opcional, não há erro ao executar o programa sem ela. Note que, por predefinição, se um argumento opcional não for usado, a variável relevante, neste caso ``args.verbosity``, recebe o valor ``None``, o que é a razão pela qual falha no teste de verdade da instrução :keyword:`if`.

source: The help message is a bit different.
pt_pt: A mensagem de ajuda é um pouco diferente.

source: When using the ``--verbosity`` option, one must also specify some value, any value.
pt_pt: Ao usar a opção ``--verbosity``, deve-se também especificar algum valor, qualquer valor.

source: The above example accepts arbitrary integer values for ``--verbosity``, but for our simple program, only two values are actually useful, ``True`` or ``False``. Let's modify the code accordingly::
pt_pt: O exemplo acima aceita valores inteiros arbitrários para ``--verbosity``, mas para o nosso programa simples, apenas dois valores são realmente úteis, ``True`` ou ``False``. Vamos modificar o código de acordo:

source: import argparse parser = argparse.ArgumentParser() parser.add_argument("--verbose", help="increase output verbosity", action="store_true") args = parser.parse_args() if args.verbose: print("verbosity turned on")
pt_pt: import argparse parser = argparse.ArgumentParser() parser.add_argument("--verbose", help="aumenta a verbosidade da saída", action="store_true") args = parser.parse_args() if args.verbose: print("verbosidade ativada")

source: $ python prog.py --verbose verbosity turned on $ python prog.py --verbose 1 usage: prog.py [-h] [--verbose] prog.py: error: unrecognized arguments: 1 $ python prog.py --help usage: prog.py [-h] [--verbose] options: -h, --help show this help message and exit --verbose increase output verbosity
pt_pt: $ python prog.py --verbose verbosidade ativada $ python prog.py --verbose 1 uso: prog.py [-h] [--verbose] prog.py: erro: argumentos não reconhecidos: 1 $ python prog.py --help uso: prog.py [-h] [--verbose] opções: -h, --help mostra esta mensagem de ajuda e sai --verbose aumenta a verbosidade da saída

source: The option is now more of a flag than something that requires a value. We even changed the name of the option to match that idea. Note that we now specify a new keyword, ``action``, and give it the value ``"store_true"``. This means that, if the option is specified, assign the value ``True`` to ``args.verbose``. Not specifying it implies ``False``.
pt_pt: A opção é agora mais uma flag do que algo que requer um valor. Até mudámos o nome da opção para corresponder a essa ideia. Note que agora especificamos uma nova palavra-chave, ``action``, e damos-lhe o valor ``"store_true"``. Isto significa que, se a opção for especificada, atribui o valor ``True`` a ``args.verbose``. Não a especificar implica ``False``.

source: It complains when you specify a value, in true spirit of what flags actually are.
pt_pt: Reclama quando especifica um valor, em verdadeiro espírito do que as flags realmente são.

source: Notice the different help text.
pt_pt: Repare no texto de ajuda diferente.

source: Short options
pt_pt: Opções curtas

source: If you are familiar with command line usage, you will notice that I haven't yet touched on the topic of short versions of the options. It's quite simple::
pt_pt: Se estiver familiarizado com o uso da linha de comandos, notará que ainda não abordei o tópico das versões curtas das opções. É bastante simples:

source: import argparse parser = argparse.ArgumentParser() parser.add_argument("-v", "--verbose", help="increase output verbosity", action="store_true") args = parser.parse_args() if args.verbose: print("verbosity turned on")
pt_pt: import argparse parser = argparse.ArgumentParser() parser.add_argument("-v", "--verbose", help="aumenta a verbosidade da saída", action="store_true") args = parser.parse_args() if args.verbose: print("verbosidade ativada")

source: And here goes:
pt_pt: E aqui está:

source: $ python prog.py -v verbosity turned on $ python prog.py --help usage: prog.py [-h] [-v] options: -h, --help show this help message and exit -v, --verbose increase output verbosity
pt_pt: $ python prog.py -v verbosidade ativada $ python prog.py --help uso: prog.py [-h] [-v] opções: -h, --help mostra esta mensagem de ajuda e sai -v, --verbose aumenta a verbosidade da saída

source: Note that the new ability is also reflected in the help text.
pt_pt: Note que a nova capacidade também é refletida no texto de ajuda.

source: Combining Positional and Optional arguments
pt_pt: Combinar argumentos posicionais e opcionais

source: Our program keeps growing in complexity::
pt_pt: O nosso programa continua a crescer em complexidade:

source: import argparse parser = argparse.ArgumentParser() parser.add_argument("square", type=int, help="display a square of a given number") parser.add_argument("-v", "--verbose", action="store_true", help="increase output verbosity") args = parser.parse_args() answer = args.square**2 if args.verbose: print(f"the square of {args.square} equals {answer}") else: print(answer)
pt_pt: import argparse parser = argparse.ArgumentParser() parser.add_argument("square", type=int, help="mostra o quadrado de um número dado") parser.add_argument("-v", "--verbose", action="store_true", help="aumenta a verbosidade da saída") args = parser.parse_args() answer = args.square**2 if args.verbose: print(f"o quadrado de {args.square} é igual a {answer}") else: print(answer)

source: And now the output:
pt_pt: E agora a saída:

source: $ python prog.py usage: prog.py [-h] [-v] square prog.py: error: the following arguments are required: square $ python prog.py 4 16 $ python prog.py 4 --verbose the square of 4 equals 16 $ python prog.py --verbose 4 the square of 4 equals 16
pt_pt: $ python prog.py uso: prog.py [-h] [-v] square prog.py: erro: os seguintes argumentos são obrigatórios: square $ python prog.py 4 16 $ python prog.py 4 --verbose o quadrado de 4 é igual a 16 $ python prog.py --verbose 4 o quadrado de 4 é igual a 16

source: We've brought back a positional argument, hence the complaint.
pt_pt: Voltámos a incluir um argumento posicional, daí a reclamação.

source: Note that the order does not matter.
pt_pt: Note que a ordem não importa.

source: How about we give this program of ours back the ability to have multiple verbosity values, and actually get to use them::
pt_pt: Que tal devolvermos a este nosso programa a capacidade de ter múltiplos valores de verbosidade e realmente usá-los:

source: import argparse parser = argparse.ArgumentParser() parser.add_argument("square", type=int, help="display a square of a given number") parser.add_argument("-v", "--verbosity", type=int, help="increase output verbosity") args = parser.parse_args() answer = args.square**2 if args.verbosity == 2: print(f"the square of {args.square} equals {answer}") elif args.verbosity == 1: print(f"{args.square}^2 == {answer}") else: print(answer)
pt_pt: import argparse parser = argparse.ArgumentParser() parser.add_argument("square", type=int, help="mostra o quadrado de um número dado") parser.add_argument("-v", "--verbosity", type=int, help="aumenta a verbosidade da saída") args = parser.parse_args() answer = args.square**2 if args.verbosity == 2: print(f"o quadrado de {args.square} é igual a {answer}") elif args.verbosity == 1: print(f"{args.square}^2 == {answer}") else: print(answer)

source: $ python prog.py 4 16 $ python prog.py 4 -v usage: prog.py [-h] [-v VERBOSITY] square prog.py: error: argument -v/--verbosity: expected one argument $ python prog.py 4 -v 1 4^2 == 16 $ python prog.py 4 -v 2 the square of 4 equals 16 $ python prog.py 4 -v 3 16
pt_pt: $ python prog.py 4 16 $ python prog.py 4 -v uso: prog.py [-h] [-v VERBOSITY] square prog.py: erro: argumento -v/--verbosity: esperado um argumento $ python prog.py 4 -v 1 4^2 == 16 $ python prog.py 4 -v 2 o quadrado de 4 é igual a 16 $ python prog.py 4 -v 3 16

source: These all look good except the last one, which exposes a bug in our program. Let's fix it by restricting the values the ``--verbosity`` option can accept::
pt_pt: Todos parecem bons, exceto o último, que expõe um bug no nosso programa. Vamos corrigi-lo restringindo os valores que a opção ``--verbosity`` pode aceitar:
