Repository: NyaPuma/python-docs-pt
Catalog: howto/argparse.po
Languages: pt_pt

source: The :mod:`argparse` module allows you to specify custom type converters for your command-line arguments. This allows you to modify user input before it's stored in the :class:`argparse.Namespace`. This can be useful when you need to pre-process the input before it is used in your program.
pt_pt: O módulo :mod:`argparse` permite-lhe especificar conversores de tipo personalizados para os seus argumentos de linha de comandos. Isto permite-lhe modificar a entrada do utilizador antes de ser armazenada no :class:`argparse.Namespace`. Isto pode ser útil quando precisa de pré-processar a entrada antes de ser usada no seu programa.

source: When using a custom type converter, you can use any callable that takes a single string argument (the argument value) and returns the converted value. However, if you need to handle more complex scenarios, you can use a custom action class with the **action** parameter instead.
pt_pt: Ao usar um conversor de tipo personalizado, pode usar qualquer função que aceite um único argumento de string (o valor do argumento) e retorne o valor convertido. No entanto, se precisar de lidar com cenários mais complexos, pode usar uma classe de ação personalizada com o parâmetro **action**.

source: For example, let's say you want to handle arguments with different prefixes and process them accordingly::
pt_pt: Por exemplo, digamos que quer lidar com argumentos com diferentes prefixos e processá-los de acordo:

source: import argparse parser = argparse.ArgumentParser(prefix_chars='-+') parser.add_argument('-a', metavar='<value>', action='append', type=lambda x: ('-', x)) parser.add_argument('+a', metavar='<value>', action='append', type=lambda x: ('+', x)) args = parser.parse_args() print(args)
pt_pt: import argparse parser = argparse.ArgumentParser(prefix_chars='-+') parser.add_argument('-a', metavar='<valor>', action='append', type=lambda x: ('-', x)) parser.add_argument('+a', metavar='<valor>', action='append', type=lambda x: ('+', x)) args = parser.parse_args() print(args)

source: $ python prog.py -a value1 +a value2 Namespace(a=[('-', 'value1'), ('+', 'value2')])
pt_pt: $ python prog.py -a valor1 +a valor2 Namespace(a=[('-', 'valor1'), ('+', 'valor2')])

source: In this example, we:
pt_pt: Neste exemplo, nós:

source: Created a parser with custom prefix characters using the ``prefix_chars`` parameter.
pt_pt: Criámos um parser com caracteres de prefixo personalizados usando o parâmetro ``prefix_chars``.

source: Defined two arguments, ``-a`` and ``+a``, which used the ``type`` parameter to create custom type converters to store the value in a tuple with the prefix.
pt_pt: Definimos dois argumentos, ``-a`` e ``+a``, que usaram o parâmetro ``type`` para criar conversores de tipo personalizados para armazenar o valor num tuplo com o prefixo.

source: Without the custom type converters, the arguments would have treated the ``-a`` and ``+a`` as the same argument, which would have been undesirable. By using custom type converters, we were able to differentiate between the two arguments.
pt_pt: Sem os conversores de tipo personalizados, os argumentos teriam tratado ``-a`` e ``+a`` como o mesmo argumento, o que seria indesejável. Ao usar conversores de tipo personalizados, conseguimos diferenciar entre os dois argumentos.

source: Conclusion
pt_pt: Conclusão

source: The :mod:`argparse` module offers a lot more than shown here. Its docs are quite detailed and thorough, and full of examples. Having gone through this tutorial, you should easily digest them without feeling overwhelmed.
pt_pt: O módulo :mod:`argparse` oferece muito mais do que foi mostrado aqui. A sua documentação é bastante detalhada e completa, e cheia de exemplos. Depois de passar por este tutorial, deve conseguir assimilá-los sem se sentir sobrecarregado.
