Repository: NyaPuma/python-docs-pt
Catalog: howto/free-threading-python.po
Languages: pt_pt

source: Python support for free threading
pt_pt: Suporte do Python para free threading

source: Starting with the 3.13 release, CPython has support for a build of Python called :term:`free threading` where the :term:`global interpreter lock` (GIL) is disabled. Free-threaded execution allows for full utilization of the available processing power by running threads in parallel on available CPU cores. While not all software will benefit from this automatically, programs designed with threading in mind will run faster on multi-core hardware.
pt_pt: A partir da versão 3.13, o CPython suporta uma build do Python chamada :term:`free threading`, onde o :term:`global interpreter lock` (GIL) está desativado. A execução em free-threading permite a utilização total do poder de processamento disponível, executando threads em paralelo nos núcleos de CPU disponíveis. Embora nem todo o software beneficie disto automaticamente, programas desenhados com threading em mente correrão mais rapidamente em hardware multi-core.

source: Some third-party packages, in particular ones with an :term:`extension module`, may not be ready for use in a free-threaded build, and will re-enable the :term:`GIL`.
pt_pt: Alguns pacotes de terceiros, em particular aqueles com um :term:`módulo de extensão`, podem não estar prontos para uso numa build free-threaded, e irão reativar o :term:`GIL`.

source: This document describes the implications of free threading for Python code. See :ref:`freethreading-extensions-howto` for information on how to write C extensions that support the free-threaded build.
pt_pt: Este documento descreve as implicações do free threading para código Python. Veja :ref:`freethreading-extensions-howto` para informações sobre como escrever extensões C que suportem a build free-threaded.

source: :pep:`703` – Making the Global Interpreter Lock Optional in CPython for an overall description of free-threaded Python.
pt_pt: :pep:`703` – Tornar o Global Interpreter Lock opcional no CPython para uma descrição geral do Python free-threaded.

source: Installation
pt_pt: Instalação

source: Starting with Python 3.13, the official macOS and Windows installers optionally support installing free-threaded Python binaries. The installers are available at https://www.python.org/downloads/.
pt_pt: A partir do Python 3.13, os instaladores oficiais de macOS e Windows suportam opcionalmente a instalação de binários Python free-threaded. Os instaladores estão disponíveis em https://www.python.org/downloads/.

source: For information on other platforms, see the `Installing a Free-Threaded Python <https://py-free-threading.github.io/installing-cpython/>`_, a community-maintained installation guide for installing free-threaded Python.
pt_pt: Para informações sobre outras plataformas, veja `Installing a Free-Threaded Python <https://py-free-threading.github.io/installing-cpython/>`_, um guia de instalação mantido pela comunidade para instalar o Python free-threaded.

source: When building CPython from source, the :option:`--disable-gil` configure option should be used to build a free-threaded Python interpreter.
pt_pt: Ao compilar o CPython a partir da fonte, a opção de configuração :option:`--disable-gil` deve ser usada para criar um interpretador Python free-threaded.

source: Identifying free-threaded Python
pt_pt: Identificar o Python free-threaded

source: To check if the current interpreter supports free-threading, :option:`python -VV <-V>` and :data:`sys.version` contain "free-threading build". The new :func:`sys._is_gil_enabled` function can be used to check whether the GIL is actually disabled in the running process.
pt_pt: Para verificar se o interpretador atual suporta free-threading, o comando :option:`python -VV <-V>` e o :data:`sys.version` contêm "free-threading build". A nova função :func:`sys._is_gil_enabled` pode ser usada para verificar se o GIL está realmente desativado no processo em execução.

source: The ``sysconfig.get_config_var("Py_GIL_DISABLED")`` configuration variable can be used to determine whether the build supports free threading. If the variable is set to ``1``, then the build supports free threading. This is the recommended mechanism for decisions related to the build configuration.
pt_pt: A variável de configuração ``sysconfig.get_config_var("Py_GIL_DISABLED")`` pode ser usada para determinar se a build suporta free threading. Se a variável estiver definida como ``1``, então a build suporta free threading. Este é o mecanismo recomendado para decisões relacionadas com a configuração da build.

source: The global interpreter lock in free-threaded Python
pt_pt: O global interpreter lock no Python free-threaded

source: Free-threaded builds of CPython support optionally running with the GIL enabled at runtime using the environment variable :envvar:`PYTHON_GIL` or the command-line option :option:`-X gil`.
pt_pt: Builds free-threaded do CPython suportam opcionalmente a execução com o GIL ativado em tempo de execução usando a variável de ambiente :envvar:`PYTHON_GIL` ou a opção de linha de comando :option:`-X gil`.

source: The GIL may also automatically be enabled when importing a C-API extension module that is not explicitly marked as supporting free threading. A warning will be printed in this case.
pt_pt: O GIL também pode ser ativado automaticamente ao importar um módulo de extensão C-API que não esteja explicitamente marcado como suportando free threading. Um aviso será impresso neste caso.

source: In addition to individual package documentation, the following websites track the status of popular packages support for free threading:
pt_pt: Além da documentação individual de cada pacote, os seguintes websites acompanham o estado do suporte para free threading em pacotes populares:

source: Thread safety
pt_pt: Segurança de threads (Thread safety)

source: The free-threaded build of CPython aims to provide similar thread-safety behavior at the Python level to the default GIL-enabled build. Built-in types like :class:`dict`, :class:`list`, and :class:`set` use internal locks to protect against concurrent modifications in ways that behave similarly to the GIL. However, Python has not historically guaranteed specific behavior for concurrent modifications to these built-in types, so this should be treated as a description of the current implementation, not a guarantee of current or future behavior.
pt_pt: A build free-threaded do CPython visa fornecer um comportamento de segurança de threads semelhante, ao nível do Python, ao da build padrão com GIL ativado. Tipos incorporados como :class:`dict`, :class:`list` e :class:`set` usam bloqueios (locks) internos para proteger contra modificações concorrentes de formas que se comportam de maneira semelhante ao GIL. No entanto, o Python não garantiu historicamente um comportamento específico para modificações concorrentes nestes tipos incorporados, pelo que isto deve ser tratado como uma descrição da implementação atual, e não uma garantia de comportamento atual ou futuro.

source: It's recommended to use the :class:`threading.Lock` or other synchronization primitives instead of relying on the internal locks of built-in types, when possible.
pt_pt: Recomenda-se o uso de :class:`threading.Lock` ou outras primitivas de sincronização em vez de confiar nos bloqueios internos dos tipos incorporados, sempre que possível.

source: Known limitations
pt_pt: Limitações conhecidas

source: This section describes known limitations of the free-threaded CPython build.
pt_pt: Esta secção descreve as limitações conhecidas da build CPython free-threaded.

source: Immortalization
pt_pt: Imortalização

source: In the free-threaded build, some objects are :term:`immortal`. Immortal objects are not deallocated and have reference counts that are never modified. This is done to avoid reference count contention that would prevent efficient multi-threaded scaling.
pt_pt: Na build free-threaded, alguns objetos são :term:`imortais <immortal>`. Objetos imortais não são desalocados e têm contagens de referência que nunca são modificadas. Isto é feito para evitar contenção na contagem de referências, o que impediria o escalonamento multi-thread eficiente.

source: As of the 3.14 release, immortalization is limited to:
pt_pt: A partir da versão 3.14, a imortalização está limitada a:

source: Code constants: numeric literals, string literals, and tuple literals composed of other constants.
pt_pt: Constantes de código: literais numéricos, literais de string e literais de tuplo compostos por outras constantes.

source: Strings interned by :func:`sys.intern`.
pt_pt: Strings internadas por :func:`sys.intern`.

source: Frame objects
pt_pt: Objetos de frame

source: It is not safe to access :attr:`frame.f_locals` from a :ref:`frame <frame-objects>` object if that frame is currently executing in another thread, and doing so may crash the interpreter.
pt_pt: Não é seguro aceder a :attr:`frame.f_locals` a partir de um objeto :ref:`frame <frame-objects>` se esse frame estiver a ser executado noutra thread, e fazê-lo pode causar o encerramento inesperado (crash) do interpretador.

source: Iterators
pt_pt: Iteradores

source: It is generally not thread-safe to access the same iterator object from multiple threads concurrently, and threads may see duplicate or missing elements.
pt_pt: Geralmente não é seguro para threads aceder ao mesmo objeto iterador a partir de múltiplas threads simultaneamente; as threads podem ver elementos duplicados ou em falta.

source: Single-threaded performance
pt_pt: Performance single-threaded

source: The free-threaded build has additional overhead when executing Python code compared to the default GIL-enabled build. The amount of overhead depends on the workload and hardware. On the pyperformance benchmark suite, the average overhead ranges from about 1% on macOS aarch64 to 8% on x86-64 Linux systems.
pt_pt: A build free-threaded tem uma sobrecarga (overhead) adicional ao executar código Python em comparação com a build padrão com GIL. A quantidade dessa sobrecarga depende da carga de trabalho e do hardware. No conjunto de testes pyperformance, a sobrecarga média varia entre cerca de 1% em macOS aarch64 e 8% em sistemas Linux x86-64.

source: Behavioral changes
pt_pt: Mudanças de comportamento

source: This section describes CPython behavioural changes with the free-threaded build.
pt_pt: Esta secção descreve mudanças de comportamento do CPython com a build free-threaded.

source: Context variables
pt_pt: Variáveis de contexto

source: In the free-threaded build, the flag :data:`~sys.flags.thread_inherit_context` is set to true by default which causes threads created with :class:`threading.Thread` to start with a copy of the :class:`~contextvars.Context()` of the caller of :meth:`~threading.Thread.start`. In the default GIL-enabled build, the flag defaults to false so threads start with an empty :class:`~contextvars.Context()`.
pt_pt: Na build free-threaded, a flag :data:`~sys.flags.thread_inherit_context` é definida como true por predefinição, o que faz com que as threads criadas com :class:`threading.Thread` comecem com uma cópia do :class:`~contextvars.Context()` de quem chamou :meth:`~threading.Thread.start`. Na build padrão com GIL, a flag é false por predefinição, pelo que as threads começam com um :class:`~contextvars.Context()` vazio.

source: Warning filters
pt_pt: Filtros de avisos (warnings)

source: In the free-threaded build, the flag :data:`~sys.flags.context_aware_warnings` is set to true by default. In the default GIL-enabled build, the flag defaults to false. If the flag is true then the :class:`warnings.catch_warnings` context manager uses a context variable for warning filters. If the flag is false then :class:`~warnings.catch_warnings` modifies the global filters list, which is not thread-safe. See the :mod:`warnings` module for more details.
pt_pt: Na build free-threaded, a flag :data:`~sys.flags.context_aware_warnings` é definida como true por predefinição. Na build padrão com GIL, a flag é false por predefinição. Se a flag for true, o gestor de contexto :class:`warnings.catch_warnings` utiliza uma variável de contexto para filtros de avisos. Se a flag for false, o :class:`~warnings.catch_warnings` modifica a lista global de filtros, o que não é seguro para threads. Veja o módulo :mod:`warnings` para mais detalhes.
