Repository: NyaPuma/python-docs-pt
Catalog: howto/instrumentation.po
Languages: pt_pt

source: Instrumenting CPython with DTrace and SystemTap
pt_pt: Instrumentar o CPython com DTrace e SystemTap

source: author
pt_pt: autor

source: DTrace and SystemTap are monitoring tools, each providing a way to inspect what the processes on a computer system are doing. They both use domain-specific languages allowing a user to write scripts which:
pt_pt: O DTrace e o SystemTap são ferramentas de monitorização, fornecendo cada uma forma de inspecionar o que os processos num sistema informático estão a fazer. Ambas utilizam linguagens específicas de domínio que permitem ao utilizador escrever scripts que:

source: filter which processes are to be observed
pt_pt: filtram quais os processos a serem observados

source: gather data from the processes of interest
pt_pt: recolhem dados dos processos de interesse

source: generate reports on the data
pt_pt: geram relatórios sobre os dados

source: As of Python 3.6, CPython can be built with embedded "markers", also known as "probes", that can be observed by a DTrace or SystemTap script, making it easier to monitor what the CPython processes on a system are doing.
pt_pt: A partir do Python 3.6, o CPython pode ser compilado com "marcadores" embutidos, também conhecidos como "probes", que podem ser observados por um script DTrace ou SystemTap, facilitando a monitorização do que os processos CPython num sistema estão a fazer.

source: DTrace markers are implementation details of the CPython interpreter. No guarantees are made about probe compatibility between versions of CPython. DTrace scripts can stop working or work incorrectly without warning when changing CPython versions.
pt_pt: Os marcadores DTrace são detalhes de implementação do intérprete CPython. Não são dadas garantias sobre a compatibilidade das probes entre versões do CPython. Os scripts DTrace podem deixar de funcionar ou funcionar incorretamente sem aviso prévio ao mudar de versão do CPython.

source: Enabling the static markers
pt_pt: Ativar os marcadores estáticos

source: macOS comes with built-in support for DTrace. On Linux, in order to build CPython with the embedded markers for SystemTap, the SystemTap development tools must be installed.
pt_pt: O macOS traz suporte nativo para DTrace. No Linux, para compilar o CPython com marcadores embutidos para SystemTap, as ferramentas de desenvolvimento do SystemTap devem estar instaladas.

source: On a Linux machine, this can be done via::
pt_pt: Numa máquina Linux, isto pode ser feito através de::

source: or::
pt_pt: ou:

source: CPython must then be :option:`configured with the --with-dtrace option <--with-dtrace>`:
pt_pt: O CPython deve então ser :option:`configurado com a opção --with-dtrace <--with-dtrace>`:

source: On macOS, you can list available DTrace probes by running a Python process in the background and listing all probes made available by the Python provider::
pt_pt: No macOS, pode listar as probes DTrace disponíveis executando um processo Python em background e listando todas as probes disponibilizadas pelo provider Python::

source: On Linux, you can verify if the SystemTap static markers are present in the built binary by seeing if it contains a ".note.stapsdt" section.
pt_pt: No Linux, pode verificar se os marcadores estáticos do SystemTap estão presentes no binário compilado vendo se este contém uma secção ".note.stapsdt".

source: If you've built Python as a shared library (with the :option:`--enable-shared` configure option), you need to look instead within the shared library. For example::
pt_pt: Se compilou o Python como uma biblioteca partilhada (com a opção de configuração :option:`--enable-shared`), deve procurar dentro da biblioteca partilhada. Por exemplo::

source: Sufficiently modern readelf can print the metadata::
pt_pt: Um readelf suficientemente moderno pode imprimir os metadados::

source: The above metadata contains information for SystemTap describing how it can patch strategically placed machine code instructions to enable the tracing hooks used by a SystemTap script.
pt_pt: Os metadados acima contêm informações para o SystemTap descrevendo como este pode aplicar patches em instruções de código de máquina colocadas estrategicamente para ativar os hooks de tracing usados por um script SystemTap.

source: Static DTrace probes
pt_pt: Probes DTrace estáticas

source: The following example DTrace script can be used to show the call/return hierarchy of a Python script, only tracing within the invocation of a function called "start". In other words, import-time function invocations are not going to be listed:
pt_pt: O seguinte exemplo de script DTrace pode ser usado para mostrar a hierarquia de chamada/retorno de um script Python, rastreando apenas dentro da invocação de uma função chamada "start". Por outras palavras, as invocações de funções em tempo de importação não serão listadas:

source: It can be invoked like this::
pt_pt: Pode ser invocado desta forma::

source: The output looks like this:
pt_pt: A saída parece-se com isto:

source: Static SystemTap markers
pt_pt: Marcadores SystemTap estáticos

source: The low-level way to use the SystemTap integration is to use the static markers directly. This requires you to explicitly state the binary file containing them.
pt_pt: A forma de baixo nível de utilizar a integração com o SystemTap é usar diretamente os marcadores estáticos. Isto requer que indique explicitamente o ficheiro binário que os contém.

source: For example, this SystemTap script can be used to show the call/return hierarchy of a Python script:
pt_pt: Por exemplo, este script SystemTap pode ser usado para mostrar a hierarquia de chamada/retorno de um script Python:

source: where the columns are:
pt_pt: onde as colunas são:

source: time in microseconds since start of script
pt_pt: tempo em microssegundos desde o início do script

source: name of executable
pt_pt: nome do executável

source: PID of process
pt_pt: PID do processo

source: and the remainder indicates the call/return hierarchy as the script executes.
pt_pt: e o restante indica a hierarquia de chamada/retorno conforme o script é executado.

source: For a :option:`--enable-shared` build of CPython, the markers are contained within the libpython shared library, and the probe's dotted path needs to reflect this. For example, this line from the above example:
pt_pt: Para uma build do CPython com :option:`--enable-shared`, os marcadores estão contidos na biblioteca partilhada libpython, e o caminho pontuado da probe precisa de refletir isso. Por exemplo, esta linha do exemplo acima:

source: should instead read:
pt_pt: deveria, em vez disso, ser:

source: (assuming a :ref:`debug build <debug-build>` of CPython 3.6)
pt_pt: (assumindo uma :ref:`debug build <debug-build>` do CPython 3.6)

source: Available static markers
pt_pt: Marcadores estáticos disponíveis

source: This marker indicates that execution of a Python function has begun. It is only triggered for pure-Python (bytecode) functions.
pt_pt: Este marcador indica que a execução de uma função Python começou. Só é disparado para funções Python puras (bytecode).

source: The filename, function name, and line number are provided back to the tracing script as positional arguments, which must be accessed using ``$arg1``, ``$arg2``, ``$arg3``:
pt_pt: O nome do ficheiro, o nome da função e o número da linha são devolvidos ao script de tracing como argumentos posicionais, que devem ser acedidos usando ``$arg1``, ``$arg2``, ``$arg3``:

source: ``$arg1`` : ``(const char *)`` filename, accessible using ``user_string($arg1)``
pt_pt: ``$arg1`` : ``(const char *)`` nome do ficheiro, acedível usando ``user_string($arg1)``

source: ``$arg2`` : ``(const char *)`` function name, accessible using ``user_string($arg2)``
pt_pt: ``$arg2`` : ``(const char *)`` nome da função, acedível usando ``user_string($arg2)``

source: ``$arg3`` : ``int`` line number
pt_pt: ``$arg3`` : ``int`` número da linha

source: This marker is the converse of :c:func:`!function__entry`, and indicates that execution of a Python function has ended (either via ``return``, or via an exception). It is only triggered for pure-Python (bytecode) functions.
pt_pt: Este marcador é o inverso de :c:func:`!function__entry`, e indica que a execução de uma função Python terminou (seja via ``return`` ou via uma exceção). Só é disparado para funções Python puras (bytecode).

source: The arguments are the same as for :c:func:`!function__entry`
pt_pt: Os argumentos são os mesmos que para :c:func:`!function__entry`

source: This marker indicates a Python line is about to be executed. It is the equivalent of line-by-line tracing with a Python profiler. It is not triggered within C functions.
pt_pt: Este marcador indica que uma linha Python está prestes a ser executada. É o equivalente ao tracing linha-a-linha com um profiler Python. Não é disparado dentro de funções C.

source: The arguments are the same as for :c:func:`!function__entry`.
pt_pt: Os argumentos são os mesmos que para :c:func:`!function__entry`.

source: Fires when the Python interpreter starts a garbage collection cycle. ``arg0`` is the generation to scan, like :func:`gc.collect`.
pt_pt: Dispara quando o intérprete Python inicia um ciclo de recolha de lixo. ``arg0`` é a geração a verificar, como em :func:`gc.collect`.

source: Fires when the Python interpreter finishes a garbage collection cycle. ``arg0`` is the number of collected objects.
pt_pt: Dispara quando o intérprete Python termina um ciclo de recolha de lixo. ``arg0`` é o número de objetos recolhidos.

source: Fires before :mod:`importlib` attempts to find and load the module. ``arg0`` is the module name.
pt_pt: Dispara antes do :mod:`importlib` tentar encontrar e carregar o módulo. ``arg0`` é o nome do módulo.

source: Fires after :mod:`importlib`'s find_and_load function is called. ``arg0`` is the module name, ``arg1`` indicates if module was successfully loaded.
pt_pt: Dispara após a função find_and_load do :mod:`importlib` ser chamada. ``arg0`` é o nome do módulo, ``arg1`` indica se o módulo foi carregado com sucesso.

source: Fires when :func:`sys.audit` or :c:func:`PySys_Audit` is called. ``arg0`` is the event name as C string, ``arg1`` is a :c:type:`PyObject` pointer to a tuple object.
pt_pt: Dispara quando :func:`sys.audit` ou :c:func:`PySys_Audit` é chamado. ``arg0`` é o nome do evento como string C, ``arg1`` é um ponteiro :c:type:`PyObject` para um objeto tuplo.

source: SystemTap Tapsets
pt_pt: Tapsets SystemTap

source: The higher-level way to use the SystemTap integration is to use a "tapset": SystemTap's equivalent of a library, which hides some of the lower-level details of the static markers.
pt_pt: A forma de nível mais elevado de utilizar a integração com o SystemTap é usar um "tapset": o equivalente do SystemTap a uma biblioteca, que esconde alguns dos detalhes de nível mais baixo dos marcadores estáticos.

source: Here is a tapset file, based on a non-shared build of CPython:
pt_pt: Aqui está um ficheiro tapset, baseado numa build do CPython não partilhada:

source: If this file is installed in SystemTap's tapset directory (e.g. ``/usr/share/systemtap/tapset``), then these additional probepoints become available:
pt_pt: Se este ficheiro for instalado na diretoria de tapsets do SystemTap (ex: ``/usr/share/systemtap/tapset``), então estes probepoints adicionais ficam disponíveis:

source: This probe point indicates that execution of a Python function has begun. It is only triggered for pure-Python (bytecode) functions.
pt_pt: Este probe point indica que a execução de uma função Python começou. Só é disparado para funções Python puras (bytecode).

source: This probe point is the converse of ``python.function.return``, and indicates that execution of a Python function has ended (either via ``return``, or via an exception). It is only triggered for pure-Python (bytecode) functions.
pt_pt: Este probe point é o inverso de ``python.function.return``, e indica que a execução de uma função Python terminou (seja via ``return`` ou via uma exceção). Só é disparado para funções Python puras (bytecode).

source: Examples
pt_pt: Exemplos

source: This SystemTap script uses the tapset above to more cleanly implement the example given above of tracing the Python function-call hierarchy, without needing to directly name the static markers:
pt_pt: Este script SystemTap usa o tapset acima para implementar de forma mais limpa o exemplo dado anteriormente de rastrear a hierarquia de chamadas de função Python, sem necessitar de nomear diretamente os marcadores estáticos:

source: The following script uses the tapset above to provide a top-like view of all running CPython code, showing the top 20 most frequently entered bytecode frames, each second, across the whole system:
pt_pt: O seguinte script utiliza o tapset acima para fornecer uma vista estilo "top" de todo o código CPython em execução, mostrando as 20 frames de bytecode em que se entrou mais frequentemente, a cada segundo, em todo o sistema:
