Repository: NyaPuma/python-docs-pt
Catalog: howto/ipaddress.po
Languages: pt_pt

source: An introduction to the ipaddress module
pt_pt: Uma introdução ao módulo ipaddress

source: author
pt_pt: autor

source: Overview
pt_pt: Visão Geral

source: This document aims to provide a gentle introduction to the :mod:`ipaddress` module. It is aimed primarily at users that aren't already familiar with IP networking terminology, but may also be useful to network engineers wanting an overview of how :mod:`ipaddress` represents IP network addressing concepts.
pt_pt: Este documento visa fornecer uma introdução suave ao módulo :mod:`ipaddress`. Destina-se principalmente a utilizadores que ainda não estão familiarizados com a terminologia de redes IP, mas também pode ser útil para engenheiros de redes que pretendam uma visão geral de como o :mod:`ipaddress` representa os conceitos de endereçamento de rede IP.

source: Creating Address/Network/Interface objects
pt_pt: Criar objetos de Endereço/Rede/Interface

source: Since :mod:`ipaddress` is a module for inspecting and manipulating IP addresses, the first thing you'll want to do is create some objects. You can use :mod:`ipaddress` to create objects from strings and integers.
pt_pt: Uma vez que o :mod:`ipaddress` é um módulo para inspecionar e manipular endereços IP, a primeira coisa que desejará fazer é criar alguns objetos. Pode usar o :mod:`ipaddress` para criar objetos a partir de strings e inteiros.

source: A Note on IP Versions
pt_pt: Uma Nota sobre Versões de IP

source: For readers that aren't particularly familiar with IP addressing, it's important to know that the Internet Protocol (IP) is currently in the process of moving from version 4 of the protocol to version 6. This transition is occurring largely because version 4 of the protocol doesn't provide enough addresses to handle the needs of the whole world, especially given the increasing number of devices with direct connections to the internet.
pt_pt: Para os leitores que não estão particularmente familiarizados com endereçamento IP, é importante saber que o Protocolo de Internet (IP) está atualmente num processo de transição da versão 4 do protocolo para a versão 6. Esta transição ocorre em grande parte porque a versão 4 do protocolo não fornece endereços suficientes para lidar com as necessidades de todo o mundo, especialmente dado o número crescente de dispositivos com ligações diretas à internet.

source: Explaining the details of the differences between the two versions of the protocol is beyond the scope of this introduction, but readers need to at least be aware that these two versions exist, and it will sometimes be necessary to force the use of one version or the other.
pt_pt: Explicar os detalhes das diferenças entre as duas versões do protocolo está fora do âmbito desta introdução, mas os leitores precisam de estar, pelo menos, conscientes de que estas duas versões existem, e por vezes será necessário forçar o uso de uma versão ou da outra.

source: IP Host Addresses
pt_pt: Endereços de Host IP

source: Addresses, often referred to as "host addresses" are the most basic unit when working with IP addressing. The simplest way to create addresses is to use the :func:`ipaddress.ip_address` factory function, which automatically determines whether to create an IPv4 or IPv6 address based on the passed in value:
pt_pt: Endereços, frequentemente referidos como "endereços de host", são a unidade mais básica ao trabalhar com endereçamento IP. A forma mais simples de criar endereços é usar a função factory :func:`ipaddress.ip_address`, que determina automaticamente se deve criar um endereço IPv4 ou IPv6 com base no valor passado:

source: Addresses can also be created directly from integers. Values that will fit within 32 bits are assumed to be IPv4 addresses::
pt_pt: Os endereços também podem ser criados diretamente a partir de inteiros. Assume-se que valores que caibam em 32 bits são endereços IPv4::

source: To force the use of IPv4 or IPv6 addresses, the relevant classes can be invoked directly. This is particularly useful to force creation of IPv6 addresses for small integers::
pt_pt: Para forçar o uso de endereços IPv4 ou IPv6, as classes relevantes podem ser invocadas diretamente. Isto é particularmente útil para forçar a criação de endereços IPv6 para inteiros pequenos::

source: Defining Networks
pt_pt: Definir Redes

source: Host addresses are usually grouped together into IP networks, so :mod:`ipaddress` provides a way to create, inspect and manipulate network definitions. IP network objects are constructed from strings that define the range of host addresses that are part of that network. The simplest form for that information is a "network address/network prefix" pair, where the prefix defines the number of leading bits that are compared to determine whether or not an address is part of the network and the network address defines the expected value of those bits.
pt_pt: Os endereços de host são normalmente agrupados em redes IP, pelo que o :mod:`ipaddress` fornece uma forma de criar, inspecionar e manipular definições de rede. Os objetos de rede IP são construídos a partir de strings que definem o intervalo de endereços de host que fazem parte dessa rede. A forma mais simples para essa informação é um par "endereço de rede/prefixo de rede", onde o prefixo define o número de bits iniciais que são comparados para determinar se um endereço faz parte ou não da rede, e o endereço de rede define o valor esperado desses bits.

source: As for addresses, a factory function is provided that determines the correct IP version automatically::
pt_pt: Tal como para os endereços, é fornecida uma função factory que determina a versão de IP correta automaticamente::

source: Network objects cannot have any host bits set. The practical effect of this is that ``192.0.2.1/24`` does not describe a network. Such definitions are referred to as interface objects since the ip-on-a-network notation is commonly used to describe network interfaces of a computer on a given network and are described further in the next section.
pt_pt: Os objetos de rede não podem ter nenhuns bits de host definidos. O efeito prático disto é que ``192.0.2.1/24`` não descreve uma rede. Tais definições são referidas como objetos de interface, uma vez que a notação ip-numa-rede é comummente usada para descrever interfaces de rede de um computador numa determinada rede, e são descritos adiante na próxima secção.

source: By default, attempting to create a network object with host bits set will result in :exc:`ValueError` being raised. To request that the additional bits instead be coerced to zero, the flag ``strict=False`` can be passed to the constructor::
pt_pt: Por padrão, tentar criar um objeto de rede com bits de host definidos resultará no levantamento de um :exc:`ValueError`. Para solicitar que os bits adicionais sejam, em vez disso, coagidos a zero, a flag ``strict=False`` pode ser passada ao construtor::

source: While the string form offers significantly more flexibility, networks can also be defined with integers, just like host addresses. In this case, the network is considered to contain only the single address identified by the integer, so the network prefix includes the entire network address::
pt_pt: Embora a forma em string ofereça significativamente mais flexibilidade, as redes também podem ser definidas com inteiros, tal como os endereços de host. Neste caso, considera-se que a rede contém apenas o endereço único identificado pelo inteiro, pelo que o prefixo de rede inclui todo o endereço de rede::

source: As with addresses, creation of a particular kind of network can be forced by calling the class constructor directly instead of using the factory function.
pt_pt: Tal como com os endereços, a criação de um tipo particular de rede pode ser forçada chamando o construtor da classe diretamente, em vez de usar a função factory.

source: Host Interfaces
pt_pt: Interfaces de Host

source: As mentioned just above, if you need to describe an address on a particular network, neither the address nor the network classes are sufficient. Notation like ``192.0.2.1/24`` is commonly used by network engineers and the people who write tools for firewalls and routers as shorthand for "the host ``192.0.2.1`` on the network ``192.0.2.0/24``", Accordingly, :mod:`ipaddress` provides a set of hybrid classes that associate an address with a particular network. The interface for creation is identical to that for defining network objects, except that the address portion isn't constrained to being a network address.
pt_pt: Como mencionado acima, se precisar de descrever um endereço numa rede particular, nem as classes de endereço nem as de rede são suficientes. Notações como ``192.0.2.1/24`` são comummente usadas por engenheiros de redes e por quem escreve ferramentas para firewalls e routers como abreviatura para "o host ``192.0.2.1`` na rede ``192.0.2.0/24``". Assim, o :mod:`ipaddress` fornece um conjunto de classes híbridas que associam um endereço a uma rede específica. A interface para criação é idêntica à de definição de objetos de rede, exceto que a parte do endereço não está limitada a ser um endereço de rede.

source: Integer inputs are accepted (as with networks), and use of a particular IP version can be forced by calling the relevant constructor directly.
pt_pt: Entradas em formato inteiro são aceites (tal como nas redes), e o uso de uma versão de IP específica pode ser forçado chamando o construtor relevante diretamente.

source: Inspecting Address/Network/Interface Objects
pt_pt: Inspecionar Objetos de Endereço/Rede/Interface

source: You've gone to the trouble of creating an IPv(4|6)(Address|Network|Interface) object, so you probably want to get information about it. :mod:`ipaddress` tries to make doing this easy and intuitive.
pt_pt: Teve o trabalho de criar um objeto IPv(4|6)(Address|Network|Interface), pelo que provavelmente quererá obter informações sobre ele. O :mod:`ipaddress` tenta tornar isto fácil e intuitivo.

source: Extracting the IP version::
pt_pt: Extrair a versão do IP::

source: Obtaining the network from an interface::
pt_pt: Obter a rede a partir de uma interface::

source: Finding out how many individual addresses are in a network::
pt_pt: Descobrir quantos endereços individuais existem numa rede::

source: Iterating through the "usable" addresses on a network::
pt_pt: Iterar pelos endereços "utilizáveis" numa rede::

source: Obtaining the netmask (i.e. set bits corresponding to the network prefix) or the hostmask (any bits that are not part of the netmask):
pt_pt: Obter a máscara de rede (netmask, ou seja, bits definidos correspondentes ao prefixo de rede) ou a máscara de host (hostmask, quaisquer bits que não façam parte da máscara de rede):

source: Exploding or compressing the address::
pt_pt: Expandir (exploding) ou comprimir o endereço::

source: While IPv4 doesn't support explosion or compression, the associated objects still provide the relevant properties so that version neutral code can easily ensure the most concise or most verbose form is used for IPv6 addresses while still correctly handling IPv4 addresses.
pt_pt: Embora o IPv4 não suporte expansão ou compressão, os objetos associados continuam a fornecer as propriedades relevantes para que código neutro em relação à versão possa garantir facilmente que a forma mais concisa ou mais verbosa é usada para endereços IPv6, enquanto continua a tratar corretamente endereços IPv4.

source: Networks as lists of Addresses
pt_pt: Redes como listas de Endereços

source: It's sometimes useful to treat networks as lists. This means it is possible to index them like this::
pt_pt: Por vezes é útil tratar as redes como listas. Isto significa que é possível indexá-las desta forma::

source: It also means that network objects lend themselves to using the list membership test syntax like this::
pt_pt: Também significa que os objetos de rede se prestam ao uso da sintaxe de teste de pertença a lista, desta forma::

source: if address in network: # do something
pt_pt: if address in network: # faz algo

source: Containment testing is done efficiently based on the network prefix::
pt_pt: O teste de contenção é feito de forma eficiente com base no prefixo de rede::

source: Comparisons
pt_pt: Comparações

source: :mod:`ipaddress` provides some simple, hopefully intuitive ways to compare objects, where it makes sense::
pt_pt: :mod:`ipaddress` fornece algumas maneiras simples e, esperamos, intuitivas de comparar objetos, onde faz sentido::

source: A :exc:`TypeError` exception is raised if you try to compare objects of different versions or different types.
pt_pt: A exceção :exc:`TypeError` é levantada se tentar comparar objetos de versões diferentes ou tipos diferentes.

source: Using IP Addresses with other modules
pt_pt: Usar Endereços IP com outros módulos

source: Other modules that use IP addresses (such as :mod:`socket`) usually won't accept objects from this module directly. Instead, they must be coerced to an integer or string that the other module will accept::
pt_pt: Outros módulos que usam endereços IP (como o :mod:`socket`) normalmente não aceitam objetos deste módulo diretamente. Em vez disso, eles devem ser coagidos a um inteiro ou string que o outro módulo aceite::

source: Getting more detail when instance creation fails
pt_pt: Obter mais detalhes quando a criação da instância falha

source: When creating address/network/interface objects using the version-agnostic factory functions, any errors will be reported as :exc:`ValueError` with a generic error message that simply says the passed in value was not recognized as an object of that type. The lack of a specific error is because it's necessary to know whether the value is *supposed* to be IPv4 or IPv6 in order to provide more detail on why it has been rejected.
pt_pt: Ao criar objetos de endereço/rede/interface usando as funções factory agnósticas em relação à versão, quaisquer erros serão reportados como :exc:`ValueError` com uma mensagem de erro genérica que diz apenas que o valor passado não foi reconhecido como um objeto daquele tipo. A falta de um erro específico deve-se ao facto de ser necessário saber se o valor *deveria* ser IPv4 ou IPv6 para poder fornecer mais detalhes sobre o porquê de ter sido rejeitado.

source: To support use cases where it is useful to have access to this additional detail, the individual class constructors actually raise the :exc:`ValueError` subclasses :exc:`ipaddress.AddressValueError` and :exc:`ipaddress.NetmaskValueError` to indicate exactly which part of the definition failed to parse correctly.
pt_pt: Para suportar casos de uso onde é útil ter acesso a este detalhe adicional, os construtores de classe individuais levantam, na verdade, as subclasses de :exc:`ValueError`, :exc:`ipaddress.AddressValueError` e :exc:`ipaddress.NetmaskValueError`, para indicar exatamente qual parte da definição falhou ao ser processada corretamente.

source: The error messages are significantly more detailed when using the class constructors directly. For example::
pt_pt: As mensagens de erro são significativamente mais detalhadas ao usar os construtores de classe diretamente. Por exemplo::

source: However, both of the module specific exceptions have :exc:`ValueError` as their parent class, so if you're not concerned with the particular type of error, you can still write code like the following::
pt_pt: No entanto, ambas as exceções específicas do módulo têm o :exc:`ValueError` como classe pai, portanto, se não estiver preocupado com o tipo particular de erro, ainda pode escrever código como o seguinte::
