Repository: NyaPuma/python-docs-pt
Catalog: howto/perf_profiling.po
Languages: pt_pt

source: Python support for the Linux ``perf`` profiler
pt_pt: Suporte de Python para o profiler ``perf`` do Linux

source: author
pt_pt: autor

source: `The Linux perf profiler <https://perf.wiki.kernel.org>`_ is a very powerful tool that allows you to profile and obtain information about the performance of your application. ``perf`` also has a very vibrant ecosystem of tools that aid with the analysis of the data that it produces.
pt_pt: O `Linux perf profiler <https://perf.wiki.kernel.org>`_ é uma ferramenta muito poderosa que permite traçar perfis (*profile*) e obter informações sobre o desempenho da sua aplicação. O ``perf`` também possui um ecossistema vibrante de ferramentas que auxiliam na análise dos dados produzidos.

source: The main problem with using the ``perf`` profiler with Python applications is that ``perf`` only gets information about native symbols, that is, the names of functions and procedures written in C. This means that the names and file names of Python functions in your code will not appear in the output of ``perf``.
pt_pt: O principal problema ao usar o profiler ``perf`` com aplicações Python é que o ``perf`` apenas obtém informações sobre símbolos nativos, ou seja, os nomes de funções e procedimentos escritos em C. Isto significa que os nomes das funções Python e dos ficheiros no seu código não aparecerão na saída do ``perf``.

source: Since Python 3.12, the interpreter can run in a special mode that allows Python functions to appear in the output of the ``perf`` profiler. When this mode is enabled, the interpreter will interpose a small piece of code compiled on the fly before the execution of every Python function and it will teach ``perf`` the relationship between this piece of code and the associated Python function using :doc:`perf map files <../c-api/perfmaps>`.
pt_pt: Desde o Python 3.12, o intérprete pode correr num modo especial que permite que as funções Python apareçam na saída do profiler ``perf``. Quando este modo está ativado, o intérprete interporá um pequeno pedaço de código compilado na hora (*on the fly*) antes da execução de cada função Python e ensinará ao ``perf`` a relação entre esse código e a função Python associada utilizando :doc:`perf map files <../c-api/perfmaps>`.

source: Support for the ``perf`` profiler is currently only available for Linux on select architectures. Check the output of the ``configure`` build step or check the output of ``python -m sysconfig | grep HAVE_PERF_TRAMPOLINE`` to see if your system is supported.
pt_pt: O suporte para o profiler ``perf`` está atualmente disponível apenas para Linux em arquiteturas selecionadas. Verifique a saída do passo de build ``configure`` ou verifique a saída de ``python -m sysconfig | grep HAVE_PERF_TRAMPOLINE`` para ver se o seu sistema é suportado.

source: For example, consider the following script:
pt_pt: Por exemplo, considere o seguinte script:

source: We can run ``perf`` to sample CPU stack traces at 9999 hertz::
pt_pt: Podemos correr o ``perf`` para amostrar as stack traces do CPU a 9999 hertz::

source: $ perf record -F 9999 -g -o perf.data python my_script.py
pt_pt: $ perf record -F 9999 -g -o perf.data python meu_script.py

source: Then we can use ``perf report`` to analyze the data:
pt_pt: Depois podemos usar o ``perf report`` para analisar os dados:

source: As you can see, the Python functions are not shown in the output, only ``_PyEval_EvalFrameDefault`` (the function that evaluates the Python bytecode) shows up. Unfortunately that's not very useful because all Python functions use the same C function to evaluate bytecode so we cannot know which Python function corresponds to which bytecode-evaluating function.
pt_pt: Como pode ver, as funções Python não são mostradas na saída, apenas aparece ``_PyEval_EvalFrameDefault`` (a função que avalia o bytecode Python). Infelizmente, isso não é muito útil porque todas as funções Python usam a mesma função C para avaliar bytecode, pelo que não conseguimos saber qual função Python corresponde a cada função de avaliação de bytecode.

source: Instead, if we run the same experiment with ``perf`` support enabled we get:
pt_pt: Em vez disso, se corrermos a mesma experiência com o suporte para ``perf`` ativado, obtemos:

source: How to enable ``perf`` profiling support
pt_pt: Como ativar o suporte de profiling do ``perf``

source: ``perf`` profiling support can be enabled either from the start using the environment variable :envvar:`PYTHONPERFSUPPORT` or the :option:`-X perf <-X>` option, or dynamically using :func:`sys.activate_stack_trampoline` and :func:`sys.deactivate_stack_trampoline`.
pt_pt: O suporte de profiling para o ``perf`` pode ser ativado logo no início usando a variável de ambiente :envvar:`PYTHONPERFSUPPORT` ou a opção :option:`-X perf <-X>`, ou dinamicamente usando :func:`sys.activate_stack_trampoline` e :func:`sys.deactivate_stack_trampoline`.

source: The :mod:`!sys` functions take precedence over the :option:`!-X` option, the :option:`!-X` option takes precedence over the environment variable.
pt_pt: As funções :mod:`!sys` têm precedência sobre a opção :option:`!-X`, e a opção :option:`!-X` tem precedência sobre a variável de ambiente.

source: Example, using the environment variable::
pt_pt: Exemplo, usando a variável de ambiente::

source: Example, using the :option:`!-X` option::
pt_pt: Exemplo, usando a opção :option:`!-X`::

source: Example, using the :mod:`sys` APIs in file :file:`example.py`:
pt_pt: Exemplo, usando as APIs :mod:`sys` no ficheiro :file:`exemplo.py`:

source: ...then::
pt_pt: ...então::

source: How to obtain the best results
pt_pt: Como obter os melhores resultados

source: For best results, Python should be compiled with ``CFLAGS="-fno-omit-frame-pointer -mno-omit-leaf-frame-pointer"`` as this allows profilers to unwind using only the frame pointer and not on DWARF debug information. This is because as the code that is interposed to allow ``perf`` support is dynamically generated it doesn't have any DWARF debugging information available.
pt_pt: Para melhores resultados, o Python deve ser compilado com ``CFLAGS="-fno-omit-frame-pointer -mno-omit-leaf-frame-pointer"``, pois isso permite que os profilers façam o *unwind* da stack usando apenas o frame pointer e não a informação de depuração DWARF. Isto é necessário porque o código interposto para o suporte do ``perf`` é gerado dinamicamente e não possui informação DWARF disponível.

source: You can check if your system has been compiled with this flag by running::
pt_pt: Pode verificar se o seu sistema foi compilado com esta flag executando:

source: If you don't see any output it means that your interpreter has not been compiled with frame pointers and therefore it may not be able to show Python functions in the output of ``perf``.
pt_pt: Se não vir nenhuma saída, isso significa que o seu interpretador não foi compilado com ponteiros de frame e, portanto, pode não ser capaz de mostrar as funções Python na saída do ``perf``.

source: How to work without frame pointers
pt_pt: Como trabalhar sem frame pointers

source: If you are working with a Python interpreter that has been compiled without frame pointers, you can still use the ``perf`` profiler, but the overhead will be a bit higher because Python needs to generate unwinding information for every Python function call on the fly. Additionally, ``perf`` will take more time to process the data because it will need to use the DWARF debugging information to unwind the stack and this is a slow process.
pt_pt: Se estiver a trabalhar com um intérprete Python compilado sem frame pointers, ainda pode usar o profiler ``perf``, mas o impacto (*overhead*) será um pouco maior porque o Python precisa de gerar informação de *unwinding* para cada chamada de função Python na hora. Além disso, o ``perf`` levará mais tempo a processar os dados porque precisará de usar a informação DWARF para fazer o *unwind* da stack, o que é um processo lento.

source: To enable this mode, you can use the environment variable :envvar:`PYTHON_PERF_JIT_SUPPORT` or the :option:`-X perf_jit <-X>` option, which will enable the JIT mode for the ``perf`` profiler.
pt_pt: Para ativar este modo, pode usar a variável de ambiente :envvar:`PYTHON_PERF_JIT_SUPPORT` ou a opção :option:`-X perf_jit <-X>`, que ativará o modo JIT para o profiler ``perf``.

source: Due to a bug in the ``perf`` tool, only ``perf`` versions higher than v6.8 will work with the JIT mode. The fix was also backported to the v6.7.2 version of the tool.
pt_pt: Devido a um erro na ferramenta ``perf``, apenas as versões ``perf`` superiores à v6.8 funcionarão com o modo JIT. A correção também foi retroportada para a versão v6.7.2 da ferramenta.

source: Note that when checking the version of the ``perf`` tool (which can be done by running ``perf version``) you must take into account that some distros add some custom version numbers including a ``-`` character. This means that ``perf 6.7-3`` is not necessarily ``perf 6.7.3``.
pt_pt: Observe que ao verificar a versão da ferramenta ``perf`` (o que pode ser feito executando ``perf version``), deve-se levar em consideração que algumas distribuições adicionam números de versão personalizados, incluindo o carácter ``-``. Isso significa que ``perf 6.7-3`` não é necessariamente ``perf 6.7.3``.

source: When using the perf JIT mode, you need an extra step before you can run ``perf report``. You need to call the ``perf inject`` command to inject the JIT information into the ``perf.data`` file.::
pt_pt: Ao utilizar o modo perf JIT, é necessário um passo adicional antes de poder executar o ``perf report``. É necessário chamar o comando ``perf inject`` para injetar as informações JIT no ficheiro ``perf.data``.::

source: or using the environment variable::
pt_pt: ou usando a variável de ambiente::

source: ``perf inject --jit`` command will read ``perf.data``, automatically pick up the perf dump file that Python creates (in ``/tmp/perf-$PID.dump``), and then create ``perf.jit.data`` which merges all the JIT information together. It should also create a lot of ``jitted-XXXX-N.so`` files in the current directory which are ELF images for all the JIT trampolines that were created by Python.
pt_pt: O comando ``perf inject --jit`` lerá o ficheiro ``perf.data``, recolherá automaticamente o ficheiro de dump que o Python cria (em ``/tmp/perf-$PID.dump``) e criará o ficheiro ``perf.jit.data`` que funde toda a informação JIT. Também deverá criar vários ficheiros ``jitted-XXXX-N.so`` no diretório atual, que são imagens ELF para todos os trampolins JIT criados pelo Python.

source: When using ``--call-graph dwarf``, the ``perf`` tool will take snapshots of the stack of the process being profiled and save the information in the ``perf.data`` file. By default, the size of the stack dump is 8192 bytes, but you can change the size by passing it after a comma like ``--call-graph dwarf,16384``.
pt_pt: Ao usar ``--call-graph dwarf``, a ferramenta ``perf`` irá tirar instantâneos da stack do processo que está a ser perfilado e guardar as informações no ficheiro ``perf.data``. Por predefinição, o tamanho do despejo da stack é de 8192 bytes, mas pode alterar o tamanho passando-o após uma vírgula, como ``--call-graph dwarf,16384``.

source: The size of the stack dump is important because if the size is too small ``perf`` will not be able to unwind the stack and the output will be incomplete. On the other hand, if the size is too big, then ``perf`` won't be able to sample the process as frequently as it would like as the overhead will be higher.
pt_pt: O tamanho do despejo da stack é importante porque, se for muito pequeno, o ``perf`` não conseguirá desenrolar a stack e a saída ficará incompleta. Por outro lado, se o tamanho for muito grande, o ``perf`` não conseguirá amostrar o processo com a frequência desejada, pois a sobrecarga será maior.

source: The stack size is particularly important when profiling Python code compiled with low optimization levels (like ``-O0``), as these builds tend to have larger stack frames. If you are compiling Python with ``-O0`` and not seeing Python functions in your profiling output, try increasing the stack dump size to 65528 bytes (the maximum)::
pt_pt: O tamanho da stack é particularmente importante ao criar perfis de código Python compilado com baixos níveis de otimização (como ``-O0``), pois essas compilações tendem a ter frames de stack maiores. Se estiver a compilar Python com ``-O0`` e não estiver a ver funções Python na sua saída de perfil, tente aumentar o tamanho do despejo da stack para 65528 bytes (o máximo)::

source: Different compilation flags can significantly impact stack sizes:
pt_pt: Diferentes flags de compilação podem impactar significativamente o tamanho da stack:

source: Builds with ``-O0`` typically have much larger stack frames than those with ``-O1`` or higher
pt_pt: Builds com ``-O0`` têm tipicamente stack frames muito maiores do que builds com ``-O1`` ou superior

source: Adding optimizations (``-O1``, ``-O2``, etc.) typically reduces stack size
pt_pt: Adicionar otimizações (``-O1``, ``-O2``, etc.) reduz tipicamente o tamanho da stack

source: Frame pointers (``-fno-omit-frame-pointer``) generally provide more reliable stack unwinding
pt_pt: Frame pointers (``-fno-omit-frame-pointer``) geralmente fornecem um *unwinding* da stack mais fiável
