Repository: NyaPuma/python-docs-pt
Catalog: howto/pyporting.po
Languages: pt_pt

source: How to port Python 2 Code to Python 3
pt_pt: Como portar código Python 2 para Python 3

source: author
pt_pt: autor

source: Python 2 reached its official end-of-life at the start of 2020. This means that no new bug reports, fixes, or changes will be made to Python 2 - it's no longer supported: see :pep:`373` and `status of Python versions <https://devguide.python.org/versions>`_.
pt_pt: O Python 2 atingiu o fim da sua vida útil oficial no início de 2020. Isso significa que não serão feitos novos relatórios de erros, correções ou alterações no Python 2 - ele não é mais suportado: consulte :pep:`373` e `status das versões do Python <https://devguide.python.org/versions>`_.

source: If you are looking to port an extension module instead of pure Python code, please see :ref:`cporting-howto`.
pt_pt: Se pretende portar um módulo de extensão em vez de código Python puro, consulte :ref:`cporting-howto`.

source: The archived python-porting_ mailing list may contain some useful guidance.
pt_pt: A lista de correio python-porting_ arquivada pode conter algumas orientações úteis.

source: Since Python 3.11 the original porting guide was discontinued. You can find the old guide in the `archive <https://docs.python.org/3.10/howto/pyporting.html>`_.
pt_pt: Desde o Python 3.11, o guia de portabilidade original foi descontinuado. Pode encontrar o guia antigo no `arquivo <https://docs.python.org/3.10/howto/pyporting.html>`_.

source: Third-party guides
pt_pt: Guias de terceiros

source: There are also multiple third-party guides that might be useful:
pt_pt: Existem também vários guias de terceiros que podem ser úteis:

source: `Guide by Fedora <https://portingguide.readthedocs.io>`_
pt_pt: `Guia do Fedora <https://portingguide.readthedocs.io>`_

source: `PyCon 2020 tutorial <https://www.youtube.com/watch?v=JgIgEjASOlk>`_
pt_pt: `Tutorial PyCon 2020 <https://www.youtube.com/watch?v=JgIgEjASOlk>`_

source: `Guide by DigitalOcean <https://www.digitalocean.com/community/tutorials/how-to-port-python-2-code-to-python-3>`_
pt_pt: `Guia da DigitalOcean <https://www.digitalocean.com/community/tutorials/how-to-port-python-2-code-to-python-3>`_

source: `Guide by ActiveState <https://www.activestate.com/blog/how-to-migrate-python-2-applications-to-python-3>`_
pt_pt: `Guia da ActiveState <https://www.activestate.com/blog/how-to-migrate-python-2-applications-to-python-3>`_
