Repository: NyaPuma/python-docs-pt
Catalog: howto/urllib2.po
Languages: pt_pt

source: **info** - this returns a dictionary-like object that describes the page fetched, particularly the headers sent by the server. It is currently an :class:`http.client.HTTPMessage` instance.
pt_pt: **info** - devolve um objeto semelhante a um dicionário que descreve a página obtida, particularmente os cabeçalhos enviados pelo servidor. Atualmente é uma instância de :class:`http.client.HTTPMessage`.

source: Typical headers include 'Content-length', 'Content-type', and so on. See the `Quick Reference to HTTP Headers <https://jkorpela.fi/http.html>`_ for a useful listing of HTTP headers with brief explanations of their meaning and use.
pt_pt: Os cabeçalhos típicos incluem 'Content-length', 'Content-type', e assim por diante. Veja a `Referência Rápida para Cabeçalhos HTTP <https://jkorpela.fi/http.html>`_ para uma lista útil de cabeçalhos HTTP com breves explicações sobre o seu significado e uso.

source: Openers and Handlers
pt_pt: Openers e Handlers

source: When you fetch a URL you use an opener (an instance of the perhaps confusingly named :class:`urllib.request.OpenerDirector`). Normally we have been using the default opener - via ``urlopen`` - but you can create custom openers. Openers use handlers. All the "heavy lifting" is done by the handlers. Each handler knows how to open URLs for a particular URL scheme (http, ftp, etc.), or how to handle an aspect of URL opening, for example HTTP redirections or HTTP cookies.
pt_pt: Quando obtém uma URL, utiliza um opener (uma instância do possivelmente confuso :class:`urllib.request.OpenerDirector`). Normalmente temos utilizado o opener predefinido - via ``urlopen`` - mas pode criar openers personalizados. Os openers utilizam handlers. Todo o "trabalho pesado" é feito pelos handlers. Cada handler sabe como abrir URLs para um esquema de URL específico (http, ftp, etc.), ou como lidar com um aspeto da abertura da URL, por exemplo, redirecionamentos HTTP ou cookies HTTP.

source: You will want to create openers if you want to fetch URLs with specific handlers installed, for example to get an opener that handles cookies, or to get an opener that does not handle redirections.
pt_pt: Desejará criar openers se quiser obter URLs com handlers específicos instalados, por exemplo, para obter um opener que lide com cookies, ou para obter um opener que não lide com redirecionamentos.

source: To create an opener, instantiate an ``OpenerDirector``, and then call ``.add_handler(some_handler_instance)`` repeatedly.
pt_pt: Para criar um opener, instancie um ``OpenerDirector`` e, em seguida, chame ``.add_handler(instancia_de_algum_handler)`` repetidamente.

source: Alternatively, you can use ``build_opener``, which is a convenience function for creating opener objects with a single function call. ``build_opener`` adds several handlers by default, but provides a quick way to add more and/or override the default handlers.
pt_pt: Alternativamente, pode usar o ``build_opener``, que é uma função de conveniência para criar objetos opener com uma única chamada de função. O ``build_opener`` adiciona vários handlers por predefinição, mas fornece uma forma rápida de adicionar mais e/ou substituir os handlers predefinidos.

source: Other sorts of handlers you might want to can handle proxies, authentication, and other common but slightly specialised situations.
pt_pt: Outros tipos de handlers que pode desejar podem lidar com proxies, autenticação e outras situações comuns mas ligeiramente especializadas.

source: ``install_opener`` can be used to make an ``opener`` object the (global) default opener. This means that calls to ``urlopen`` will use the opener you have installed.
pt_pt: O ``install_opener`` pode ser usado para tornar um objeto ``opener`` no opener predefinido (global). Isto significa que as chamadas para ``urlopen`` usarão o opener que instalou.

source: Opener objects have an ``open`` method, which can be called directly to fetch urls in the same way as the ``urlopen`` function: there's no need to call ``install_opener``, except as a convenience.
pt_pt: Os objetos Opener têm um método ``open``, que pode ser chamado diretamente para obter URLs da mesma forma que a função ``urlopen``: não há necessidade de chamar ``install_opener``, exceto por conveniência.

source: Basic Authentication
pt_pt: Autenticação Básica

source: To illustrate creating and installing a handler we will use the ``HTTPBasicAuthHandler``. For a more detailed discussion of this subject -- including an explanation of how Basic Authentication works - see the `Basic Authentication Tutorial <https://web.archive.org/web/20201215133350/http://www.voidspace.org.uk/python/articles/authentication.shtml>`__.
pt_pt: Para ilustrar a criação e instalação de um manipulador, usaremos o ``HTTPBasicAuthHandler``. Para uma discussão mais detalhada sobre este assunto, incluindo uma explicação sobre como funciona a autenticação básica, consulte o `Tutorial de autenticação básica <https://web.archive.org/web/20201215133350/http://www.voidspace.org.uk/python/articles/authentication.shtml>`__.

source: ``HTTP_PROXY`` will be ignored if a variable ``REQUEST_METHOD`` is set; see the documentation on :func:`~urllib.request.getproxies`.
pt_pt: ``HTTP_PROXY`` será ignorado se uma variável ``REQUEST_METHOD`` estiver definida; veja a documentação em :func:`~urllib.request.getproxies`.

source: Sockets and Layers
pt_pt: Sockets e Camadas

source: import socket import urllib.request # timeout in seconds timeout = 10 socket.setdefaulttimeout(timeout) # this call to urllib.request.urlopen now uses the default timeout # we have set in the socket module req = urllib.request.Request('http://www.voidspace.org.uk') response = urllib.request.urlopen(req)
pt_pt: import socket import urllib.request # timeout em segundos timeout = 10 socket.setdefaulttimeout(timeout) # esta chamada a urllib.request.urlopen usa agora o timeout predefinido # que configurámos no módulo socket req = urllib.request.Request('http://www.voidspace.org.uk') response = urllib.request.urlopen(req)

source: Footnotes
pt_pt: Notas de Rodapé
