Repository: NyaPuma/python-docs-pt
Catalog: howto/urllib2.po
Languages: pt_pt

source: HOWTO Fetch Internet Resources Using The urllib Package
pt_pt: COMO Obter Recursos da Internet Usando o Pacote urllib

source: Author
pt_pt: Autor

source: Introduction
pt_pt: Introdução

source: You may also find useful the following article on fetching web resources with Python:
pt_pt: Também pode encontrar útil o seguinte artigo sobre como obter recursos web com Python:

source: `Basic Authentication <https://web.archive.org/web/20201215133350/http://www.voidspace.org.uk/python/articles/authentication.shtml>`__
pt_pt: `Autenticação Básica <https://web.archive.org/web/20201215133350/http://www.voidspace.org.uk/python/articles/authentication.shtml>`__

source: A tutorial on *Basic Authentication*, with examples in Python.
pt_pt: Um tutorial sobre *Autenticação Básica*, com exemplos em Python.

source: **urllib.request** is a Python module for fetching URLs (Uniform Resource Locators). It offers a very simple interface, in the form of the *urlopen* function. This is capable of fetching URLs using a variety of different protocols. It also offers a slightly more complex interface for handling common situations - like basic authentication, cookies, proxies and so on. These are provided by objects called handlers and openers.
pt_pt: **urllib.request** é um módulo Python para obter URLs (Localizadores de Recursos Uniformes). Oferece uma interface muito simples, na forma da função *urlopen*. Esta é capaz de obter URLs usando uma variedade de protocolos diferentes. Também oferece uma interface um pouco mais complexa para lidar com situações comuns - como autenticação básica, cookies, proxies e assim por diante. Estas são fornecidas por objetos chamados *handlers* e *openers*.

source: urllib.request supports fetching URLs for many "URL schemes" (identified by the string before the ``":"`` in URL - for example ``"ftp"`` is the URL scheme of ``"ftp://python.org/"``) using their associated network protocols (e.g. FTP, HTTP). This tutorial focuses on the most common case, HTTP.
pt_pt: urllib.request suporta a obtenção de URLs para muitos "esquemas de URL" (identificados pela string antes do ``":"`` na URL - por exemplo, ``"ftp"`` é o esquema de URL de ``"ftp://python.org/"``) usando os seus protocolos de rede associados (por exemplo, FTP, HTTP). Este tutorial foca-se no caso mais comum, HTTP.

source: For straightforward situations *urlopen* is very easy to use. But as soon as you encounter errors or non-trivial cases when opening HTTP URLs, you will need some understanding of the HyperText Transfer Protocol. The most comprehensive and authoritative reference to HTTP is :rfc:`2616`. This is a technical document and not intended to be easy to read. This HOWTO aims to illustrate using *urllib*, with enough detail about HTTP to help you through. It is not intended to replace the :mod:`urllib.request` docs, but is supplementary to them.
pt_pt: Para situações simples, *urlopen* é muito fácil de usar. Mas assim que encontrar erros ou casos não triviais ao abrir URLs HTTP, precisará de alguma compreensão do Protocolo de Transferência de Hipertexto. A referência mais completa e autoritativa para HTTP é :rfc:`2616`. Este é um documento técnico e não foi concebido para ser fácil de ler. Este HOWTO visa ilustrar o uso de *urllib*, com detalhes suficientes sobre HTTP para o ajudar. Não se destina a substituir a documentação de :mod:`urllib.request`, mas é suplementar a esta.

source: Fetching URLs
pt_pt: Obter URLs

source: The simplest way to use urllib.request is as follows::
pt_pt: A forma mais simples de usar urllib.request é a seguinte:

source: If you wish to retrieve a resource via URL and store it in a temporary location, you can do so via the :func:`shutil.copyfileobj` and :func:`tempfile.NamedTemporaryFile` functions::
pt_pt: Se desejar recuperar um recurso via URL e armazená-lo num local temporário, pode fazê-lo através das funções :func:`shutil.copyfileobj` e :func:`tempfile.NamedTemporaryFile`:

source: Many uses of urllib will be that simple (note that instead of an 'http:' URL we could have used a URL starting with 'ftp:', 'file:', etc.). However, it's the purpose of this tutorial to explain the more complicated cases, concentrating on HTTP.
pt_pt: Muitos usos de urllib serão tão simples (note que em vez de uma URL 'http:' poderíamos ter usado uma URL começando com 'ftp:', 'file:', etc.). No entanto, o objetivo deste tutorial é explicar os casos mais complicados, concentrando-se em HTTP.

source: HTTP is based on requests and responses - the client makes requests and servers send responses. urllib.request mirrors this with a ``Request`` object which represents the HTTP request you are making. In its simplest form you create a Request object that specifies the URL you want to fetch. Calling ``urlopen`` with this Request object returns a response object for the URL requested. This response is a file-like object, which means you can for example call ``.read()`` on the response::
pt_pt: O HTTP é baseado em pedidos e respostas - o cliente faz pedidos e os servidores enviam respostas. O urllib.request reflete isto com um objeto ``Request`` que representa o pedido HTTP que está a fazer. Na sua forma mais simples, cria um objeto Request que especifica a URL que deseja obter. Chamar ``urlopen`` com este objeto Request devolve um objeto de resposta para a URL solicitada. Esta resposta é um objeto semelhante a um ficheiro, o que significa que pode, por exemplo, chamar ``.read()`` na resposta:

source: Note that urllib.request makes use of the same Request interface to handle all URL schemes. For example, you can make an FTP request like so::
pt_pt: Note que urllib.request usa a mesma interface Request para lidar com todos os esquemas de URL. Por exemplo, pode fazer um pedido FTP assim:

source: In the case of HTTP, there are two extra things that Request objects allow you to do: First, you can pass data to be sent to the server. Second, you can pass extra information ("metadata") *about* the data or about the request itself, to the server - this information is sent as HTTP "headers". Let's look at each of these in turn.
pt_pt: No caso do HTTP, há duas coisas extras que os objetos Request permitem fazer: Primeiro, pode passar dados a serem enviados para o servidor. Segundo, pode passar informações extras ("metadados") *sobre* os dados ou sobre o próprio pedido, para o servidor - esta informação é enviada como cabeçalhos HTTP. Vamos ver cada uma destas em detalhe.

source: Data
pt_pt: Dados

source: Sometimes you want to send data to a URL (often the URL will refer to a CGI (Common Gateway Interface) script or other web application). With HTTP, this is often done using what's known as a **POST** request. This is often what your browser does when you submit a HTML form that you filled in on the web. Not all POSTs have to come from forms: you can use a POST to transmit arbitrary data to your own application. In the common case of HTML forms, the data needs to be encoded in a standard way, and then passed to the Request object as the ``data`` argument. The encoding is done using a function from the :mod:`urllib.parse` library. ::
pt_pt: Às vezes, deseja enviar dados para uma URL (muitas vezes a URL referir-se-á a um script CGI (Common Gateway Interface) ou outra aplicação web). Com HTTP, isto é frequentemente feito usando o que é conhecido como um pedido **POST**. Isto é frequentemente o que o seu navegador faz quando submete um formulário HTML que preencheu na web. Nem todos os POSTs têm de vir de formulários: pode usar um POST para transmitir dados arbitrários para a sua própria aplicação. No caso comum de formulários HTML, os dados precisam de ser codificados de uma forma padrão, e depois passados ao objeto Request como o argumento ``data``. A codificação é feita usando uma função da biblioteca :mod:`urllib.parse`:

source: import urllib.parse import urllib.request url = 'http://www.someserver.com/cgi-bin/register.cgi' values = {'name' : 'Michael Foord', 'location' : 'Northampton', 'language' : 'Python' } data = urllib.parse.urlencode(values) data = data.encode('ascii') # data should be bytes req = urllib.request.Request(url, data) with urllib.request.urlopen(req) as response: the_page = response.read()
pt_pt: import urllib.parse import urllib.request url = 'http://www.someserver.com/cgi-bin/register.cgi' values = {'name' : 'Michael Foord', 'location' : 'Northampton', 'language' : 'Python' } data = urllib.parse.urlencode(values) data = data.encode('ascii') # os dados devem ser bytes req = urllib.request.Request(url, data) with urllib.request.urlopen(req) as response: the_page = response.read()

source: Note that other encodings are sometimes required (e.g. for file upload from HTML forms - see `HTML Specification, Form Submission <https://www.w3.org/TR/REC-html40/interact/forms.html#h-17.13>`_ for more details).
pt_pt: Note que outras codificações são por vezes necessárias (por exemplo, para o carregamento de ficheiros a partir de formulários HTML - veja `Especificação HTML, Submissão de Formulário <https://www.w3.org/TR/REC-html40/interact/forms.html#h-17.13>`_ para mais detalhes).

source: If you do not pass the ``data`` argument, urllib uses a **GET** request. One way in which GET and POST requests differ is that POST requests often have "side-effects": they change the state of the system in some way (for example by placing an order with the website for a hundredweight of tinned spam to be delivered to your door). Though the HTTP standard makes it clear that POSTs are intended to *always* cause side-effects, and GET requests *never* to cause side-effects, nothing prevents a GET request from having side-effects, nor a POST requests from having no side-effects. Data can also be passed in an HTTP GET request by encoding it in the URL itself.
pt_pt: Se não passar o argumento ``data``, o urllib usa um pedido **GET**. Uma forma pela qual os pedidos GET e POST diferem é que os pedidos POST muitas vezes têm "efeitos secundários": alteram o estado do sistema de alguma forma (por exemplo, ao fazer um pedido no site para que uma centena de latas de spam sejam entregues à sua porta). Embora o padrão HTTP deixe claro que os POSTs devem *sempre* causar efeitos secundários, e os pedidos GET *nunca* devem causar efeitos secundários, nada impede que um pedido GET tenha efeitos secundários, nem que um pedido POST não tenha efeitos secundários. Os dados também podem ser passados num pedido HTTP GET codificando-os na própria URL.

source: This is done as follows::
pt_pt: Isto é feito da seguinte forma:

source: >>> import urllib.request >>> import urllib.parse >>> data = {} >>> data['name'] = 'Somebody Here' >>> data['location'] = 'Northampton' >>> data['language'] = 'Python' >>> url_values = urllib.parse.urlencode(data) >>> print(url_values) # The order may differ from below. name=Somebody+Here&language=Python&location=Northampton >>> url = 'http://www.example.com/example.cgi' >>> full_url = url + '?' + url_values >>> data = urllib.request.urlopen(full_url)
pt_pt: >>> import urllib.request >>> import urllib.parse >>> data = {} >>> data['name'] = 'Somebody Here' >>> data['location'] = 'Northampton' >>> data['language'] = 'Python' >>> url_values = urllib.parse.urlencode(data) >>> print(url_values) # A ordem pode diferir da abaixo. name=Somebody+Here&language=Python&location=Northampton >>> url = 'http://www.example.com/example.cgi' >>> full_url = url + '?' + url_values >>> data = urllib.request.urlopen(full_url)

source: Notice that the full URL is created by adding a ``?`` to the URL, followed by the encoded values.
pt_pt: Note que a URL completa é criada adicionando um ``?`` à URL, seguido pelos valores codificados.

source: Headers
pt_pt: Cabeçalhos

source: We'll discuss here one particular HTTP header, to illustrate how to add headers to your HTTP request.
pt_pt: Vamos discutir aqui um cabeçalho HTTP específico, para ilustrar como adicionar cabeçalhos ao seu pedido HTTP.

source: Some websites [#]_ dislike being browsed by programs, or send different versions to different browsers [#]_. By default urllib identifies itself as ``Python-urllib/x.y`` (where ``x`` and ``y`` are the major and minor version numbers of the Python release, e.g. ``Python-urllib/2.5``), which may confuse the site, or just plain not work. The way a browser identifies itself is through the ``User-Agent`` header [#]_. When you create a Request object you can pass a dictionary of headers in. The following example makes the same request as above, but identifies itself as a version of Internet Explorer [#]_. ::
pt_pt: Alguns sites [#]_ não gostam de ser navegados por programas, ou enviam versões diferentes para navegadores diferentes [#]_. Por predefinição, o urllib identifica-se como ``Python-urllib/x.y`` (onde ``x`` e ``y`` são os números de versão principal e secundária da versão do Python, por exemplo, ``Python-urllib/2.5``), o que pode confundir o site, ou simplesmente não funcionar. A forma como um navegador se identifica é através do cabeçalho ``User-Agent`` [#]_. Quando cria um objeto Request, pode passar um dicionário de cabeçalhos. O exemplo seguinte faz o mesmo pedido que acima, mas identifica-se como uma versão do Internet Explorer [#]_:

source: The response also has two useful methods. See the section on `info and geturl`_ which comes after we have a look at what happens when things go wrong.
pt_pt: A resposta também tem dois métodos úteis. Veja a secção sobre `info e geturl`_ que vem depois de vermos o que acontece quando as coisas correm mal.

source: Handling Exceptions
pt_pt: Tratamento de Exceções

source: *urlopen* raises :exc:`~urllib.error.URLError` when it cannot handle a response (though as usual with Python APIs, built-in exceptions such as :exc:`ValueError`, :exc:`TypeError` etc. may also be raised).
pt_pt: *urlopen* lança :exc:`~urllib.error.URLError` quando não consegue lidar com uma resposta (embora, como é habitual com as APIs Python, exceções incorporadas como :exc:`ValueError`, :exc:`TypeError`, etc., também possam ser lançadas).

source: :exc:`~urllib.error.HTTPError` is the subclass of :exc:`~urllib.error.URLError` raised in the specific case of HTTP URLs.
pt_pt: :exc:`~urllib.error.HTTPError` é a subclasse de :exc:`~urllib.error.URLError` lançada no caso específico de URLs HTTP.

source: The exception classes are exported from the :mod:`urllib.error` module.
pt_pt: As classes de exceção são exportadas do módulo :mod:`urllib.error`.

source: Often, URLError is raised because there is no network connection (no route to the specified server), or the specified server doesn't exist. In this case, the exception raised will have a 'reason' attribute, which is a tuple containing an error code and a text error message.
pt_pt: Muitas vezes, URLError é lançada porque não há ligação à rede (sem rota para o servidor especificado), ou o servidor especificado não existe. Neste caso, a exceção lançada terá um atributo 'reason', que é um tuplo contendo um código de erro e uma mensagem de erro em texto.

source: e.g. ::
pt_pt: por exemplo:

source: >>> req = urllib.request.Request('http://www.pretend_server.org') >>> try: urllib.request.urlopen(req) ... except urllib.error.URLError as e: ... print(e.reason) ... (4, 'getaddrinfo failed')
pt_pt: >>> req = urllib.request.Request('http://www.pretend_server.org') >>> try: urllib.request.urlopen(req) ... except urllib.error.URLError as e: ... print(e.reason) ... (4, 'getaddrinfo falhou')

source: Every HTTP response from the server contains a numeric "status code". Sometimes the status code indicates that the server is unable to fulfil the request. The default handlers will handle some of these responses for you (for example, if the response is a "redirection" that requests the client fetch the document from a different URL, urllib will handle that for you). For those it can't handle, urlopen will raise an :exc:`~urllib.error.HTTPError`. Typical errors include '404' (page not found), '403' (request forbidden), and '401' (authentication required).
pt_pt: Toda a resposta HTTP do servidor contém um código de "estado" numérico. Às vezes, o código de estado indica que o servidor não consegue satisfazer o pedido. Os manipuladores predefinidos lidarão com algumas destas respostas por si (por exemplo, se a resposta for uma "redireção" que solicita ao cliente buscar o documento a partir de uma URL diferente, o urllib lidará com isso por si). Para aquelas que não consegue lidar, o urlopen lançará uma :exc:`~urllib.error.HTTPError`. Erros típicos incluem '404' (página não encontrada), '403' (pedido proibido) e '401' (autenticação necessária).

source: See section 10 of :rfc:`2616` for a reference on all the HTTP error codes.
pt_pt: Veja a secção 10 da :rfc:`2616` para uma referência a todos os códigos de erro HTTP.

source: The :exc:`~urllib.error.HTTPError` instance raised will have an integer 'code' attribute, which corresponds to the error sent by the server.
pt_pt: A instância :exc:`~urllib.error.HTTPError` lançada terá um atributo inteiro 'code', que corresponde ao erro enviado pelo servidor.

source: Error Codes
pt_pt: Códigos de Erro

source: Because the default handlers handle redirects (codes in the 300 range), and codes in the 100--299 range indicate success, you will usually only see error codes in the 400--599 range.
pt_pt: Como os manipuladores predefinidos lidam com redirecionamentos (códigos na gama dos 300), e os códigos na gama 100-299 indicam sucesso, normalmente só verá códigos de erro na gama 400-599.

source: :attr:`http.server.BaseHTTPRequestHandler.responses` is a useful dictionary of response codes that shows all the response codes used by :rfc:`2616`. An excerpt from the dictionary is shown below ::
pt_pt: :attr:`http.server.BaseHTTPRequestHandler.responses` é um dicionário útil de códigos de resposta que mostra todos os códigos de resposta usados pela :rfc:`2616`. Um excerto do dicionário é mostrado abaixo:

source: responses = { ... <HTTPStatus.OK: 200>: ('OK', 'Request fulfilled, document follows'), ... <HTTPStatus.FORBIDDEN: 403>: ('Forbidden', 'Request forbidden -- authorization will ' 'not help'), <HTTPStatus.NOT_FOUND: 404>: ('Not Found', 'Nothing matches the given URI'), ... <HTTPStatus.IM_A_TEAPOT: 418>: ("I'm a Teapot", 'Server refuses to brew coffee because ' 'it is a teapot'), ... <HTTPStatus.SERVICE_UNAVAILABLE: 503>: ('Service Unavailable', 'The server cannot process the ' 'request due to a high load'), ... }
pt_pt: responses = { ... <HTTPStatus.OK: 200>: ('OK', 'Pedido cumprido, segue o documento'), ... <HTTPStatus.FORBIDDEN: 403>: ('Proibido', 'Pedido proibido -- a autorização não ' 'ajudará'), <HTTPStatus.NOT_FOUND: 404>: ('Não Encontrado', 'Nada corresponde ao URI dado'), ... <HTTPStatus.IM_A_TEAPOT: 418>: ("Sou um Bule", 'O servidor recusa-se a fazer café porque ' 'é um bule'), ... <HTTPStatus.SERVICE_UNAVAILABLE: 503>: ('Serviço Indisponível', 'O servidor não pode processar o ' 'pedido devido a uma carga elevada'), ... }

source: When an error is raised the server responds by returning an HTTP error code *and* an error page. You can use the :exc:`~urllib.error.HTTPError` instance as a response on the page returned. This means that as well as the code attribute, it also has read, geturl, and info, methods as returned by the ``urllib.response`` module::
pt_pt: Quando um erro é lançado, o servidor responde devolvendo um código de erro HTTP *e* uma página de erro. Pode usar a instância :exc:`~urllib.error.HTTPError` como uma resposta na página devolvida. Isto significa que, além do atributo code, também tem os métodos read, geturl e info, como devolvidos pelo módulo ``urllib.response``:

source: >>> req = urllib.request.Request('http://www.python.org/fish.html') >>> try: ... urllib.request.urlopen(req) ... except urllib.error.HTTPError as e: ... print(e.code) ... print(e.read()) ... 404 b'<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">\n\n\n<html ... <title>Page Not Found</title>\n ...
pt_pt: >>> req = urllib.request.Request('http://www.python.org/fish.html') >>> try: ... urllib.request.urlopen(req) ... except urllib.error.HTTPError as e: ... print(e.code) ... print(e.read()) ... 404 b'<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">\n\n\n<html ... <title>Página Não Encontrada</title>\n ...

source: Wrapping it Up
pt_pt: Resumo

source: So if you want to be prepared for :exc:`~urllib.error.HTTPError` *or* :exc:`~urllib.error.URLError` there are two basic approaches. I prefer the second approach.
pt_pt: Portanto, se deseja estar preparado para :exc:`~urllib.error.HTTPError` *ou* :exc:`~urllib.error.URLError`, existem duas abordagens básicas. Eu prefiro a segunda abordagem.

source: Number 1
pt_pt: Número 1

source: from urllib.request import Request, urlopen from urllib.error import URLError, HTTPError req = Request(someurl) try: response = urlopen(req) except HTTPError as e: print('The server couldn\'t fulfill the request.') print('Error code: ', e.code) except URLError as e: print('We failed to reach a server.') print('Reason: ', e.reason) else: # everything is fine
pt_pt: from urllib.request import Request, urlopen from urllib.error import URLError, HTTPError req = Request(someurl) try: response = urlopen(req) except HTTPError as e: print('O servidor não conseguiu satisfazer o pedido.') print('Código de erro: ', e.code) except URLError as e: print('Não conseguimos contactar o servidor.') print('Razão: ', e.reason) else: # tudo correu bem

source: The ``except HTTPError`` *must* come first, otherwise ``except URLError`` will *also* catch an :exc:`~urllib.error.HTTPError`.
pt_pt: O ``except HTTPError`` *tem* de vir primeiro, caso contrário o ``except URLError`` também capturará um :exc:`~urllib.error.HTTPError`.

source: Number 2
pt_pt: Número 2

source: from urllib.request import Request, urlopen from urllib.error import URLError req = Request(someurl) try: response = urlopen(req) except URLError as e: if hasattr(e, 'reason'): print('We failed to reach a server.') print('Reason: ', e.reason) elif hasattr(e, 'code'): print('The server couldn\'t fulfill the request.') print('Error code: ', e.code) else: # everything is fine
pt_pt: from urllib.request import Request, urlopen from urllib.error import URLError req = Request(someurl) try: response = urlopen(req) except URLError as e: if hasattr(e, 'reason'): print('Não conseguimos contactar o servidor.') print('Razão: ', e.reason) elif hasattr(e, 'code'): print('O servidor não conseguiu satisfazer o pedido.') print('Código de erro: ', e.code) else: # tudo correu bem

source: info and geturl
pt_pt: info e geturl

source: The response returned by urlopen (or the :exc:`~urllib.error.HTTPError` instance) has two useful methods :meth:`!info` and :meth:`!geturl` and is defined in the module :mod:`urllib.response`.
pt_pt: A resposta devolvida pelo urlopen (ou a instância :exc:`~urllib.error.HTTPError`) tem dois métodos úteis :meth:`!info` e :meth:`!geturl` e está definida no módulo :mod:`urllib.response`.

source: **geturl** - this returns the real URL of the page fetched. This is useful because ``urlopen`` (or the opener object used) may have followed a redirect. The URL of the page fetched may not be the same as the URL requested.
pt_pt: **geturl** - devolve a URL real da página obtida. Isto é útil porque o ``urlopen`` (ou o objeto opener utilizado) pode ter seguido um redirecionamento. A URL da página obtida pode não ser a mesma que a URL solicitada.
