Repository: NyaPuma/python-docs-pt
Catalog: c-api/curses.po
Languages: pt_pt

source: Curses C API
pt_pt: API C do Curses

source: :mod:`curses` exposes a small C interface for extension modules. Consumers must include the header file :file:`py_curses.h` (which is not included by default by :file:`Python.h`) and :c:func:`import_curses` must be invoked, usually as part of the module initialisation function, to populate :c:var:`PyCurses_API`.
pt_pt: O :mod:`curses` expõe uma pequena interface C para módulos de extensão. Os consumidores devem incluir o ficheiro de cabeçalho :file:`py_curses.h` (que não é incluído por predefinição pelo :file:`Python.h`) e o :c:func:`import_curses` deve ser invocado, geralmente como parte da função de inicialização do módulo, para popular o :c:var:`PyCurses_API`.

source: Neither the C API nor the pure Python :mod:`curses` module are compatible with subinterpreters.
pt_pt: Nem a API C nem o módulo :mod:`curses` em Python puro são compatíveis com subinterpretadores.

source: Import the curses C API. The macro does not need a semi-colon to be called.
pt_pt: Importa a API C do curses. A macro não necessita de um ponto e vírgula para ser chamada.

source: On success, populate the :c:var:`PyCurses_API` pointer.
pt_pt: Em caso de sucesso, popula o ponteiro :c:var:`PyCurses_API`.

source: On failure, set :c:var:`PyCurses_API` to NULL and set an exception. The caller must check if an error occurred via :c:func:`PyErr_Occurred`:
pt_pt: Em caso de falha, define o :c:var:`PyCurses_API` como NULL e define uma exceção. O chamador deve verificar se ocorreu um erro através de :c:func:`PyErr_Occurred`:

source: import_curses(); // semi-colon is optional but recommended if (PyErr_Occurred()) { /* cleanup */ }
pt_pt: import_curses(); // o ponto e vírgula é opcional mas recomendado if (PyErr_Occurred()) { /* limpeza */ }

source: Dynamically allocated object containing the curses C API. This variable is only available once :c:macro:`import_curses` succeeds.
pt_pt: Objeto alocado dinamicamente que contém a API C do curses. Esta variável só está disponível após o sucesso de :c:macro:`import_curses`.

source: ``PyCurses_API[0]`` corresponds to :c:data:`PyCursesWindow_Type`.
pt_pt: ``PyCurses_API[0]`` corresponde a :c:data:`PyCursesWindow_Type`.

source: ``PyCurses_API[1]``, ``PyCurses_API[2]``, and ``PyCurses_API[3]`` are pointers to predicate functions of type ``int (*)(void)``.
pt_pt: ``PyCurses_API[1]``, ``PyCurses_API[2]`` e ``PyCurses_API[3]`` são ponteiros para funções de predicado do tipo ``int (*)(void)``.

source: When called, these predicates return whether :func:`curses.setupterm`, :func:`curses.initscr`, and :func:`curses.start_color` have been called respectively.
pt_pt: Quando chamados, estes predicados devolvem se :func:`curses.setupterm`, :func:`curses.initscr` e :func:`curses.start_color` foram chamados, respetivamente.

source: See also the convenience macros :c:macro:`PyCursesSetupTermCalled`, :c:macro:`PyCursesInitialised`, and :c:macro:`PyCursesInitialisedColor`.
pt_pt: Veja também as macros de conveniência :c:macro:`PyCursesSetupTermCalled`, :c:macro:`PyCursesInitialised` e :c:macro:`PyCursesInitialisedColor`.

source: The number of entries in this structure is subject to changes. Consider using :c:macro:`PyCurses_API_pointers` to check if new fields are available or not.
pt_pt: O número de entradas nesta estrutura está sujeito a alterações. Considere utilizar :c:macro:`PyCurses_API_pointers` para verificar se novos campos estão disponíveis ou não.

source: The number of accessible fields (``4``) in :c:var:`PyCurses_API`. This number is incremented whenever new fields are added.
pt_pt: O número de campos acessíveis (``4``) em :c:var:`PyCurses_API`. Este número é incrementado sempre que novos campos são adicionados.

source: The :ref:`heap type <heap-types>` corresponding to :class:`curses.window`.
pt_pt: O :ref:`tipo heap <heap-types>` correspondente a :class:`curses.window`.

source: Return true if *op* is a :class:`curses.window` instance, false otherwise.
pt_pt: Devolve true se *op* for uma instância de :class:`curses.window`, caso contrário devolve false.

source: The following macros are convenience macros expanding into C statements. In particular, they can only be used as ``macro;`` or ``macro``, but not ``macro()`` or ``macro();``.
pt_pt: As macros seguintes são macros de conveniência que se expandem para instruções C. Em particular, só podem ser usadas como ``macro;`` ou ``macro``, mas não como ``macro()`` ou ``macro();``.

source: Macro checking if :func:`curses.setupterm` has been called.
pt_pt: Macro que verifica se :func:`curses.setupterm` foi chamado.

source: The macro expansion is roughly equivalent to:
pt_pt: A expansão da macro é aproximadamente equivalente a:

source: Macro checking if :func:`curses.initscr` has been called.
pt_pt: Macro que verifica se :func:`curses.initscr` foi chamado.

source: Macro checking if :func:`curses.start_color` has been called.
pt_pt: Macro que verifica se :func:`curses.start_color` foi chamado.

source: Internal data
pt_pt: Dados internos

source: The following objects are exposed by the C API but should be considered internal-only.
pt_pt: Os seguintes objetos são expostos pela API C mas devem ser considerados como sendo apenas para uso interno.

source: Name of the curses capsule to pass to :c:func:`PyCapsule_Import`.
pt_pt: Nome da cápsula curses para passar a :c:func:`PyCapsule_Import`.

source: Internal usage only. Use :c:macro:`import_curses` instead.
pt_pt: Apenas para uso interno. Use :c:macro:`import_curses` em vez disso.
